export const hadithDetails = {

 phrases: [
  { text: 'عَنِ الأَغَرِّ بْنِ يَسَارٍ المُزَنِيِّ رَضِيَ اللهُ عَنْهُ قَالَ:', start: 0, end: 4.7 },
  { text: ' قَالَ رَسُولُ اللهِ ﷺ: ', start: 4.8, end: 7.4 },
  { text: '«يَا أَيُّهَا النَّاسُ، تُوبُوا إِلَى اللهِ وَاسْتَغْفِرُوهُ، فَإِنِّي أَتُوبُ فِي اليَوْمِ مِئَةَ مَرَّةٍ»', start: 7.5, end: 14 }
],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لاستغفر الله:</b> <span>  اطلب المغفره وهي الصفح عن الذنب واصل المغفره الستر.  </span></li>
        <li><b>اتوب اليه:</b> <span>  الرجوع من الذنب والندم على ما فرّط منه. </span></li>
      </ul>
    </div>
   

  `,
  // رابط صوت متن الحديث السادس
   audioUrl: 'audio/ryad-bab-2/hadith-14.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي: </b> <span>  الاغر بن يسار. </span>',
  '<b> ١- من المهاجرين الاوائل </b> ',
  '<b>٢- روي ثلاث احاديث عن رسول الله. </b> ',
  '<b> ٣- المزني نسبه الى قبيله مزينة.  </b> ',

];


export const hadithFawaedList = [
  '<b>١- دعوه الناس جميعهم محسنهم ومسيئهم الى التوبه والاستغفار. ',
  '<b>٢- الاقتداء برسول الله في قوله وفعله. </b>',
  '<b>٣- وجوب التوبه والاستغفار في كل وقت وعلى كل حال. </b> '
];


export const hadithFawaed = [
  '<b>١- طاعه لامر الله (يا ايها الذين امنوا توبوا الى الله توبه نصوحا).</b>',
  '<b>٢- سبب للفلاح في الدنيا والاخره (وتوبوا الى الله جميعا ايها المؤمنون).</b>',
  '<b> ٣- سبب لمحبه الله للعبد (ان الله يحب التوابين ويحب المتطهرين).</b> ', 
  '<b> ٤- سبب لدخول الجنه والنجاه من النار. </b> ', 
  '<b> ٥- سبب لنزول البركات من السماء وزياده القوه. </b> ', 
  '<b> ٦- سبب لتكفير السيئات وتبديلها بحسنات (فاولئك يبدل الله سيئاتهم حسنات).</b> ', 
];






