export const hadithDetails = {
  title: 'الحديث الثَّامِنُ',
  name: '[حُرْمَةُ الْمُسْلِمِ]',
  hintText: 'حرمة دم المسلم وصيانة أمواله.',
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ', start: 4.1, end: 7.5 },
    { text: 'عُمَرَ بْنِ الْخَطَّابِ الْقُرَشِيِّ الْعَدَوِيِّ رضي الله عنه', start: 7.6, end: 12.0 },
    { text: 'ؓقَالَ: سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ:', start: 12.1, end: 16.5 },
    { text: '«إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ،', start: 16.6, end: 20.0 },
    { text: 'وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى،', start: 20.1, end: 23.5 },
    { text: 'فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ،', start: 23.6, end: 29.0 },
    { text: 'وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا،', start: 29.1, end: 33.0 },
    { text: 'أَوْ امْرَأَةٍ يَنْكِحُهَا،', start: 33.1, end: 36.0 },
    { text: 'فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ».', start: 36.1, end: 40.5 },
    
    // التخريج
    { text: 'مُتَّفَقٌ عَلَى صِحَّتِهِ.', start: 40.6, end: 43.0 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>النية:</b> <span> هي القصد وعزيمه القلب</span></li>
        <li><b>هجرته:</b> <span>ترك الشيء والاعتراض عنه</span></li>
        <li><b>والهجره:</b> <span> الخروج من ارض الى ارض والمهاجرون هم الذين ذهبوا مع النبي.</span></li>
        <li><b>لدنيا:</b> <span>سميت بذلك لدنوها قبل الاخره, لدنوها الى النزول</span></li>
        <li><b>امرئ:</b> <span>انسان </span></li>
        <li><b>لدنيا يصيبها:</b> <span>لغرض دنيوي</span></li>
        <li><b>فهجرته الى الله ورسوله:</b> <span><b>قبولا وجزاء</b></span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/hadith/08.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:</b> امير المؤمنين عمر بن الخطاب.',
  '<b>١. الفاروق:</b> لقبه بذلك رسول الله.',
  'ثاني الخلفاء الراشدين.',
  'اسلم قبل الهجره بخمس سنوات.',
  '<b>٤. دعاء النبي :</b> اللهم اعز الاسلام باحد العمرين عمر بن الخطاب و عمرو بن هشام.',
  ' لم يزل الاسلام في اختفاء حتى اسلم عمر.',
  ' صاحب فتوحات الشام والعراق.',
  ' اول من وضع للعرب التاريخ الهجري.',
  'اول من دون الدواوين.',
  'اول من لقب بامير المؤمنين.',
  'انتصب في خلافته 12,000 منبر.',
  'ما كنا نصلي عند الكعبه حتى اسلم عمر.',
  ' دامت خلافته 10 سنوات.',
  'نزل في القران الكريم خمس مواضع تاييد لرأيه.',
  'طعنه ابو لؤلؤه الفارسي وهو في صلاه الصبح سنه 23 هجري وعمره 63 سنه.'
];

export const hadithFawaedList = [
  '• <b>سبب ورود الحديث:</b> قصه مهاجر ام قيس التي رفضت الزواج منه حتى يهاجر.',
  '• <b>اهميه الحديث:</b> هو ثلث الاسلام لان كسب العبد يقع بقلبه ولسانه وجوارحه فالنيه احد اقسام العباده الثلاثه لكنها تقع في القلب.'
];

export const hadithFawaed1 = [
  '<b>١. الحرص على النيه في الاعمال والعبادات:</b> في الاعمال سعي اركان ، والنيه سائق القلوب.', 
  '<b>٢. اساس اخلاص العمل النيه:</b> فنيه تؤثر بالعمل تاره تجعله حراما وتاره تجعله حلالا. مثل (الذبح اذا كان لله يحل ولغير الله يصبح حراما).',
  'من ينوي شيئا يحتسب له وان لم يعمل به لمانع شرعي.',
  'كل فعل مباح شرعا ينقلب قربا لله بنيه فاعله (كتناول الطعام بنيه التقوي على طاعه الله).',
  'النيه خاصه بصاحب العمل.',
  'ينبغي للمرء ان يكون عالي الهمه والنيه ولا يضع حظ النفس فيهاجر من الاكوان الى رب الاكوان.',
  'الحديث فيه دعوه لكسب المزيد من الحسنات (اذ يتضاعف جزاء العمل الواحد بتعبد نيته) مثل {الاضحيه لصلاه الارحام واطعام الفقراء وادخال السرور الى اهل بيته اضافه الى اجر الاضحيه}.'
];

export const hadithFawaed2 = [
  '<b>الاخلاص الله تعالى في العمل شرط من شروط قبول العمل.</b>',
  '<b> لا يجوز الاقدام على العمل قبل معرفه حكمه.</b>'
];
