export const hadithDetails = {
  title: 'الْحَدِيثُ الثَّانِي عَشَرَ',
  name: '[الِاشْتِغَالُ بِمَا يُفِيدُ]',
  hintText: 'من كمال إيمان المرء وتمام إسلامه أن يترك ما لا مصلحة له فيه ولا يعنيه.',
  phrases: [
    // 💡 عنوان الحديث في أول ثوانٍ
    { text: 'الْحَدِيثُ الثَّانِي عَشَرَ: [الِاشْتِغَالُ بِمَا يُفِيدُ].', start: 0, end: 4.0 },

    // راوي الحديث
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ:', start: 4.1, end: 7 },
    { text: 'قَالَ رَسُولُ اللَّهِ ﷺ:', start: 7.1, end: 10.2},
    
    // متن الحديث
    { text: '«مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ».', start: 10.3, end: 14.0 },
    
    // التخريج
    { text: 'حَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ وَغَيْرُهُ.', start: 14.1, end: 17 }
  ],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>حُسْنِ إِسْلَامِهِ:</b> <span>من كمال إسلامه وتمامه</span></li>
        <li><b>الْمَرْءِ:</b> <span>الإنسان، ذكراً كان أم أنثى.</span></li>
        <li><b>تَرْكُهُ:</b> <span>الترك هو الكف والامتناع عن فعل الشيء.</span></li>
        <li><b>مَا لَا يَعْنِيهِ:</b> <span>ما لا تتعلق عنايته ولا مصلحة به.</span></li>
      </ul>
    </div>
  `,
  audioUrl: 'audio/hadith/12.mpeg'
};

export const hadithImportanceList = [
  '<b>الاشتغال بما يفيد ترك مالا يفيد.</b>',
  '<b>تأديب النفس وتهذيبها من الرذائل والنقائص.</b>',
  '<b>على الإنسان الإشتغال بما فيه صلاحه معاشاً ومعاداً.</b>'
];
// 📝 الصندوق الثاني: من فوائد الحديث الشريف
export const hadithFawaedList = [
  '<b>من حكم لقمان:</b><br>' +
  'قيل للقمان: ما بلغ بك ما نرى؟ يريدون الفضل. فقال: <i>"صدق الحديث، وأداء الأمانة، وترك ما لا يعنيني"</i>.',

  '<b>من مواعظ الحسن:</b><br>' +
  ' <i>"من علامة إعراض الله تعالى عن العبد أن يجعل شغله فيما لا يعنيه"</i>.',

  '<b>جماع آداب الخير في أربع أحاديث:</b><br>' +
  '• ١. حديث: <i>"من كان يؤمن بالله واليوم الآخر"</i>.<br>' +
  '• ٢. حديث: <i>"من حسن إسلام المرء"</i>.<br>' +
  '• ٣. حديث: <i>"لا تغضب"</i>.<br>' +
  '• ٤. حديث: <i>"لا يؤمن أحدكم"</i>.'

];
