export const hadithDetails = {
  title: 'الحَدِيثُ الخَامِسَ عَشَر',
  name: '[مِن خِصَالِ الإِيمَان]',
  hintText: 'ليس اكرام الضيف بطيب الطعام ، بل بطيب النفس ، وبشاشه الوجه.',

  phrases: [
    { text: ' الحَدِيثُ الخَامِسَ عَشَر: [مِن خِصَالِ الإِيمَان]', start: 0, end: 4.9 },
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:', start: 5, end: 12.4 },
    { text: '«مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ،', start: 12.5, end: 18 },
    { text: 'وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ،', start: 18.1, end: 23},
    { text: 'وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ».', start: 23.1, end: 29 },
    { text: 'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ.', start: 29.1, end: 32.0 }
  ],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>من كان يؤمن:</b> <span>الايمان الكامل.</span></li>
        <li><b>من كان يؤمن بالله واليوم الاخر:</b> <span>قاعده الانطلاق في العمل الاسلامي من فعل او ترك ، فمنطلق اي عمل هو الايمان بالله واليوم الاخر.</span></li>
        <li><b>اليوم الاخر:</b> <span>يوم القيامه يوم الجزاء والحساب.</span></li>
        <li><b>فليقل خيرا:</b> <span>يتكلم بامور الخير ومنها:
        <br>١. التبليغ عن الله ورسوله 
        <br>٢. الامر بالمعروف والنهي عن المنكر.
        <br>٣. كلمه حق عند سلطان جائر</span></li>
        <li><b>او ليصمت:</b> <span>يسكت.</span></li>
        <li><b>فليقل خيرا او ليصمت:</b> <span>يدل على ان قول الخير خير من الصمت ، والصمت خير من قول الشر.</span></li>
      </ul>
    </div>
  `,
  audioUrl: 'audio/hadith/15.mpeg'
};
// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'• <b>لجار ثلاثه انواع:</b><br>١. الجار القريب: من ذوي القربى وله ثلاثه حقوق: حق القرابه _ وحق الجوار _ وحق الاسلام.<br>٢. الجار غير القريب: وله حق الجوار والاسلام. <br>٣. الجار غير المسلم: وله حق الجوار.',
  '• <b>قال ﷺ "ما زال جبريل يوصيني بالجار حتى ظننت انه سيورثه".</b>',
  '• <b>اختلف الفقهاء في اكرام الضيف ، منهم من قال واجب ، ومنهم من قال مستحب.</b>',
  '• <b>من اكرام الضيف:</b><br>١. البشاشه في وجهه <br>٢. طيب الحديث معه <br>٣. اطعام الطعام'
];

export const hadithFawaedList = [
'• <b>١. منطلق جميع الاعمال هو الايمان بالله واليوم الاخر.</b>',
  '• <b>٢. الحث على قول الخير ،  واكرام الضيف ، واكرام الجار.</b>',
  '• <b>٣. على المرء التأني والتفكير قبل التكلم.</b>',
  '• <b>٤. ليس اكرام الضيف بطيب الطعام ، بل بطيب النفس ، وبشاشه الوجه.</b>',
  '• <b>٥. يجب الامر بالمعروف عن علم ، وانكار المنكر عن علم.</b>'
];

export const hadithFawaed1 = [
'• <b>١. لا تكونوا اصحاب فتن.</b>',
  '• <b>٢. من عد كلامه من عمله ← قل كلامه فيما لا يعنيه.</b>',
  '• <b>٣. من آمن بالله الايمان الحق وخاف وعيده ضبط جوارحه وفي مقدمتها اللسان.</b>'
];