export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ:', start: 0, end: 3.3 },
  { text: 'قَالَ رَسُولُ اللهِ ﷺ:', start: 3.4, end: 6.4 },
  { text: '«مَنْ تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا تَابَ اللهُ عَلَيْهِ»', start: 6.5, end: 11 }
],

  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-17.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>١. من شروط قبول التوبه ان تقع قبل طلوع الشمس من مغربها. </b>',
'<b>٢. على المؤمن المبادره بالاعمال الصالحه قبل ان لا يقدر عليها ويحال بينه وبينها اما بمرض او بموت ، او ان يدركه طلوع الشمس من المغرب (من هذه الايات) لا يقبل منه العمل.</b>',

];




