export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَبِي الْعَبَّاسِ عَبْدِ اللهِ بْنِ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ رَضِيَ اللهُ عَنْهُمَا، ', start: 0, end: 6.6 },
    { text: 'عَنْ رَسُولِ اللهِ ﷺ،', start: 6.7, end: 9.5 },
    { text: 'فِيمَا يَرْوِي عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، قَالَ:', start: 9.6, end: 13.8 },
    { text: '«إِنَّ اللهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ', start: 13.9, end: 16.4 },
    { text: 'ثُمَّ بَيَّنَ ذَلِكَ: ', start: 16.5, end: 18 },
    { text: 'فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا ', start: 18.1, end: 21.7 },
    { text: 'كَتَبَهَا اللهُ تَبَارَكَ وَتَعَالَى عِنْدَهُ حَسَنَةً كَامِلَةً،', start: 21.8, end: 25.8 },
    { text: 'وَإِنْ هَمَّ بِهَا فَعَمِلَهَا', start: 25.9, end: 28},
    { text: 'كَتَبَهَا اللهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ', start: 28.1, end: 35.5},
    { text: '. وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا ', start: 35.6, end: 38 },
    { text: 'كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً،', start: 38, end: 42 },
    { text: 'وَإِنْ هَمَّ بِهَا فَعَمِلَهَا', start: 42.1, end: 43.5 },
    { text: 'كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً»', start: 43.6, end: 47 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>تبارك:</b> <span>تكاثر خيره.</span></li>
         <li><b>تعالى:</b> <span>تنزه عما لا يليق به.</span></li>
        <li><b>بين ذلك:</b> <span>فصل.</span></li>
         <li><b>هم:</b> <span>نواه واراده.</span></li>
         <li><b>ضعف:</b> <span>زاد على اصل الشيء.</span></li>
      </ul>
    </div>
  `,
 
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/ryad-bab-1/hadith-11.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b>ابو العباس.',
  '• ١. عبد الله بن عباس ابن عم الرسول امه لبابه بنت الحارث ابنه خالة خالد وابن اخت السيده ميمونه.',
  '• ٢. ولد قبل الهجره بثلاث سنوات في شعب ابي طالب.  ',
  '• ٣. حنكه رسول الله برقيه ودعا له.',
  '•  ٤. سمي بترجمان القران. ',
  '•  ٥. وسمي البحر لسعه علمه. ',
  '• ٦. وسماه جرير بالحبر.  ',
  '• ٧. ضمه رسول الله ودعا له (اللهم علمه الحكمه).',
  '•  ٨. كان عمر اذا اعضلته قضيه رجع الى ابن عباس وقال له فانت لها ولامثالها.',
  '•  ٩. اذا رايت ابن عباس قلت اجمل الناس واذا نطق افصح الناس واذا تحدث اعلم الناس.  ',
  '•  ١٠. قيل عندما توفي ودفن بطل في كفنه طائره ابيض لم يخرج. ',
 
];

export const hadithFawaedList = [
'• <b>  ١. بيان فضل الله على هذه الامه فلولا فضله لما دخل احد الجنه لان عمل العباد سيئات اكثر من الحسنات.</b>',
'• <b>  ٢. الاثابه على الهم بالحسنه وعدم المؤاخذه على الهم بالسيئه. </b>',
'• <b> ٣. على العبد ان يترك لذاته وشهواته من اجل الله ورغبة في الثواب ورهبة من العقاب. </b>',
'• <b> ٤. ان الله بكرمه جعل العدل بالسيئه والفضل في الحسنه فيضاعف الحسنه ولا يضاعف السيئه. </b>',
'• <b>٥.الحفظة على علم بما في قلوب بني ادم منخير او شر فيكتبونه اذا حدث به نفسه اوعزم عليه.</b>',
];