export const hadithDetails = {
  title: 'الحديث الثَّامِنُ',
  name: '[حُرْمَةُ الْمُسْلِمِ]',
  hintText: 'حرمة دم المسلم وصيانة أمواله.',
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
   // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ رَضِيَ اللهُ عَنْهَا قَالَتْ:', start: 4.1, end: 10.0 },
    { text: 'قَالَ رَسُولُ اللهِ ﷺ:', start: 10.1, end: 12.5 },
    { text: '«يَغْزُو جَيْشٌ الْكَعْبَةَ،', start: 12.6, end: 15.5 },
    { text: 'فَإِذَا كَانُوا بِبَيْدَاءَ مِنَ الأَرْضِ', start: 15.6, end: 19.0 },
    { text: 'يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ».', start: 19.1, end: 22.5 },
    { text: 'قَالَتْ:', start: 22.6, end: 24.0 },
    { text: 'قُلْتُ: يَا رَسُولَ اللهِ،', start: 24.1, end: 27.0 },
    { text: 'كَيْفَ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ وَفِيهِمْ أَسْوَاقُهُمْ', start: 27.1, end: 32.5 },
    { text: 'وَمَنْ لَيْسَ مِنْهُمْ؟!ِ', start: 32.6, end: 36.0 },
    { text: 'قَالَ: «يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ،', start: 36.1, end: 40.0 },
    { text: 'ثُمَّ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ»', start: 40.1, end: 44.5 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>البيداء:</b> <span>  ارض الفقر التي لا شيء فيها./span></li>
        <li><b>يخسف:</b> <span> خسف بالرجل اذا اخذته الارض وغاب.</span></li>
        <li><b>اسواقهم:</b> <span>الرعية من دون الملك ومن لم يكن ذا سلطان.</span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/hadith/08.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:</b> امير المؤمنين عمر بن الخطاب.',
  '<b>١. الفاروق:</b> لقبه بذلك رسول الله.',
  'ثاني الخلفاء الراشدين.',
  'اسلم قبل الهجره بخمس سنوات.',
  '<b>٤. دعاء النبي :</b> اللهم اعز الاسلام باحد العمرين عمر بن الخطاب و عمرو بن هشام.',
  ' لم يزل الاسلام في اختفاء حتى اسلم عمر.',
  ' صاحب فتوحات الشام والعراق.',
  ' اول من وضع للعرب التاريخ الهجري.',
  'اول من دون الدواوين.',
  'اول من لقب بامير المؤمنين.',
  'انتصب في خلافته 12,000 منبر.',
  'ما كنا نصلي عند الكعبه حتى اسلم عمر.',
  ' دامت خلافته 10 سنوات.',
  'نزل في القران الكريم خمس مواضع تاييد لرأيه.',
  'طعنه ابو لؤلؤه الفارسي وهو في صلاه الصبح سنه 23 هجري وعمره 63 سنه.'
];

export const hadithFawaedList = [
  '• <b>الانسان يعامل بقصد من الخير او الشر </b> ',
  '• <b> التحذير من مصاحبه اهل الظلم والفجور والحث على مصاحبه الاخيار </b> ',
  '• <b> اخبار رسول الله عن المغيبات وهي يجب الايمان بها والايمان انها استقى لان رسول الله لا ينطق عن الهوى.</b> '
];
