export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
   // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ رَضِيَ اللهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللهِ ﷺ:', start: 0, end: 7.7},
    { text: '«يَغْزُو جَيْشٌ الْكَعْبَةَ،', start: 7.8, end: 10 },
    { text: 'فَإِذَا كَانُوا بِبَيْدَاءَ مِنَ الأَرْضِ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ».', start: 10.1, end: 14.7 },
    { text: 'قَالَتْ: قُلْتُ: يَا رَسُولَ اللهِ،', start: 14.8, end: 17.8 },
    { text: 'كَيْفَ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ وَفِيهِمْ أَسْوَاقُهُمْ وَمَنْ لَيْسَ مِنْهُمْ؟!ِ', start: 17.9, end: 22.6 },
    { text: 'قَالَ: «يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ، ثُمَّ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ»', start: 26.7, end: 28 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>البيداء:</b> <span>ارض الفقر التي لا شيء فيها./span></li>
        <li><b>يخسف:</b> <span>خسف بالرجل اذا اخذته الارض وغاب.</span></li>
        <li><b>اسواقهم:</b> <span>الرعية من دون الملك ومن لم يكن ذا سلطان.</span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
 audioUrl: 'audio/ryad-bab-1/hadith-2.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:</b> ام المؤمنين ام عبد الله عائشه. ',
  '١. افقه نساء المسلمين واعلمهم بالحلال والحرام. ',
  '٢. امها ام رومان. ',
  '٣. بنت الصديق. ',
  '٤. هي الزوجه البكر الوحيده. ',
  '٥. تزوجها وعمرها تسع سنوات. ',
  '٦. ما رايت احدا اعلم بفقه ولا بطب ولا بشعر من عائشه. ',
  '٧. فضل عائشه على النساء كفضل الثريد على سائر الطعام.',
  '٨. ربع الاحكام الشرعيه اخذت من عائشه.',
'٩. مات النبي وعمرها 18 سنه. ', 
'١٠. فضلت على نساء النبي العشره.',
'١١. لم ينكح بكر قط غيري. ',
'١٢. لما ينكح امراه ابوها مهاجرين غيري. ',
'١٣. انزل الله براءتي من السماء. ',
'١٤. جاء جبريل بصورتي من السماء فيه حريره. ',
'١٥. كنت اغتسل انا وهو في اناء واحد. ',
'١٦. كنت اصلي وانا معترضه بين يديه ',
'١٧. كان ينزل عليه الوحي وهو معي ',
'١٨. قبضه الله وهو بين سحري ونحري ',
'١٩. مات في ليلتي ',
'٢٠. دفن في بيتي',
'٢١. قال لها رسول الله تكني بابن اختك (ام عبد الله) ',
'٢٢. توفيت في المدينه في زمن معاويه '
];

export const hadithFawaedList = [
  '• <b>الانسان يعامل بقصد من الخير او الشر </b> ',
  '• <b> التحذير من مصاحبه اهل الظلم والفجور والحث على مصاحبه الاخيار </b> ',
  '• <b> اخبار رسول الله عن المغيبات وهي يجب الايمان بها والايمان انها استقى لان رسول الله لا ينطق عن الهوى.</b> '
];
