export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَبِي يَزِيدَ مَعْنِ بْنِ يَزِيدَ بْنِ الأَخْنَسِ رَضِيَ اللهُ عَنْهُمْ،', start: 0, end: 5.3 },
    { text: 'وَهُوَ وَأَبُوهُ وَجَدُّهُ صَحَابِيُّونَ،', start: 5.4, end:  8.3},
    { text: 'قَالَ: كَانَ أَبِي يَزِيدُ', start: 8.4, end: 10.2},
    { text: 'أَخْرَجَ دَنَانِيرَ يَتَصَدَّقُ بِهَا،', start: 10.3, end: 13.2 },
    { text: 'فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ،', start: 13.3, end: 15.9 },
    { text: 'فَجِئْتُ فَأَخَذْتُهَا فَأَتَيْتُهُ بِهَا،', start: 16, end: 19.2 },
    { text: 'فَقَالَ: وَاللهِ مَا إِيَّاكَ أَرَدْتُ،', start: 19.3, end: 22.8 },
    { text: 'فَخَاصَمْتُهُ إِلَى رَسُولِ اللهِ ﷺ، فَقَالَ:', start: 22.9, end: 27.2 },
    { text: '«لَكَ مَا نَوَيْتَ يَا يَزِيدُ،', start: 27.3, end: 29 },
    { text: 'وَلَكَ مَا أَخَذْتَ يَا مَعْنُ»', start: 29.1, end: 31 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>خاصمته:</b> <span>جادلته. </span></li>
        <li><b>لك ما نويت:</b> <span>ثوابه.</span></li>
         <li><b>لك ما اخذت:</b> <span> لك ملك ذلك.  </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
 audioUrl: 'audio/ryad-bab-1/hadith-5.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> معن بن يزيد ويكنى ابا يزيد.',
  '• <b>١. شهد بدراً هو وابيه وجده ولا يعرف احد شهد بدراً هو وابوه وجده غيره.</b>',
  '• <b>٢. بايع رسول الله ﷺ هو وابوه وجده.</b>',
  '• <b>٣. كان له مكانة عند عمر. </b>',
 
];

export const hadithFawaedList = [
  '• <b>صدقه التطوع يجوز دفعها للفروع اما الصدقه الواجبه (الزكاه) فلا يجوز دفعها لا للفروع ولا للاصول. </b>',
  '• <b>  للمتصدق اجر ما نوى سواء من اخذها كان يستحقها ام لا. </b>',
  '• <b>جواز التوكيل في توزيع الصدقه. </b>',
'• <b> جواز التحاكم بين الاب وابنه الا ان يكون عقوقاً.</b>'
];