export const hadithDetails = {
  title: 'الحديث الثَّامِنُ',
  name: '[حُرْمَةُ الْمُسْلِمِ]',
  hintText: 'حرمة دم المسلم وصيانة أمواله.',
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَبِي يَزِيدَ مَعْنِ بْنِ يَزِيدَ بْنِ الأَخْنَسِ رَضِيَ اللهُ عَنْهُمْ،', start: 4.1, end: 10.0 },
    { text: 'وَهُوَ وَأَبُوهُ وَجَدُّهُ صَحَابِيُّونَ،', start: 10.1, end: 13.5 },
    { text: 'قَالَ: كَانَ أَبِي يَزِيدُ', start: 13.6, end: 16.0 },
    { text: 'أَخْرَجَ دَنَانِيرَ يَتَصَدَّقُ بِهَا،', start: 16.1, end: 19.5 },
    { text: 'فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ،', start: 19.6, end: 23.5 },
    { text: 'فَجِئْتُ فَأَخَذْتُهَا فَأَتَيْتُهُ بِهَا،', start: 23.6, end: 28.0 },
    { text: 'فَقَالَ:', start: 28.1, end: 29.5 },
    { text: 'وَاللهِ مَا إِيَّاكَ أَرَدْتُ،', start: 29.6, end: 32.0 },
    { text: 'فَخَاصَمْتُهُ إِلَى رَسُولِ اللهِ ﷺ، فَقَالَ:', start: 32.1, end: 37.5 },
    { text: '«لَكَ مَا نَوَيْتَ يَا يَزِيدُ،', start: 37.6, end: 41.0 },
    { text: 'وَلَكَ مَا أَخَذْتَ يَا مَعْنُ»', start: 41.1, end: 44.5 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>خاصمته:</b> <span> جادلته </span></li>
        <li><b>لك ما نويت:</b> <span>ثوابه</span></li>
         <li><b>لك ما اخذت:</b> <span> لك ملك ذلك.  </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/hadith/08.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> معن بن يزيد ويكنى ابا يزيد.',
  '• <b>١. شهد بدراً هو وابيه وجده ولا يعرف احد شهد بدراً هو وابوه وجده غيره.</b>',
  '• <b>٢. بايع رسول الله ﷺ هو وابوه وجده.</b>',
  '• <b>٣. كان له مكانة عند عمر. </b>',
 
];

export const hadithFawaedList = [
  '• <b>. صدقه التطوع يجوز دفعها للفروع اما الصدقه الواجبه (الزكاه) فلا يجوز دفعها لا للفروع ولا للاصول. </b>',
  '• <b>  للمتصدق اجر ما نوى سواء من اخذها كان يستحقها ام لا. </b>',
  '• <b>جواز التوكيل في توزيع الصدقه. </b>',
'• <b> جواز التحاكم بين الاب وابنه الا ان يكون عقوقاً.</b>'
];