export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا قَالَتْ: قَالَ النَّبِيُّ ﷺ:', start: 0, end: 5.6 },
    { text: '«لَا هِجْرَةَ بَعْدَ الْفَتْحِ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ،', start: 5.6, end: 9.5 },
    { text: 'وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا ».', start: 9.6,  end: 12 },
   
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>الهجره:</b> <span>الخروج من ارض الى ارض هجر الشيء يعني تركه.</span></li>
        <li><b>الجهاد:</b> <span> محاربه الكفار استفراغ ما في الوسع والطاقه من قول او فعل.</span></li>
        <li><b>استنفرتم:</b> <span>طلب منكم الخروج للجهاد , استنصرتم.</span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
 audioUrl: 'audio/ryad-bab-1/hadith-3.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:</b> عن ام المؤمنين عن عائشه.',
  '<b>بشاره الى ان مكه تبقى دار الاسلام ابدا. </b>',
  '<b>يجب قصد الجهاد والاستعداد له وان يلبي داعي الجهاد اذا دعاه.</b> ',
 '<b>الاعمال تعتبر بالنيات. </B> ',
  '<b>الخير الذي انقطع من قطاع الهجره يمكن تحصيله بالجهاد والنية الصالحه.</b>',
 
];
