export const hadithDetails = {
  title: 'الحديث ',
  name: '[حُرْمَةُ الْمُسْلِمِ]',
  hintText: 'حرمة دم المسلم وصيانة أمواله.',
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا قَالَتْ:', start: 4.1, end: 8.5 },
    { text: 'قَالَ النَّبِيُّ ﷺ:', start: 8.6, end: 11.0 },
    { text: '«لَا هِجْرَةَ بَعْدَ الْفَتْحِ،', start: 11.1, end: 14.5 },
    { text: 'وَلَكِنْ جِهَادٌ وَنِيَّةٌ،', start: 14.6, end: 17.5 },
    { text: 'وَإِذَا اسْتُنْفِرْتُمْ', start: 17.6, end: 20.0 },
    { text: ' فَانْفِرُوا ».', start: 20.1, end: 23.5 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>الهجره:</b> <span>الخروج من ارض الى ارض هجر الشيء يعني تركه.</span></li>
        <li><b>الجهاد:</b> <span> محاربه الكفار استفراغ ما في الوسع والطاقه من قول او فعل.</span></li>
        <li><b>استنفرتم:</b> <span>طلب منكم الخروج للجهاد , استنصرتم.</span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/hadith/08.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:</b> عن ام المؤمنين عن عائشه.',
  '<b>بشاره الى ان مكه تبقى دار الاسلام ابدا. </b>',
  '<b>يجب قصد الجهاد والاستعداد له وان يلبي داعي الجهاد اذا دعاه.</b> ',
 '<b>الاعمال تعتبر بالنيات. </B> ',
  '<b>الخير الذي انقطع من قطاع الهجره يمكن تحصيله بالجهاد والنية الصالحه.</b>',
 
];
