export const ALL_HADITHS: { [key: string]: any } = {
  '1': {
    title: 'الحديث الأول:', 
    name: 'الحديث الأول:  [الأعمال بالنيات]', 
    hintText: 'إجعل عملك خالص لله تعالى.',
    audioUrl: 'audio/hadith/01.mpeg', // تأكدي من مسار ملف الصوت عندك
  phrases: [
    // 💡 هنا ينطق العنوان في أول ثانيتين
    { text: 'الْحَدِيثُ الْأَوَّلُ: الْأَعْمَالُ بِالنِّيَّاتِ.', start: 0, end: 5.6 },

    // يبدأ عَنْ أَمِيرِ الْمُؤْمِنِينَ...
    { text: 'عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ:', start: 5.7, end: 12.4},
       { text: ' سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ:', start: 12.5, end: 17},
    { text: '«إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ،', start: 17.1, end: 19.6},
    { text: 'وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى؛', start: 19.7, end: 22.7 },
    { text: 'فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللهِ وَرَسُولِهِ،', start: 22.7, end: 29.1 },
    { text: 'وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا».', start: 29.2, end: 33},
    { text: 'أَوْ امْرَأَةٍ يَنْكِحُهَا.', start: 33.1, end: 35.6 },
    { text: 'فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ».', start : 35.7, end: 38.7}, 
    // 💡 ينطق التخريج بالعربي فقط، ثم يبدأ الصمت حتى نهاية الملف
    { text: 'رواه: البخاري ومسلم.' , start : 38.8, end: 41},
   
    
  ],
  // الشرح والمفردات التي تظهر عند الضغط على الحديث
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>النيه لغه:</b> <span>قصد الشيء</span></li>
        <li><b>النية اصطلاحا:</b> <span>قصد الشيء مقترنا بفعله</span></li>
        <li><b>لكل امرئ:</b> <span>تشمل كل الناس ذكر او انثى</span></li>
        <li><b> هجرته - الهجرة لغة: </b> <span>الترك</span></li>
        <li><b>الهجرة اصطلاحا:</b> <span>ترك دار الكفر الى دار الاسلام</span></li>
        <li><b>فهجرته الى الله ورسوله:</b> <span>اي وقع الاجر وقبلت النية</span></li>
        <li><b>لدنيا يصيبها:</b> <span>اي عمل ينوي به غير الآخرة</span></li>
        <li><b>سميت بالدنيا:</b> <span>اما دنو منزله لانها ادنى من الاخره او دنو زمن لانها تاتي قبلها</span></li>
        <li><b>او امرأة ينكحها:</b> <span>يتزوجها ليس فيها اجر الهجرة</span></li>
        <li><b>الهجره كانت من الامور العظيمه في الاسلام:</b> <span>لذلك وضعها سيدنا عمر تاريخا للمسلمين لان الامم اعتادت ان تؤرخ باحداثها العظام فلم يجد سيدنا عمر اعظم من الهجره فكانت مبدأ تاريخ المسلمين</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
    'لا يعتد بالاعمال بدون نيه',
    'الهجره واجبه من دار الكفر الى دار الايمان اذا لم يستطع ان يقوم المسلم بامور دينه',
    'انعقاد الاجر حتى لو لم يقم صاحبه به',
    'اساس العمل الاخلاص لله وحده',
    'كل عمل مباح يصبح قربى لله اذا كان خالصا لله'
    ],
    box2Title: '', // اتركيه فارغاً إذا لم يكن هناك صندوق ثاني
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الأول من الأربعين النووية (الأعمال بالنيات)، مع إضاءات من حياة الراوي عمر بن الخطاب رضي الله عنه وفوائد الحديث.',
    metaKeywords:'الأعمال بالنيات, الحديث الأول, الأربعون النووية, عمر بن الخطاب, شرح الحديث',
    quizQuestions: { 
    hadith_title_prov: 'شرح الحديث الأول', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: 'من هو راوي الحديث الأول؟',
      options: ['أبو هريرة', 'عمر بن الخطاب', 'علي بن أبي طالب'],
      correctAnswer: 'عمر بن الخطاب',
    
     }  ] } 
  },

  '2': {
    title: 'الحديث الثاني',
    name:  'الحديث الثاني: [مراتب الدين: الإسلام والإيمان والإحسان] ',
    hintText: 'كل مؤمن مسلم وليس كل مسلم مؤمن',
    audioUrl: 'audio/hadith/02.mpeg',
    phrases: [
    { text: 'الْحَدِيثُ الثَّانِي: مراتب الدين: الإسلام والإيمان والإحسان', start: 0, end: 9 },
    { text: 'عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضاً قَالَ:', start: 9.1, end: 12.5 },
    { text: 'بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللهِ ﷺ ', start: 12.5, end: 17.5 },
    { text: 'إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ،', start: 17.6, end: 21.5 },
    { text: 'شَدِيدُ سَوَادِ الشَّعَرِ،', start: 21.5, end: 23.5 },
    { text: 'لاَ يُرَى عَلَيْهِ أَثَرُ السَّفَرِ،', start: 23.6, end: 26 },
    { text: 'وَلاَ يَعْرِفُهُ مِنَّا أَحَدٌ،', start: 26.1, end: 28.9 },
    { text: 'حَتَّى جَلَسَ إِلَى النَّبِيِّ ﷺ،', start: 29, end: 33.2 },
    { text: 'فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ،', start: 33.3, end: 36.4 },
    { text: 'وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ،', start: 36.5, end: 39 },
    { text: 'وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَمِ،', start: 39.1, end: 44.2 },
    { text: 'فَقَالَ رَسُولُ اللهِ ﷺ:', start: 44.3, end: 48 },
    
    // 💡 هنا تبدأ الدقيقة الأولى (تم التحويل إلى ثوان مستمرة)
    { text: 'الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّداً رَسُولُ اللهِ،', start: 48.1, end: 55 }, 
    { text: 'وَتُقِيمَ الصَّلاَةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلاً.', start: 55.1, end: 65 }, // 1.05 -> 65s
    { text: 'قَالَ: صَدَقْتَ.', start: 65.1, end: 67 },        // 1.05 -> 65s | 1.07 -> 67s  
    { text: 'فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ!،', start: 67.1, end: 71 },   // 1.08 -> 68s | 1.11 -> 71s
    { text: 'قَالَ: فَأَخْبِرْنِي عَنِ الإِيمَانِ،', start: 71.1, end: 74.2 },    // 1.12 -> 72s | 1.15 -> 75s
    { text: 'قَالَ: أَنْ تُؤْمِنَ بِاللهِ،وَمَلاَئِكَتِهِ،وَكُتُبِهِ،وَرُسُلِهِ،وَالْيَوْمِ الآخِرِ،', start: 74.3, end: 80.9 }, // 1.16 -> 76s | 1.22 -> 82s
    { text: 'وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ.', start: 81, end: 84.5 }, // 1.23 -> 83s | 1.26 -> 86s
    { text: 'قَالَ: صَدَقْتَ.', start: 84.6, end: 86 },        // 1.27 -> 87s | 1.29 -> 89s
    { text: 'قَالَ: فَأَخْبِرْنِي عَنِ الإِحْسَانِ،', start: 86.1, end: 88.9 }, // 1.30 -> 90s | 1.32 -> 92s
    { text: 'قَالَ: أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ،', start: 89, end: 93.3 }, // 1.33 -> 93s | 1.36 -> 96s
    { text: 'فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ.', start: 93.4, end: 96.2 }, // 1.37 -> 97s | 1.40 -> 100s
    
    // 💡 هنا تبدأ الدقيقة الثانية
    { text: 'قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ،', start: 96.3 , end: 99.2 }, // 1.41 -> 101s | 1.44 -> 104s
    { text: 'قَالَ: مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ.', start: 99.3, end: 103.5 }, // 1.45 -> 105s | 1.50 -> 110s
    { text: 'قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا،', start: 103.6, end: 107 }, // 1.51 -> 111s | 1.53 -> 113s
    { text: 'قَالَ: أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا،', start: 107.1, end: 110.5 }, // 1.54 -> 114s | 1.57 -> 117s
    { text: 'وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ.', start: 110.6, end: 118 }, // 1.58 -> 118s | 2.04 -> 124s
    { text: 'ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا ،', start: 118.1, end: 123 }, // 2.05 -> 125s | 2.10 -> 130s
    { text: ' ثُمَّ قَالَ : يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟،', start: 123.1, end: 127.3 }, // 2.11 -> 131s | 2.17 -> 137s
    { text: ' قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ،', start: 127.4, end: 130 }, // 2.11 -> 131s | 2.17 -> 137s
    { text: 'قَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ.', start: 130.1, end: 136.5 }, // 2.18 -> 138s | 2.24 -> 144s
    { text: 'رَوَاهُ مُسْلِمٌ.', start: 136.6, end: 139}          // 2.25 -> 145s | 2.26 -> 146s
  ],
  // الشرح والمفردات
// الشرح والمفردات المحدثة بهيكل القوائم المنظمة
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>بينما:</b> <span>ظرف ياتي للزمان او المكان.</span></li>
        <li><b>إذ طلع:</b> <span>إذ فجائية، اي خرج علينا فجأة.</span></li>
        <li><b>سيدنا جبريل جاء معلما على هيئه المتعلم:</b> <span>(سيدنا الامام مالك: كان اذا اراد ان يحدث عن النبي ﷺ يلبس اجمل الثياب).</span></li>
        <li><b>لا يرى عليه اثر السفر:</b> <span>ليس عليه اثار السفر.</span></li>
        <li><b>ولا يعرفه منا احد:</b> <span>ليس من اهل المدينه.</span></li>
        <li><b>حتى جلس الى النبي ﷺ:</b> <span>جلس جلسه المتعلم المتأدب ووضع كفيه على فخذيه: قيل على فخذي نفسه كهيئه المتأدب، وقيل على فخذي النبي ﷺ، والروايه الاولى اصح واشهر.</span></li>
        <li><b>يا محمد:</b> <span>حدثه بطريقه الاعراب في الطلب (طبع جلف).</span></li>
        <li><b>اخبرني عن الاسلام - الاسلام لغة:</b> <span>الاستسلام والانقياد.</span></li>
        <li><b>الاسلام اصطلاحا:</b> <span>اركان الاسلام التي ذكرها النبي ﷺ، فالاسلام هو الاعمال الظاهره.</span></li>
        <li><b>ان تشهد ان لا اله الا الله:</b> <span>اي (لا معبود بحق الا الله): الاقرار.</span></li>
        <li><b>وان محمدا رسول الله:</b> <span>لانه من لوازم الايمان  بالله، الايمان برساله النبي ﷺ وانه مرسل من عند الله تعالى.</span></li>
        <li><b>تقيم الصلاه - الصلاه لغه:</b> <span>الدعاء.</span></li>
        <li><b>الصلاه اصطلاحا:</b> <span>مجموعه اقوال وافعال مفتتحه بالتكبير ومختتمه التسليم.</span></li>
        <li><b>معنى تقيم الصلاه:</b> <span>اي تأتي بها تامه الاركان والاداب والسنن والشروط.</span></li>
        <li><b>الشرط:</b> <span>ما لا يتم الواجب الا به ويكون خارجا عن ماهيته مثل (الوضوء شرط للصلاه).</span></li>
        <li><b>الركن:</b> <span>ما لا يتم الواجب الا به ويكون داخلا في ماهيته مثل (السجود والركوع في الصلاه).</span></li>
        <li><b>اي الشرط خارج العباده والركن داخل العباده.</b> </li>
        <li><b> تؤتى الزكاه: الزكاه لغه:</b> <span>نماء ونقاء.</span></li>
        <li><b>الزكاه اصطلاحا:</b> <span>مال مخصوص من الاغنياء يعطى الى الفقراء.</span></li>
        <li><b>الصيام - الصيام لغه:</b> <span>الامساك.</span></li>
        <li><b>الصيام اصطلاحا:</b> <span>الامساك عن المفطرات من طلوع الفجر الصادق الى غروب الشمس بنية.</span></li>
        <li><b>فعجبنا له يسأله ويصدقه:</b> <span>لان سؤاله يدل على جهله بالمسؤول عنه وتصديقه يدل على علمه به.</span></li>
        <li><b>الايمان لغه:</b> <span>التصديق.</span></li>
        <li><b>الايمان اصطلاحا:</b> <span>هو الاعتقاد الجازم بالقلب، وقيل هو : اعتقاد بالقلب ونطق باللسان وعمل بالجوارح والاركان.</span></li>
        <li><b>الملائكه:</b> <span>مخلوقات نورانيه لا يعصون الله ما امرهم ويفعلون ما يؤمرون، ولا يتصفون بذكوره او انوثه ولا يعلم عددهم ان الله تعالى.</span></li>
        <li><b>كتبه:</b> <span>اي الكتب السماويه التي انزلت على الانبياء.</span></li>
        <li><b>هناك اربع كتب اساسيه هي:</b> <span>(التوراه _ والانجيل _ والزبور _ والقرآن) وصحف ابراهيم وصحف موسى.</span></li>
        <li><b>رسوله:</b> <span>الايمان بجميع الرسل ، قال تعالى {لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ}.</span></li>
        <li><b>اليوم الاخر:</b> <span>يوم القيامه والايمان به يعني الايمان بكل ما اشتمل عليه من البعث والحشر والنشر والحساب والميزان والصراط والجنه والنار.</span></li>
        <li><b>كل التكاليف التي كلف الله بها العباد:</b> <span>منطلقها الايمان باليوم الاخر.</span></li>
        <li><b>ان تؤمن بالقدر:</b> <span>اي ان كل ما يحصل بأمر من الله، لحكمة لا يعلمها الا الله تعالى.</span></li>
        <li><b>الاحسان:</b> <span>الاخلاص في العباده واتقانها.</span></li>
        <li><b>الساعة:</b> <span>يوم القيامه.</span></li>
        <li><b>سميت ساعه:</b> <span>لانها تفاجئ الناس في ساعه فيموت الخلق كلهم بصحيه واحدة.</span></li>
        <li><b>ما المسؤول عنها باعلم من السائل:</b> <span>عدم الجواب عما لا يعلم، سيدنا ابو بكر رضي الله عنه كان يقول: نصف العلم قول لا اعلم.</span></li>
        <li><b>امارتها:</b> <span>علاماتها ... هناك علامات صغرى وعلامات كبرى.</span></li>
        <li><b>علامات صغرى:</b> <span>بعثة النبي ﷺ، انشقاق القمر، انتشار الفتن، كثرة الموت، وكثره الزلازل....</span></li>
        <li><b>علامات كبرى:</b> <span>ظهور الدجال ، وشروق الشمس من مغربها، نزول سيدنا عيسى، خروج يأجوج ومأجوج.</span></li>
        <li><b>الامة:</b> <span>الجارية المستولدة.</span></li>
        <li><b>ربتها:</b> <span>سيدتها، وقيل المقصود انتشار عقوق الوالدين، وقيل ان يطأ السيد ملك يمينه فتنجب ولدا ينسب لوالده فيكون سيدا كوالده.</span></li>
        <li><b>الحفاه:</b> <span>لا حذاء لهم في اقدامهم.</span></li>
        <li><b>العراة:</b> <span>ليس عليهم ثياب.</span></li>
        <li><b>العالة:</b> <span>الفقراء.</span></li>
        <li><b>رعاء الشاء:</b> <span>راع، والشاء: جمع شاة وهي واحده الضأن، وخصهم بالذكر لانهم اضعف اهل الباديه، فمن يرعى الابل افضل وغالبا لا يكونون فقراء.</span></li>
        <li><b>يتطاولون:</b> <span>يبنون الابنيه العاليه تفاخرا ورياء.</span></li>
        <li><b>فلبثت مليا:</b> <span>اي انتظرت وقتا طويلا وقيل: ثلاثه ايام.</span></li>
        <li><b>اتاكم يعلمكم دينكم:</b> <span>اي قواعد الدين وكلياته.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
  'التأدب في مجالس العلم',
  'تحسين الثياب والهيئة عند الدخول على العلماء والفضلاء والملوك',
  'وجوب الايمان بالقدر خيره وشره',
  'الاخلاص في العباده ومراقبه الله',
  'الاسلام والايمان حقيقتان متباينتان لغه وشرعا (الاسلام اعمال ظاهره ، الايمان اعمال باطنة)',
  'الايمان يزيد وينقص وهو يزيد بزياده ثمراته فالايمان يزيد بالطاعه وينقص بالمعصيه',
  'كل مؤمن مسلم وليس كل مسلم مؤمن',
  'قيام الساعه من الغيب الذي استأثر الله به لنفسه'
    ],
    box2Title: '📌 أهمية الحديث',
    box2Items: [
      'يشمل الاعمال الظاهره والباطنه كما ان الفاتحه ام الكتاب فان هذا الحديث ام السنه'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'اقرأ واستمع إلى متن الحديث السابع مع الشرح الصوتي، تفسير المفردات، وأبرز الفوائد عن كون النصيحة فرض كفاية ومن أعظم الأعمال.',
    metaKeywords:'الدين النصيحة, الحديث السابع, الأربعون النووية, تميم بن أوس الداري, حكم النصيحة, آداب النصيحة, النصيحة لله ولكتابه, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '3': {
    title: 'الحديث الثالث',
    name: 'الحديث الثالث: [أركان الإسلام ودعائمه العظام]',
    hintText:'الإسلام له خمس دعائم وركائز',
    audioUrl: 'audio/hadith/03.mpeg',
   phrases: [
    // 💡 العنوان
    { text: ' الْحَدِيثُ الثَّالِثُ: [أَرْكَانُ الْإِسْلَامِ وَدَعَائِمُهُ الْعِظَامُ]', start: 0, end: 7.6 },

    // الراوي والسند
    { text: 'عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بنِ عُمَرَ بنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ:', start: 7.7, end: 14.7 },
    { text: 'سَمِعْتُ رَسُولُ اللهِ ﷺ يَقُولُ:', start: 14.8, end: 19.9},
    // متن الحديث الشريف
    { text: '«بُنِيَ الإسْلَامُ عَلَى خَمْسٍ:', start: 20 , end: 23 },
    { text: 'شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ اللهِ،', start: 23.1, end: 29},
    { text: 'وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاة،', start: 29.1, end: 32.2 },
    { text: 'وَحَجِّ البَيْتِ، وَصَوْمِ رَمَضَانَ».', start: 32.3, end: 35.55 },
    // 💡 التخريج
    { text: 'رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ.', start: 35.6, end: 38.0 }
  ],
    explanation: `
 <div class="explanation-content" >
      <ul class="vocabulary-list" style="max-width: 100%; display: flex; flex-direction: column; wrap-flow: auto; word-break: break-word; overflow-wrap: break-word;">
        <li><b>بني الاسلام:</b> <span>أسس</span></li>
        <li><b>على خمس:</b> <span>أي خمس دعائم وركائز</span></li>
        <li><b>يقول النبي ﷺ:</b> <span>الاسلام بضع وسبعون شعبة أعلاها كلمة لا إله إلا الله وأدناها إماطة الأذى عن الطريق</span></li>
        <li><b>شهادة أن لا إله إلا الله:</b> <span>الإقرار والتصديق بأن لا معبود بحق إلا الله تعالى</span></li>
        <li><b>أن محمداً رسول الله:</b> <span>التصديق والطاعة فيما أمر به واجتناب ما نهى عنه، لأن من لوازم الإيمان بالله والإيمان برسول الله</span></li>
        <li><b>إقام الصلاة:</b> <span>أن يأتي بها كاملة الشروط والأركان والسنن والآداب</span></li>
        <li><b> إيتاء الزكاة: الزكاة لغة:</b> <span> النماء \</span> </li>
        <li><b>الزكاة اصطلاحاً:</b> <span>مال مخصوص يؤخذ ممن بلغ عنده النصاب ويعطى إلى فئة معينة من الناس وهي نماء ونقاء</span></li>
        <li><b>حج البيت:</b> <span>الحج هو القصد إلى معظم (بيت الله تعالى)</span></li>
        <li><b>عقوبة تارك الصلاة:</b> <span>يرفع أمره إلى القاضي إذ تركها متعمداً، يحبس ثلاثة أيام فأما أن يتوب أو يقتل، وذهب الجمهور أنه: يقتل حداً. وقال الحنبلي: يقتل كفراً فلا يغسل ولا يكفن ولا يصلى عليه ولا يدفن بمقابر المسلمين ولا يورث ماله</span></li>
        <li><b>تارك الزكاة:</b> <span>يرفع أمره إلى القاضي فتأخذ الزكاة منه عنوةً ويؤخذ نصف ماله لقول النبي ﷺ "من منعها أخذناها وشطر ماله"</span></li>
        <li><b>هذه الخمس دعائم هي فرض دائم:</b> <span>بينما الجهاد فرض كفاية لذلك لم يذكر ضمن الحديث</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
  'لا يتم إسلام من نكر أحد هذه الأركان',
  'حكم الإسلام في الظاهر يثبت بالشهادتين، وإنما أضيفت إليهما الصلاة والصيام لأنها أظهر للشريعة وأعظمها',
  'غاية العبادة القبول عند الله وشرطها: الإخلاص',
  'الإسلام عقيدة وعمل.. لا ينفع إيمان دون عمل.. ولا عمل دون إيمان'
    ],
    box2Title: '',
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الثالث من الأربعين النووية (بني الإسلام على خمس)، مع بيان مفصل لأركان الإسلام الخمسة وشروط قبول العبادات وعقوبة ترك الصلاة والزكاة.' ,
    metaKeywords: 'بني الإسلام على خمس, أركان الإسلام, الحديث الثالث, الأربعون النووية, شهادة أن لا إله إلا الله, إقام الصلاة, إيتاء الزكاة, حج البيت, صوم رمضان, شرح الحديث' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '4': {
    title: 'الحديث الرابع',
    name: 'الحديث الرابع: [أطوار خلق الإنسان وخاتمته]',
    hintText: ' دعاء الرسول ﷺ يا مقلب القلوب والأبصار ثبت قلبي على دينك',
    audioUrl: 'audio/hadith/04.mpeg',
     phrases: [
    // 💡 العنوان
    { text: 'الْحَدِيثُ الرَّابِعُ: [أطْوَارُ خَلْقِ الإنْسَانِ وخَاتِمَتُهُ]', start: 0, end: 6.9 },

    // الراوي والسند
    { text: 'عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ:', start: 7, end: 13.3 },
    { text: 'حَدَّثَنَا رَسُولُ اللهِ ﷺ وَهُوَ الصَّادِقُ المَصْدُوقُ:', start: 13.4, end: 20.3 },

    // أطوار الخلق
    { text: '«إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمَاً،', start: 20.4, end: 26.6 },
    { text: 'ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ،', start: 26.7, end: 30 },
    { text: 'ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ،', start: 30.1, end: 33},

    // إرسال الملك والأوامر الأربعة
    { text: 'ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ، فَيَنْفُخُ فِيهِ الرُّوحَ،', start: 33.1, end: 37.6 },
    { text: 'وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٌّ أَوْ سَعِيدٌ.', start: 37.8, end: 49.6 },

    // القسم وخاتمة أهل الجنة
    { text: 'فَوَالَّذِي لَا إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّة', start: 49.7, end: 56.4  },
   { text: 'حَتَّى مَا يَكُونَُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ، ', start: 56.5, end: 60.4 }, 
   { text: 'فَيَسْبِقُ عَلَيْهِ الكِتَابُ', start: 60.5, end: 63.6}, 
   { text: 'فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا؛', start: 63.7, end: 67.9}, 
    // خاتمة أهل النار
    { text: 'وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونَُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ،', start: 68, end: 76.1 },

    { text: 'فَيَسْبِقُ عَلَيْهِ الكِتَابُ،».', start: 76.2, end: 79 },
    { text: 'فَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ فَيَدْخُلُهَا».', start: 79.1, end: 83},
    // التخريج
    { text: 'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ.', start: 83.1, end: 86}
],
   explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>الصادق المصدوق:</b> <span>ذكر ابن مسعود هذه العباره رغم ان النبي صادق حتى في الجاهليه وذلك لانه يحدث بامور لا يعرفها الناس عن كيفيه خلق الانسان واطوار خلقه وهذا الحديث من معجزات النبي حيث لم تكتشف هذه الامور الا في العصر الحديث. والمقصود بالصدق: مطابقه القول للواقع. الصادق: اي قوله الحق المطابق للواقع. المصدوق: فيما اوحي اليه لان جبريل ياتيه بالصدق من ربه والله تعالى يصدقه فيما وعده به. فهو صادق فيما يخبر مصدق فيما يتناوله من خبر</span></li>
        <li><b>إن احدكم يجمع:</b> <span>يحتمل انه يراد بها جمع ماء الرجل بماء المراه فيخلق منها الولد</span></li>
        <li><b>خلقه:</b> <span>ماده خلقه وهو الماء الذي يخلق منه</span></li>
        <li><b>في بطن امه:</b> <span>رحمها</span></li>
        <li><b>مضغه:</b> <span>قطعه لحم بمقدار ما يمضغ</span></li>
        <li><b>يرسل اليه الملك يؤمر باربع كلمات:</b> <span>المرسل والامر هو الله تعالى</span></li>
        <li><b>ينفخ فيه الروح:</b> <span>ويكون ذلك بعد ١٢٠ يوما اي اربعه اشهر قمريه</span></li>
        <li><b>الروح:</b> <span>هي علامه الحياة</span></li>
        <li><b>فيسبق عليه الكتاب:</b> <span>الذي سبق في علم الله تعالى</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد ',
    box1Items: [
'فائدة ١: كان دعاء الرسول ﷺ يا مقلب القلوب والأبصار ثبت قلبي على دينك',
`فائدة ٢: العشرة المبشرون بالجنة رضي الله تعالى عنهم: <br>
• أبو بكر الصديق <br>  
• عمر بن الخطاب <br>
• علي بن أبي طالب <br>
• عثمان بن عفان <br>
• الزبير بن العوام <br>
• طلحة بن عبيد الله <br>
• عبد الرحمن بن عوف <br>
• سعد بن أبي وقاص <br>
• سعيد بن زيد <br>
• أبو عبيدة بن الجراح`
    ],
    box2Title: '📌  فوائد الحديث ',
    box2Items: [
'في الحديث إثبات القدر ولكن يجب على الإنسان ألا يترك العمل اتكالاً على القدر بل تجب الأعمال التكاليف التي ورد بها الشرع',
'كتاب الله تعالى ولوحه وقلمه كل ذلك مما يجب الإيمان به وأما كيفية ذلك وصفته فعلمه إلى الله تعالى',
'القسم على الخبر الصادق يوقع في نفس السامع تأكيداً',
'من مات على شيء حكم له به من خير أو شر',
'عدم الاغترار بصور الأعمال والركون إليها بل علينا العمل والاعتماد على كرم الله',
'الاستعاذة من سوء الخاتمة',
'التنبيه على صدق البعث بعد الموت'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الرابع من الأربعين النووية (أطوار خلق الإنسان وخاتمته). بيان مراحل الجنين في بطن أمه، نفخ الروح، إثبات القدر وعلامات حسن وسوء الخاتمة.',
    metaKeywords: 'الحديث الرابع, أطوار خلق الإنسان, مراحل الجنين, نفخ الروح, الصادق المصدوق, القدر, حسن الخاتمة, سوء الخاتمة, الأربعون النووية, شرح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '5': {
    title: 'الحديث الخامس',
    name: 'الحديث الخامس: [إبطال المنكرات والبدع]',
    hintText: 'الاسلام هو اتباع لا ابتداع',
    audioUrl: 'audio/hadith/05.mpeg',
    phrases: [
    // 💡 العنوان
    { text: 'الْحَدِيثُ الخامِسُ: [إبْطَالُ المُنْكَرَاتِ والبِدَعِ]', start: 0, end: 6 },

    // الراوي والسند
    { text: 'عَنْ أُمِّ المُؤْمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ رَضِيَ اللهُ عَنْهَا قَالَتْ:', start: 6.1, end: 12.1 },
    { text: 'قَالَ رَسُولُ اللهِ ﷺ:', start: 12.2, end: 16},

    // الرواية الأولى
    { text: '«مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ».', start: 16.1, end: 21.6 },
    { text: 'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ.', start: 21.7, end: 24.7},

    // الرواية الثانية
    { text: 'وَفِي رِوَايَةٍ لِمُسْلِمٍ:', start: 24.8, end: 27 },
    { text: '«مَنْ عَمِلَ عَمَلَاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ».', start: 27.1, end: 32 }
  ],

  explanation: `
   <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>من احدث:</b> <span>الحديث: ضد القديم، ومعنى احدث: اخترع وانشأ من قبل نفسه</span></li>
        <li><b>في امرنا:</b> <span>في ديننا وشرعنا، اما امور الدنيا فلا تدخل في هذا النهي</span></li>
        <li><b>ما ليس منه:</b> <span>اي ما ينافيه ويناقضه ولا يشهد له شيء من قواعد الدين وادلته</span></li>
        <li><b>فهو رد:</b> <span>باطل لا يقبل من فاعله ولا يعتد به</span></li>
        <li><b>الحديث يدل على ان:</b> <span>الاسلام هو اتباع لا ابتداع</span></li>
        <li><b>البدعه المحموده:</b> <span>تكون من اصل القرآن والسنه النبويه مثالها عندما امر ابو بكر رضي الله عنه بكتابه القرآن الكريم وعندما جمع عمر بن الخطاب رضي الله عنه الناس على صلاه التراويح</span></li>
        <li><b>من عمل عملا:</b> <span>اي اتبع بدعه لم يحدثها هو وإنما احدثها غيره ثم جاء هو وعملها اتباعا لمحدثها</span></li>
        <li><b>الامام الشافعي يقول:</b> <span>ما احدث وخالف كتابا او سنه او اجتماعا او اثرا فهو البدعه الضلاله، وما احدث من الخير ولم يخالف شيئا من ذلك فهو البدعه المحموده.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث ',
    box1Items: [
     '<b> الاستحداث المذموم في أمور الدين هو مرفوض</b>',
  '<b>الاستحداث المذموم هو ما خالف الكتاب والسنة</b>',
  '<b>لا أتعبد إلا بالأشياء التي أمرني بها من العبادات</b>',
  '<b>كل عمل لا يقبل عند الله إلا بشرطين: </b><br>  ١. خالصاً لله<br> ٢. موافقاً للشرع'
    ],
    box2Title: '📌 أهمية الحديث',
    box2Items: [
   '<b>يقول أحمد بن حنبل أصول الإسلام تقوم على ثلاثة أحاديث:</b>',
  '١.إنما الأعمال بالنيات.',
  '٢.من عمل عملاً ليس عليه أمرنا فهو رد .',
  '٣.الحلال بين والحرام بين.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الخامس من الأربعين النووية (إبطال المنكرات والبدع) عن أم المؤمنين عائشة. ميزان الأعمال الظاهرة وقاعدة الاتباع في الإسلام.' ,
    metaKeywords: 'الحديث الخامس, إبطال المنكرات والبدع, من أحدث في أمرنا, فهو رد, البدعة, الاتباع, عائشة أم المؤمنين, الأربعون النووية, شرح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '6': {
    title: 'الحديث السادس',
    name: 'الحديث السادس: [الحلال والحرام]',
    hintText: 'اجعل بينك وبين الحرام وقاية واتقِ الشبهات ليَسْلَم دينك وعِرضك',
    audioUrl: 'audio/hadith/06.mpeg',
     phrases: [
    // 💡 هنا ينطق العنوان في أول ثوانٍ
    { text: 'الْحَدِيثُ السَّادِسُ: [الحلال والحرام].', start: 0, end: 3},

    // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت
    { text: 'عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ:', start: 3.1, end: 12 },
    { text: '«إِنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ،', start: 12.1, end: 15.5 },
    { text: 'وَبَيْنَهُمَا مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ؛', start: 15.6, end: 20.3 },
    { text: 'فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ،', start: 20.4, end: 24 },
    { text: 'وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ،', start: 24.1, end: 27.5 },
    { text: 'كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ؛', start: 27.6, end: 31.5 },
    { text: 'أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ؛', start: 31.6, end: 36.7},
    { text: 'أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ،', start: 36.8, end: 41.5 },
    { text: 'وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ».', start: 41.6, end: 46 },
    
    // التخريج
    { text: 'رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ.', start: 46.1, end: 48 }
  ],
  
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>إنَّ:</b> <span>للتوكيد، لتأكيد المعنى بعدها.</span></li>
        <li><b>الحلال:</b> <span>هو ما أحله الله ورسوله وأجمع المسلمون على تحليله بعينه.</span></li>
        <li><b>الحرام:</b> <span>هو ما نص الله ورسوله وأجمع المسلمون على تحريمه بعينه.</span></li>
        <li><b>بيّن:</b> <span>ظاهر.</span></li>
        <li><b>مشتبهات:</b> <span>المشكل الذي يشبه الحلال من وجه والحرام من وجه آخر.</span></li>
        <li><b>لا يعلمهن كثير من الناس:</b> <span>لا يعلم حكمها لتنازع الأدلة، فهي تشبه مرة الحلال ومرة الحرام.</span></li>
        <li><b>من اتقى الشبهات:</b> <span>ابتعد عنها وجعل بينه وبينها وقاية.</span></li>
        <li><b>فقد استبرأ:</b> <span>طلب البراءة.</span></li>
        <li><b>لدينه:</b> <span>من النقص، وأشار بذلك إلى ما يتعلق بالله عز وجل.</span></li>
        <li><b>وعرضه:</b> <span>من الطعن وأشار بذلك إلى ما يتعلق بالناس.</span></li>
        <li><b>ومن وقع في الشبهات:</b> <span>أي اجترأ على الوقوع في الأمور المشتبهة.</span></li>
        <li><b>وقع في الحرام:</b> <span>ولهذا تفسيران: إما أن التساهل في امرها يجر للحرام (فالصغيرة تجر الى الكبيرة والكبيرة تجر الى الحرام)، أو أن من وقع في الشبهات أظلم قلبه فيقع في الحرام و لا يشعر.</span></li>
        <li><b>الحمى:</b> <span> المحظور على غير مالكه.</span></li>
        <li><b>محارمه:</b> <span>المعاصي التي حرمها الله وتسمى حمى الله.</span></li>
        <li><b>القلب:</b> <span>هو أشرف الأعضاء. <b>وما سُمي القلب إلا من تقلّبه، فاحذر على القلب من قَلْبٍ وتحويلِ.</b></span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
    '<b>القلب السليم:</b>  هو عنوان الفوز والنجاة في الآخرة.',
  '<b>الحث على:</b> فعل الحلال واجتناب الحرام، وترك المشتبهات.',
  '<b> اختلف الفقهاء في المشتبهات على ثلاثة أقوال:</b> <br>' +
  '• قالت طائفة: هي حرام لقوله ﷺ "فقد استبرأ لدينه وعرضه". <br>' +
  '• وقالت طائفة: هي حلال لقوله ﷺ "كالراعي يرعى حول الحمى يوشك أن يرتع فيه". <br>' +
  '• وقالت طائفة: لا نقول إنها حلال ولا حرام فهي بين الحلال والحرام، والتوقف عنها من باب الورع.'
    ],
    box2Title: '📌 أهمية الحديث ',
    box2Items: [
    '<b>الأشياء في الشريعة ثلاثة أنواع:</b>',
  '١. حلال واضح لا يخفى حِلّه.',
  '٢. حرام واضح لا تخفى حرمته.',
  '٣. مشتبهات ليست بوضاحة الحل والحرمة ولكن تركها أفضل من باب الورع.'
    ],
    box3Title: '📌 فائدة 1',
    box3Items: [
    '<b> صلاح القلب يتغذى بالحلال فيصفو ويتنور فينعكس ذلك على اعماله الصالحه</b>' ,
  '<b> اذا تغذى القلب على الحرام اصبح مرتع للشيطان </b>'
     ],
    box4Title: '📌 فائدة 2 ',
    box4Items: [
      '<b>صلاح القلب يقوم بخمسة أمور:</b> <br>' +
  '• ١. قراءة القرآن بتدبر.<br>' +
  '• ٢. خلاء البطن.<br>' +
  '• ٣. قيام الليل.<br>' +
  '• ٤. التضرع عند السحر.<br>' +
  '• ٥. مجالسة الصالحين.<br><br>' 
    ],
    metaDescription:'شرح وتدبر الحديث السابع من الأربعين النووية (الدين النصيحة)، مع بيان حكم النصيحة وآدابها وكيف تكون لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم.',
    metaKeywords: 'الدين النصيحة, الحديث السابع, الأربعون النووية, تميم بن أوس الداري, حكم النصيحة, آداب النصيحة, النصيحة لله ولكتابه, شرح الحديث' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '7': {
    title: 'الحديث السابع',
    name: 'الحديث السابع: [ الدين النصيحة ]',
    hintText: 'من نصح أخاه سراً فقد نصحه، ومن نصحه علناً فقد فضحه.',
    audioUrl: 'audio/hadith/07.mpeg',
 phrases: [
    { text: 'الحَدِيثُ السَّابِعُ: [ الدين النصيحة ]', start: 0, end: 4 },
    { text: 'عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللَّهُ عَنْهُ،', start: 4.1, end: 8 },
    { text: 'أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الدِّينُ النَّصِيحَةُ».', start: 8.1, end: 13 },
    { text: 'قُلْنَا: لِمَنْ؟', start: 13.1, end: 14 },
    { text: 'قَالَ: «لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ،', start: 14.1, end: 17 },
    { text: 'وَلِأَئِمَّةِ الْمُسْلِمِينَ، وَعَامَّتِهِمْ».', start: 17.1, end: 20 },
    { text: 'رَوَاهُ مُسْلِمٌ.', start: 20.1, end: 21 }
],
  // الشرح والمفردات
// الشرح والمفردات المحدثة بهيكل القوائم المنظمة
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>الدين:</b> <span>الِملَّة وهي دين الإسلام</span></li>
        <li><b>النصيحة:</b> <span>إرادة الخير للمنصوح له، وأصلها في اللغة من التخليص والتنقية، يقال نصحت العسل: خلصته من الشمع / نصح الثوب: خاطه</span></li>
        <li><b>الدين النصيحة:</b> <span>أي عماد الدين وقوامه</span></li>
        <li><b>أئمة المسلمين:</b> <span>الحكام ومن ينوب عنهم، والعلماء والمصلحين</span></li>
        <li><b>عامتهم:</b> <span>هم عامة الناس ممن ليسوا من الأئمة</span></li>
        <li><b>النصيحة لله:</b> <span>أي تنزيه الله عن أي شريك له، وإثبات صفات الجلال والجمال له، وتنزيهه عن النقائص، والإخلاص بعبادته ومحبته (يقول القاضي عياض: المحبة أشد تعبداً من الخوف)</span></li>
        <li><b>لماذا قال الدين النصيحة (هل الدين هو النصيحة فقط؟):</b> <span>من باب التنبيه للأهم، كما في قوله ﷺ "الحج عرفة"</span></li>
        <li><b>النصيحة لكتاب الله تكون بـ:</b> <span>
          ١. الإيمان بجميع الكتب السماوية <br>
          ٢. قراءة القرآن وحفظه، يقول النبي ﷺ: "اقرؤوا القرآن فإنه يأتي يوم القيامة شفيعاً لأصحابه" <br>
          ٣. الإيمان بكل ما فيه من أمور <br>
          ٤. الإيمان بأن هذا القرآن آخر الكتب السماوية <br>
          ٥. ترتيله وتحسين الصوت بقراءته، يقول ﷺ: "ليس منا من لم يتغنَّ بالقرآن" <br>
          ٦. تدبر معانيه والوقوف على أحكامه، يقول الله تعالى: {أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا} <br>
          ٧. تعليم القرآن للأجيال، يقول ﷺ: "خيركم من تعلم القرآن وعلمه" <br>
          ٨. والأهم هو العمل بما جاء به
        </span></li>
        <li><b>النصيحة لرسول الله:</b> <span>وتكون بتصديق رسالته، والإيمان بجميع ما جاء به، وطاعته، ونصرته</span></li>
        <li><b>النصيحة لأئمة المسلمين:</b> <span>تكون بمعاونتهم على الحق، وطاعتهم ما داموا على حق، وأن نحب صلاحهم وندعو لهم بالإصلاح، وتأليف قلوب الناس لطاعتهم</span></li>
        <li><b>النصيحة لعامة المسلمين:</b> <span>بإرشادهم لمصالحهم في الدنيا والآخرة، وستر عوراتهم، وسد خِلاّتهم، وأمرهم بالمعروف ونهيهم عن المنكر، وترك غشيهم وحسدهم</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 حكم و أداب النصيحة ',
    box1Items: [
     'حكم النصيحه: فرض كفايه ، اذا قام بها البعض سقطت عن الباقيين واذا لم يقم بها احد اثموا جميعهم',
  'من اداب النصيحه: ان تكون سراً فمن نصح اخاه سراً فقد نصحه ومن نصحه علناً فقد فضحه'
    ],
    box2Title: '📌 فوائد الحديث ',
    box2Items: [
     '١. النصيحه من اعظم الاعمال',
  '٢. النصيحه فرض كفايه',
  '٣. جواز مراجعه المتعلم عند الالتباس عليه',
  '٤. من قبل النصيحة ← أمِنَ الفضيحه … ومن ابى فلا يلومن الا نفسه',
  '٥. من احب عباد الله الى الله الذين يسعون في الارض بالنصيحه',
  '٦. من وعظ اخاه فيما بينه وبينه فهي نصيحه ومن وعظه على رؤوس الناس فقد وبخه'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الخامس من الأربعين النووية (إبطال المنكرات والبدع) عن أم المؤمنين عائشة. ميزان الأعمال الظاهرة وقاعدة الاتباع في الإسلام.' ,
    metaKeywords: 'الحديث الخامس, إبطال المنكرات والبدع, من أحدث في أمرنا, فهو رد, البدعة, الاتباع, عائشة أم المؤمنين, الأربعون النووية, شرح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '8': {
    title: 'الحديث الثامن',
    name: 'الحديث الثامن: [حرمة المسلم]',
    hintText: 'حرمة دم المسلم وصيانة أمواله.',
    audioUrl: 'audio/hadith/08.mpeg',
    phrases: [
    // 💡 هنا ينطق العنوان في أول ثوانٍ
    { text: 'الْحَدِيثُ الثَّامِنُ: [حُرْمَةُ الْمُسْلِمِ].', start: 0, end: 4 },

    // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلك
    { text: 'عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا: أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ:', start: 4.1, end: 10 },
    { text: '« أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّىٰ يَشْهَدُوا أَنْ لَا إِلَٰهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ،', start: 10.1, end: 17.5 },
    { text: 'وَيُقِيمُوا الصَّلَاةَ ، وَيُؤْتُوا الزَّكَاةَ ؛', start: 17.6, end: 19.5 },
    { text: 'فَإِذَا فَعَلُوا ذَٰلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّ الْإِسْلَامِ ،', start: 19.6, end: 26 },
    { text: 'وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَىٰ »', start: 26, end: 28.5 },
    
    // التخريج
    { text: '. رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ .', start: 28.6, end: 31 }
],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>أمرت:</b> <span>الأمر هو من الله لرسوله وأمته داخل معه في هذا الأمر (أمر وجوب).</span></li>
        <li><b>الناس:</b> <span>المشركون وعبدة الأوثان *ونستثني* منهم أهل الكتاب لأنه يؤخذ منهم جزية أو يسلم فإن امتنعوا قاتلوهم على ذلك.</span></li>
        <li><b>يشهدوا:</b> <span>يقروا.</span></li>
        <li><b>يقيموا الصلاة:</b> <span>أن يقيم الصلاة ويؤديها تامة الشروط والأركان.</span></li>
        <li><b>يؤتوا الزكاة:</b> <span>أي دفع الزكاة لمستحقيها.</span></li>
        <li><b>عصموا:</b> <span>حرموا دمائهم ومنعوا أن نعتدي عليها.</span></li>
        <li><b>إلا بحق الإسلام:</b> <span>أي فعل فعلاً يوجب الحد في الإسلام. <b>ورد في الحديث عن النبي ﷺ "لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث الثيب الزاني ، والنفس بالنفس ، والتارك لدينه للمفارق للجماعة".</b></span></li>
        <li><b>وحسابهم على الله تعالى:</b> <span>الأخذ بظاهر العمل وحساب البواطن على الله تعالى.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 لماذا لم يذكر الحج والصيام في الحديث؟ ',
    box1Items: [
       'لاحتمال أن يكون هذا الحديث قبل مشروعية الصيام والحج (الحج السنة التاسعة للهجرة ، الصيام الثانية للهجرة).',
  'أو لأن العبادات إما مالية محضة الزكاة ، أو بدنية محضة الصلاة والصيام ، وإما تجمع بينهما كالحج والجهاد.',
  'أو جاء الحديث لمقاتلة الناس حتى يعلنوا ما يمكن إعلانه ، أما ما خفي فحسابه على الله ، فالصلاة والزكاة يمكن أن تعلن ويراها الناس ، أما الصيام والحج فيمكن عدم إعلانهما ، فيصوم خفية ، والحج من استطاع إليه سبيلاً.'
    ],
    box2Title: '📌فوائد الحديث',
    box2Items: [
     '• ١. وجوب قتال عبدة الأوثان حتى يسلموا فينطقوا الشهادتين ويقيموا الصلاة ويؤتوا الزكاة.',
  '• ٢. حرمة دم المسلم وصيانة أمواله.',
  '• ٣. حساب السرائر على الله فقط.'
    ],
    box3Title: '📌 فائدة',
    box3Items: [  '<b>تارك الصلاة عمداً ومعتقداً وجوبها ← يُقتل.</b>',
  '<b>أما تارك الزكاة ← يؤخذ منه المال قهراً.</b>'],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثامن من الأربعين النووية (حرمة المسلم)، مع بيان أحكام الصلاة والزكاة وعصمة دماء وأموال المسلمين وحساب السرائر.' ,
    metaKeywords: 'حرمة المسلم, الحديث الثامن, الأربعون النووية, ابن عمر, عصموا دماءهم, أقم الصلاة, آتوا الزكاة, شرح الحديث, الأربعين النووية',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '9': {
    title: 'الحديث التاسع',
    name: 'الحديث التاسع: [الأخذ بِالتيسير وترك التعسير]',
    hintText:'اجعل بينك وبين الحرام وقاية واتقِ الشبهات ليَسْلَم دينك وعِرضك',
    audioUrl: 'audio/hadith/09.mpeg',
    phrases: [
    // 💡 عنوان الحديث في أول ثوانٍ
    { text: 'الْحَدِيثُ التَّاسِعُ: [الأَخْذُ بِالتَّيْسِيرِ وَتَرْكُ التَّعْسِيرِ].', start: 0, end: 5.6 },

    // راوي الحديث
    { text: 'عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ:', start: 5.7, end: 9.7},
    { text: 'سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ:', start: 9.8, end: 13.5 },
    // متن الحديث مقسم لتسهيل التزامن
    { text: '«مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ،', start: 13.6, end: 16.7 },
    { text: 'وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ؛', start: 16.8, end: 20 },
    { text: 'فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ', start: 20.1, end: 22.0 },
    { text: 'كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَىٰ أَنْبِيَائِهِمْ».', start: 22.1, end: 26.0 },
    
    // التخريج
    { text: 'رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ.', start: 26.1, end: 28 }
],
// الشرح والمفردات التي تظهر عند الضغط على زر الشرح للحديث التاسع
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>مَا نَهَيْتُكُمْ عَنْهُ:</b> <span>طلبت منكم الكف عن فعله.</span></li>
        <li><b>فَاجْتَنِبُوهُ:</b> <span>اتركوه وابتعدوا عنه، لا تقربوه أبداً، والاجتناب أوسع من الترك.</span></li>
        
        <li class="rule-item" style="list-style-type: none; margin: 10px 0; padding: 8px; background-color: #fdf5f5; border-right: 3px solid #b81d24;">
          <b>قاعدة فقهية:</b> <span>قد يضطر الإنسان لفعل المنهي وذلك حسب الضرورة مثل أكل لحم الميتة بقدر ما يقيم صلبه إن خاف على نفسه الهلاك وغير ذلك لذلك وضع العلماء قاعدة فقهية تقول: <b>"الضرورات تبيح المحظورات"</b>.</span>
        </li>

        <li><b>وَمَا أَمَرْتُكُمْ بِهِ:</b> <span>طلبت منكم فعله، الأمر هنا معناه الطلب.</span></li>
        <li><b>فَأْتُوا مِنْهُ:</b> <span>فافعلوا منه.</span></li>
        <li><b>مَا اسْتَطَعْتُمْ:</b> <span>بقدر الاستطاعة، وتدخل في هذه القاعدة ما لا يحصى من الأحكام، مثل الصلاة إن عجز عن بعض أركانها أو بعض شروطها أتى بالباقي.</span></li>
        
        <li class="rule-item" style="list-style-type: none; margin: 10px 0; padding: 8px; background-color: #f5f8f6; border-right: 3px solid #1c3d27;">
          <b>قاعدة فقهية:</b> <span>ومن هنا جاءت القاعدة الفقهية <b>"الميسور لا يسقط بالمعسور"</b> فالمصلي إن عجز عن الصلاة قائماً صلاها قاعداً ولا تسقط عنه بسبب عجزه عن الوقوف.</span>
        </li>

        <li><b>أَهْلَكَ:</b> <span>كان سبباً في هلاكهم / أوجب عليهم عقوبة الدنيا والآخرة.</span></li>
        <li><b>اخْتِلَافُهُمْ عَلَىٰ أَنْبِيَائِهِمْ:</b> <span>عصيانهم ومجادلتهم لأنبيائهم.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌نبذة عن راوي الحديث',
    box1Items: [
      '<b>اسمه:</b> أبو هريرة عبد الرحمن بن صخر رضي الله عنه.',
  '<b>اسمه في الجاهلية:</b> كان يسمى (عبد شمس) فسماه النبي ﷺ عند إسلامه عبد الرحمن.',
  '<b>كنيته:</b> كان يكنى بأبي هريرة نسبة إلى هرة برية كان يعتني بها واشتهر بكنيته هذه.',
  '<b>إسلامه:</b> أسلم في السنة السابعة للهجرة حيث كان النبي ﷺ في خيبر فلحقه وبقي معه ولازمه كل تلك الفترة.',
  '<b>دعاء النبي له:</b> دعا له النبي ﷺ "اللهم حبب أبا هريرة وأمه للناس"، فكان يقول: "إن من رآني أو سمع بي أحبني".',
  '<b>ملازمته للرسول:</b> يقول صحبت النبي ﷺ على شبع في بطني، أي الشيء القليل الذي يقيم صلبه، من أجل أن ينهل من النبي ﷺ الأحاديث.',
  '<b>روايته للحديث:</b> لازم النبي ﷺ ثلاث سنوات وروى عنه 5374 حديثاً فكان ذلك سبباً في توجيه الانتقاد له لقلة فترة صحبته وكثرة أحاديثه.',
  '<b>قيام الليل:</b> كان يتناوب هو وزوجته وغلامه في قيام الليل.',
  '<b>لقبه:</b> كان يلقب بـ ذاكرة عصر النبوة.',
  '<b>ولايته:</b> ولي على البحرين في إمارة عمر ثم ولي إمارة المدينة عهد معاوية.',
  '<b>وفاته:</b> مات في المدينة سنة 59 هجري وكان عمره 80 سنة.',
  '<b>عبادته:</b> كان يستغفر كل يوم 12000 مرة.'
    ],
    box2Title: '📌سبب ورود الحديث',
    box2Items: [
        '• عن أبي هريرة رضي الله عنه قال خطبنا رسول الله ﷺ فقال: <b>"يا أيها الناس قد فرض الله عليكم الحج فحجوا"</b> فقال رجل: أكل عام يا رسول الله فسكت حتى قالها ثلاثاً فقال رسول الله: <b>"لو قلت نعم لوجبت ولما استطعتم"</b>.<br>' +
  '• وقيل أن السائل هو الأقرع بن حابس رضي الله عنه.'
    ],
    box3Title: '📌 فوائد الحديث ',
    box3Items: [  '<b>يجب على المسلم تجنب ما نهي عنه بشكل جذري، والإتيان بما أمر به على قدر استطاعته.</b>',
  '<b>ترك السؤال عند شيء لم يقع... خشية أن ينزل وجوب في فعله أو تحريم.</b>',
  '<b>تحريم الاختلاف وكثرة المسائل من غير ضرورة لأنها توعد بالهلاك وتفرق القلوب وتوهن الدين.</b>'],
    box4Title: '📌 فائدة: أنواع السؤال',
    box4Items: [ '<b>السؤال له أنواع:</b><br><br>' +
  '<b>١. سؤال مطلوب شرعاً وهو على درجات:</b><br>' +
  '• ✓ <b>فرض عين:</b> السؤال عما يجهله من أمور الدين.<br>' +
  '• ✓ <b>فرض كفاية:</b> السؤال للتوسع في الفقه ومعرفة أحكام الشرع.<br>' +
  '• ✓ <b>مندوب:</b> مثل السؤال عن أعمال البر والقربات.<br><br>' +
  '<b>٢. سؤال منهي عنه وهو على درجات:</b><br>' +
  '• ✓ <b>حرام:</b> مثل السؤال عما أخفاه الله تعالى كوقت الساعة، وحقيقة الروح، والسؤال عن وجه العبث، وسؤال المعجزات.<br>' +
  '• ✓ <b>مكروه:</b> السؤال عما لا يحتاج إليه مثل السؤال عما سكت عنه الشرع من الحلال والحرام.<br><br>' +
  '<b>٣. مباح:</b> فيما عدا الأنواع السابقة من الأسئلة.'],
    metaDescription: 'شرح وتدبر الحديث التاسع من الأربعين النووية (الأخذ بالتيسير وترك التعسير)، مع بيان سيرة الراوي أبي هريرة والقواعد الفقهية كالضرورات تبيح المحظورات.',
    metaKeywords:  'الأخذ بالتيسير, ترك التعسير, الحديث التاسع, الأربعون النووية, أبو هريرة, الضرورات تبيح المحظورات, الميسور لا يسقط بالمعسور, كثرة المسائل, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '10': {
    title: 'الحديث العاشر',
    name: 'الحديث العاشر: [الحلال الطيب شرط القبول]',
    hintText: 'إن الله طيب لا يقبل إلا طيباً، فأطب مطعمك وملبسك لتستجاب دعوتك ويُقبل عملك.',
    audioUrl: 'audio/hadith/10.mpeg',
    phrases: [
    // 💡 عنوان الحديث في أول ثوانٍ
    { text: 'الْحَدِيثُ الْعَاشِرُ: [الْحَلَالُ الطَّيِّبُ شَرْطُ الْقَبُولِ].', start: 0, end: 4.6 },

    // راوي الحديث (مقسم إلى جزأين للتزامن الدقيق)
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ:', start: 4.7, end: 7.5 },
     { text: 'قَالَ رَسُولُ اللَّهِ ﷺ:', start: 7.6, end: 10.7 },
    
    // متن الحديث
    { text: '«إِنَّ اللَّهَ تَعَالَى طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّباً،', start: 10.8, end: 15.0 },
    { text: 'وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ،', start: 15.1, end: 18.7 },
    { text: 'فَقَالَ تَعَالَى: {يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً}،', start: 18.8, end: 24.6 },
    { text: 'وَقَالَ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ}.', start: 24.7, end: 31 },
    { text: 'ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ: أَشْعَثَ أَغْبَرَ،', start: 31.1, end: 34.3 },
    { text: 'يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ: يَا رَبِّ، يَا رَبِّ،', start: 34.4, end: 38 },
    { text: 'وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ،', start: 38.1, end: 41 },
    { text: 'وَمَلْبَسُهُ حَرَامٌ،', start: 41.1, end: 42.6},
    { text: 'وَغُذِيَ بِالْحَرَامِ،', start: 42.7, end: 44.4},
    { text: 'فَأَنَّى يُسْتَجَابُ لِذَلِكَ»؟!ِ', start: 44.5, end: 46.6 },
    
    // التخريج
    { text: 'رَوَاهُ مُسْلِمٌ.', start: 46.7, end: 48 }
  ],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>طَيِّبٌ:</b> <span>منزه عن النقائص.</span></li>
        <li><b>لَا يَقْبَلُ إِلَّا طَيِّباً:</b> <span>لا يقبل من الأعمال والأموال والأقوال إلا من كان خالصاً من المفسدة أو حلالاً.</span></li>
        <li><b>أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ:</b> <span>سوى بينهم في الخطاب بوجوب أكل الحلال.</span></li>
        <li><b>يُطِيلُ السَّفَرَ:</b> <span>في الجهاد والطاعات.</span></li>
        <li><b>أَشْعَثَ:</b> <span>المتجعد والمتلبد الشعر.</span></li>
        <li><b>أَغْبَرَ:</b> <span>يعتلي رأسه غبار السفر.</span></li>
        <li><b>يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ:</b> <span>رافعاً يديه إلى السماء.</span></li>
        <li><b>غُذِيَ بِالْحَرَامِ:</b> <span>أي غذاه غيره، أي في حال طفولته نشأ على الحرام بين أبويه.</span></li>
        <li><b>فَأَنَّىٰ يُسْتَجَابُ لِذَٰلِكَ:</b> <span>تعجب كيف ومن أين يستجاب لمن كانت هذه صفته، ولو أن الله استجاب له تكون الاستجابة تفضيلاً.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 شروط قبول الدعاء',
    box1Items: [
     '<b>ذكر النبي ﷺ في الحديث عدة أمور تدل على استجابة الدعاء لو أن كسبه كان حلالاً منها: </b><br>' +
  '• ١. إطالة السفر بوجوه الخير.<br>' +
  '• ٢. حصول التبذل في اللباس والهيئة).<br>' +
  '• ٣. رفع اليدين إلى السماء.<br>' +
  '• ٤. تكرار مناجاة الله تعالى بالربوبية والإلحاح بالدعاء.<br>' +
  '• ٥. الكسب الحلال.',

  '<b>إستثناء دعوة المظلوم:</b><br>' +
  '✓ يستثنى من هذا الحديث المظلوم، فالمظلوم لا ترد دعوته ولو كان ماله حراماً ولو كان كافراً، فقد ورد في الأثر: <i>"إني لأنصر المظلوم ولو كان كافراً، علم أن له رباً فدعاه"</i>.',

  '<b>الفرق في الخطاب القرآني:</b><br>' +
  '• <b>الرسل:</b> خاطبهم الله بقوله <i>{كُلُوا مِنَ الطَّيِّبَاتِ}</i> لأنهم يعرفون الحلال الطيب دون تذكير.<br>' +
  '• <b>المؤمنون:</b> خاطبهم بقوله <i>{كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ}</i> من باب تذكيرهم الدائم بتحري الحلال وأنه من عند الله.'
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
  '<b>الحلال هو شرط القبول عند الله تعالى.</b>',
  '<b>من آداب الدعاء: رفع اليدين والتكرار.</b>',
  '<b> الإنفاق من الحلال، والنهي عن الإنفاق من الحرام.</b>',
  '<b>استواء الأنبياء مع أممهم في الأحكام الشرعية.</b>',
  '<b>الأكل الحلال يعين صاحبه على العبادة، ويؤدي إلى قبول الله للعمل والدعاء.</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث العاشر من الأربعين النووية، مع بيان مفردات الحديث وشروط قبول الدعاء، وأثر كسب الحلال على استجابة المناجاة وفضل تحري الطيب.',
    metaKeywords:  'الحديث العاشر, الأربعون النووية, إن الله طيب, كسب الحلال, شروط قبول الدعاء, أكل الطيبات, أداب الدعاء, شرح الحديث العاشر',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '11': {
    title: 'الحديث الحادي عشر',
    name: 'الحديث الحادي عشر: [الأخذ باليقين والبعد عن الشبهات]',
    hintText: 'دع الشك وخذ اليقين، فالحق طمأنينة والباطل ريبة وقلق.',
    audioUrl: 'audio/hadith/11.mpeg',
   phrases: [
    // 💡 عنوان الحديث في أول ثوانٍ
    { text: 'الْحَدِيثُ الْحَادِي عَشَرَ: [الأَخْذُ بِالْيَقِينِ وَالْبُعْدُ عَنِ الشُّبُهَاتِ].', start: 0, end: 5 },

    // راوي الحديث (مقسم إلى جزأين للتزامن الدقيق)
    { text: 'عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ،', start: 5.1, end: 8.9},
    { text: 'سِبْطِ رَسُولِ اللَّهِ ﷺ وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ:', start: 9, end: 15.7 },
    
    // متن الحديث
    { text: 'حَفِظْتُ مِنْ رَسُولِ اللَّهِ ﷺ:', start: 15.8, end: 19.4 },
    { text: '«دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ».', start: 19.5, end: 26 },
    
    // التخريج
    { text: 'رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ،', start: 26.1, end: 28.2 },
     {text: 'وَقَالَ التِّرْمِذِيُّ: حَدِيثٌ حَسَنٌ صَحِيحٌ.', start: 28.3, end: 32 }
  ],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>سِبْطِ:</b> <span>ولد البنت، وقيل سبط رسول الله: أي قطعة منه دلالة على شدة حب النبي له وللحسين.</span></li>
        <li><b>رَيْحَانَتِهِ:</b> <span>إما على سبيل الاستعارة: كان النبي يسر برؤيته ويرتاح كما يرتاح الإنسان عندما يشم الريحان، أو على سبيل الحقيقة: يجد منه الريح الطيب ويرتاح إليه.</span></li>
        <li><b>حَفِظْتُ مِنْ رَسُولِ اللَّهِ:</b> <span>دلالة على أنه كان صغيراً عندما سمع من النبي هذا الحديث.</span></li>
        <li><b>دَعْ:</b> <span>اترك، والأمر هنا على سبيل الندب، وفي هذا الحديث ارتباط مع الحديث الذي سبقه وكأنه يقول: لا يتم اجتناب الحرام ولا يتم اكتمال الحلال إلا بترك ما فيه ريبة.</span></li>
        <li><b>مَا يَرِيبُكَ:</b> <span>(ما بمعنى الذي) أي اترك الذي يريبك وتشك في حلاله.</span></li>
        <li><b>الرِّيبَةُ:</b> <span>هي الشك واللبس.</span></li>
        <li><b>إِلَىٰ مَا لَا يَرِيبُكَ:</b> <span>إلى ما لا تشك فيه من الحلال البين.</span></li>
        
        <li class="rule-item" style="list-style-type: none; margin: 10px 0; padding: 8px; background-color: #f5f8f6; border-right: 3px solid #1c3d27;">
          <b>المعنى العام للحديث:</b> <span>اترك الأشياء التي تشك فيها وخذ الأشياء التي لا تشك فيها، أي دع الشك وخذ اليقين.</span>
        </li>
      </ul>
    </div>
  `,
    box1Title: '📌  نبذة عن راوي الحديث',
    box1Items: [
    '<b>اسم الراوي ونسبه:</b> أبي محمد الحسن بن علي بن أبي طالب رضي الله عنه.',
  '<b>والداه:</b> والدته فاطمة رضي الله عنها ابنة النبي، ووالده علي بن أبي طالب رضي الله عنه ابن عم النبي.',
  '<b>مولده وعمره:</b> ولد في السنة الثالثة للهجرة فكان عمره سبع سنوات عندما توفي النبي ﷺ.',
  '<b>صفته الخَلقية والخُلقية:</b> كان أشبه الناس بالنبي، وسيماً جميلاً يضرب شعره منكبيه، أبيضاً مشرباً بالحمرة، أدعج العينين (أي شديد بياض العين وشديد سواد بؤبؤ العين)، سهل الخدين، دقيق المسربة، ربعة، جعد الشعر، وكان يختتم بيساريه (يلبس الخاتم بيساره)، كما كان كريماً حليماً.',
  '<b>رضاعه:</b> أرضعته أم الفضل زوجة العباس عم النبي ﷺ.',
  '<b>تسميته وعقيقته:</b> حنّكه النبي ﷺ وأذّن في أذنيه وذبح كبشاً كعقيقة عنه، وكان علي يريد أن يسميه حرباً فسماه النبي بالحسن، وفي اليوم السابع لولادته حلقت أمه فاطمة شعره وتصدقت بوزنه فضة على المساكين وأهل الصفة.',
  '<b>حب النبي له:</b> كان النبي ﷺ يحبه حباً شديداً فكان يحمله ويقول: "اللهم إني أحبه فأحبه".',
  '<b>سيادته وإصلاحه:</b> قال فيه النبي ﷺ: "إن ابني هذا سيد وعسى الله أن يصلح به بين فئتين من المسلمين".',
  '<b>خلافته وتنازله:</b> بويع بعد أبيه بالخلافة ودامت خلافته ستة أشهر، ثم تنازل عن الخلافة لمعاوية حقناً لدماء المسلمين.',
  '<b>وفاته:</b> توفي سنة 50 للهجرة مسموماً.'
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
    '<b>إذا تعارض الشك باليقين نأخذ باليقين.</b>',
  '<b> نبني أحكامنا وأمور حياتنا على اليقين.</b>',
  '<b> الإسلام حق واضح لا يقبل الشك والريبة .</b>',
    ],
    box3Title: '📌 فائدة',
    box3Items: [
'<b>قاعدة:</b><br>' +
  '• الحلال والحق والصدق ← طمأنينة ورضا.<br>' +
  '• الحرام والباطل والكذب ← ريبة وقلق.'],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الحادي عشر من الأربعين النووية، مع نبذة شاملة عن سبط رسول الله الحسن بن علي، وبيان قاعدة بناء الحياة على اليقين وترك الشك.' ,
    metaKeywords:  'الحديث الحادي عشر, الأربعون النووية, دع ما يريبك, الحسن بن علي, الأخذ باليقين, ترك الشبهات, ريحانة رسول الله, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '12': {
    title: 'الحديث الثاني عشر',
    name: 'الحديث الثاني عشر: [الإشتغال بما يفيد]',
    hintText: 'من كمال إيمان المرء وتمام إسلامه أن يترك ما لا مصلحة له فيه ولا يعنيه.',
    audioUrl: 'audio/hadith/012.mpeg',
    phrases: [
    // 💡 عنوان الحديث في أول ثوانٍ
    { text: 'الْحَدِيثُ الثَّانِي عَشَرَ: [الِاشْتِغَالُ بِمَا يُفِيدُ].', start: 0, end: 6.7 },

    // راوي الحديث
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ:', start: 6.1, end: 10},
    { text: 'قَالَ رَسُولُ اللَّهِ ﷺ:', start: 10.1, end: 13.4},
    
    // متن الحديث
    { text: '«مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ».', start: 13.5, end: 18.5 },
    
    // التخريج
    { text: 'حَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ وَغَيْرُهُ.', start: 18.6, end: 23 }
  ],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>حُسْنِ إِسْلَامِهِ:</b> <span>من كمال إسلامه وتمامه</span></li>
        <li><b>الْمَرْءِ:</b> <span>الإنسان، ذكراً كان أم أنثى.</span></li>
        <li><b>تَرْكُهُ:</b> <span>الترك هو الكف والامتناع عن فعل الشيء.</span></li>
        <li><b>مَا لَا يَعْنِيهِ:</b> <span>ما لا تتعلق عنايته ولا مصلحته به.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث ',
    box1Items: [
  '<b>الاشتغال بما يفيد و ترك مالا يفيد.</b>',
  '<b>تأديب النفس وتهذيبها من الرذائل والنقائص.</b>',
  '<b>على الإنسان الإشتغال بما فيه صلاحه معاشاً ومعاداً.</b>'
    ],
    box2Title: '📌 فائدة',
    box2Items: [
       '<b>من حكم لقمان:</b><br>' +
  'قيل للقمان: ما بلغ بك ما نرى؟ يريدون الفضل. فقال: <i>"صدق الحديث، وأداء الأمانة، وترك ما لا يعنيني"</i>.',

  '<b>من مواعظ الحسن:</b><br>' +
  ' <i>"من علامة إعراض الله تعالى عن العبد أن يجعل شغله فيما لا يعنيه"</i>.',

  '<b>جماع آداب الخير في أربع أحاديث:</b><br>' +
  '• ١. حديث: <i>"من كان يؤمن بالله واليوم الآخر"</i>.<br>' +
  '• ٢. حديث: <i>"من حسن إسلام المرء"</i>.<br>' +
  '• ٣. حديث: <i>"لا تغضب"</i>.<br>' +
  '• ٤. حديث: <i>"لا يؤمن أحدكم"</i>.'

    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني عشر من الأربعين النووية، مع تفسير المفردات وبيان حكم لقمان الحكيم والحسن البصري في ترك الفضول والاشتغال بما ينفع.',
    metaKeywords:  'الحديث الثاني عشر, الأربعون النووية, من حسن إسلام المرء, ترك ما لا يعنيه, الاشتغال بما يفيد, جوامع الكلم, آداب الخير, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '13': {
    title: 'الحديث الثالث عشر',
    name: 'الحديث الثالث عشر: [أخوة الإِيمان والإِسلام]',
    hintText: 'الحديث ظاهره التساوي ولكن حقيقته التفاضل ، فاذا احب لاخيه مثله فقد دخل هو في جمله المفضولين.',
    audioUrl: 'audio/hadith/13.mpeg',
     phrases: [
    { text: 'الحديث الثَّالِثَ عَشَرَ: أُخُوَّةُ الإِيمَانِ وَالإِسْلَامِ' , start: 0, end: 6 },
    { text: 'عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ ، خَادِمِ رَسُولِ اللهِ ﷺ ، ', start: 6.1, end: 14.6 },
    { text : 'عَنِ النَّبِيِّ ﷺ قَالَ:'  , start: 14.7, end: 18.2 },
      { text : '« لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ».'  , start: 18.3, end: 24.2 },
    { text:  'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ. ', start: 24.3, end: 27 }
  ],
  
  // الشرح والمفردات
  explanation: `
  <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لا يؤمن:</b> <span>الايمان الكامل.</span></li>
        <li><b>احدكم:</b> <span>كل من يدعى الايمان والاسلام منكم.</span></li>
        <li><b>يحب لاخيه:</b> <span>من الطاعات والاشياء المباحة.</span></li>
        <li><b>اخيه:</b> <span>اخوه في الاسلام او اخوه في الانسانيه.</span></li>
        <li><b>ما يحب لنفسه:</b> <span>مثل الذي يحبه لنفسه من الخير.</span></li>
      </ul>
      <p class="explanation-note" style="margin-top: 15px; line-height: 1.6; text-align: right;">
        الحديث ظاهره التساوي ولكن حقيقته التفاضل ، فاذا احب لاخيه مثله فقد دخل هو في جمله المفضولين.
      </p>
    </div>
  `,
    box1Title: '📌 نبذة عن راوي الحديث',
    box1Items: [
    '✓ <b>الراوي:</b> ابي حمزه انس بن مالك رضي الله عنه ، والده مالك بن النظر مات كافرا ، وامه ام سليم بنت ملحان.',
  '✓ انصاري خزرجي ، يلتقي نسبه من النبي ﷺ في اخواله من بني النجار.',
  '✓ اتت به امه الى النبي ﷺ حتى يخدمه ، فخدم النبي ﷺ 10 سنوات ، وكان عمره عندما هاجر النبي ﷺ الى المدينه 10 سنوات.',
  '✓ دعا له النبي ﷺ( اللهم اكثر ماله وولده وبارك له فيما اعطيته) وكان عنده 80 صبي وابنتان واحفاده 120.',
  '✓ كان من مكثري الروايه عن النبي ﷺ حيث ياتي بالمرتبه الثالثه بعد ابي هريره وابن عمر ، روى عن النبي ﷺ 2286 حديث.',
  '✓ اصيب بالبرص في نهايه حياته ، ومر بمحنه مع الحجاج حيث ختمه الحجاج في عنقه "عتيق الحجاج".',
  '✓ اخر الصحابه وفاه في البصره ، حيث توفي وعمره 103 سنوات في خلافه الوليد بن عبد الملك ، سنه 90 هجري.',
  '✓ ما رايت احدا اشبه في صلاه رسول الله ﷺ من ابن ام سليم.'
    ],
    box2Title: '📌  فوائد الحديث ',
    box2Items: [
  '١. ان يجتهد المسلم في اصلاح اخيه المسلم',
  '٢. محبه الخير للناس',
  '٣. الايمان يزيد وينقص ، ومحبه الخير للناس من شعب الايمان',
  '٤. المؤمن للمؤمن كالنفسى الواحده (مَثَلُ المؤمنين في توادِّهم وتراحمهم وتعاطفهم كمثل الجسد الواحد؛ إذا اشتكى منه عضوٌ تداعى له سائر الجسد بالسهر والحمّى)',
  '٥. من الايمان ان يبغض لاخيه ما يبغض لنفسه من الشر.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني عشر من الأربعين النووية، مع تفسير المفردات وبيان حكم لقمان الحكيم والحسن البصري في ترك الفضول والاشتغال بما ينفع.',
    metaKeywords: 'الحديث الثاني عشر, الأربعون النووية, من حسن إسلام المرء, ترك ما لا يعنيه, الاشتغال بما يفيد, جوامع الكلم, آداب الخير, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '14': {
    title: 'الحديث الرابع عشر',
    name: 'الحديث الرابع عشر: [حرمة دم المسلم]',
    hintText: 'حرمه دم المسلم على المسلم.',
    audioUrl: 'audio/hadith/14.mpeg',
     phrases: [
    { text: 'الْحَدِيثُ الرَّابِعَ عَشَرَ: [ حُرْمَةُ دَمِ الْمُسْلِمِ ].', start: 0, end: 5.5},
    { text: 'عَنِ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَال :', start: 5.6, end: 10.4},
    { text: 'قَالَ رَسُولُ اللهِ ﷺ :', start: 10.5, end: 13.7 },
    { text: '« لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ [ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنِّي رَسُولُ اللهِ ] إِلَّا بِإِحْدَى ثَلَاثٍ :', start: 13.8, end: 23 },
    { text: 'الثَّيِّبُ الزَّانِي ،', start: 23.1, end: 26.2 },
    { text: 'وَالنَّفْسُ بِالنَّفْسِ ،' , start: 26.3, end: 2}, 
    { text: 'وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ ».', start: 27.5, end: 31.9},
    { text: '  رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ. ', start: 32, end: 34 }
  ],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لا يحل دم:</b> <span>اي لا تحل اراقته والمراد: القتل.</span></li>
        <li><b>امرئ:</b> <span>ذكر او انثى.</span></li>
        <li><b>مسلم:</b> <span>من حقق اركان الاسلام.</span></li>
        <li><b>يشهد:</b> <span>يقر ويعترف ان لا معبود بحق الا الله عز وجل.</span></li>
        <li><b>باحدى ثلاث:</b> <span>اي يحل قتله اذا فعل احدى هذه الثلاث.</span></li>
        <li><b>الثيب الزاني:</b> <span>المتزوج او المحصن ، كلمه الثيب تطلق على الذكر والانثى ، وقد اجمع الفقهاء على ان عقوبه الزاني المحصن الرجم حتى الموت.</span></li>
        <li><b>الزنا:</b> <span>ان يطأ رجل امراه حية في قبلها من غير عقد شرعي.</span></li>
        <li><b>النفس بالنفس:</b> <span>من قتل نفسا عمدا وبغير حق ، ويعني به النفوس المتكافئه في الاسلام والحريه ، لقوله ﷺ "لا يقتل مسلم بكافر".</span></li>
        <li><b>التارك لدينه:</b> <span>المراد بالدين: الإسلام ،والمقصود به: المرتد.</span></li>
        <li><b>المفارق للجماعه:</b> <span>تارك لجماعه المسلمين بالردة.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌  فوائد الحديث',
    box1Items: [
   '• <b>١. حرمه دم المسلم على المسلم.</b>',
  '• <b>٢. تحريم فعل احدى هذه الخصال وعظم وزرها حتى استحق فاعلها عقوبه القتل.</b>',
  '• <b>٣. وجوب حفظ الاعراض ونقائها لذلك شرع النكاح .</b>',
  '• <b>٤. الحث على التزام جماعه المسلمين وعدم مفارقتهم.</b>',
  '• <b>٥. الترهيب من قتل النفس التي حرم الله.</b>'
    ],
    box2Title: '📌 مقارنة',
    box2Items: [
    '• <b>استدل هذا الحديث ان تارك الصلاه لا يقتل بينما حديث (حرمه المسلم) تارك الصلاه يقتل.</b>',
  '• <b>فقال ابن الجوزيه ان الذي يترك الصلاه جحودا وكفرا ← كافر لتركه الصلاة.... قالصلاة ركن من اركان الدين (فمن تركها ترك دينه بالكليه).</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الرابع عشر عن ابن مسعود (لا يحل دم امرئ مسلم)، وبيان الأحوال الثلاثة التي يحل بها القتل: الثيب الزاني، النفس بالنفس، والتارك لدينه المفارق للجماعة، مع مناقشة حكم تارك الصلاة عند ابن الجوزية.',
    metaKeywords: 'الحديث الرابع عشر, لا يحل دم امرئ مسلم, ابن مسعود, الثيب الزاني, النفس بالنفس, التارك لدينه, المفارق للجماعة, عقوبة الزاني المحصن, حكم تارك الصلاة, ابن الجوزية, شروح الأربعين النووية',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '15': {
    title: 'الحديث الخامس عشر',
    name: 'الحديث الخامس عشر: [من خصال الإِيمان]',
    hintText:'ليس اكرام الضيف بطيب الطعام ، بل بطيب النفس ، وبشاشه الوجه.',
    audioUrl: 'audio/hadith/15.mpeg',
    
  phrases: [
    { text: ' الحَدِيثُ الخَامِسَ عَشَر: [مِن خِصَالِ الإِيمَان]', start: 0, end: 4.9 },
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:', start: 5, end: 12.4 },
    { text: '«مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ،', start: 12.5, end: 18 },
    { text: 'وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ،', start: 18.1, end: 23},
    { text: 'وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ».', start: 23.1, end: 29 },
    { text: 'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ.', start: 29.1, end: 32.0 }
  ],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>من كان يؤمن:</b> <span>الايمان الكامل.</span></li>
        <li><b>من كان يؤمن بالله واليوم الاخر:</b> <span>قاعده الانطلاق في العمل الاسلامي من فعل او ترك ، فمنطلق اي عمل هو الايمان بالله واليوم الاخر.</span></li>
        <li><b>اليوم الاخر:</b> <span>يوم القيامه يوم الجزاء والحساب.</span></li>
        <li><b>فليقل خيرا:</b> <span>يتكلم بامور الخير ومنها:
        <br>١. التبليغ عن الله ورسوله 
        <br>٢. الامر بالمعروف والنهي عن المنكر.
        <br>٣. كلمه حق عند سلطان جائر</span></li>
        <li><b>او ليصمت:</b> <span>يسكت.</span></li>
        <li><b>فليقل خيرا او ليصمت:</b> <span>يدل على ان قول الخير خير من الصمت ، والصمت خير من قول الشر.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌أنواع الجار وحقوقه',
    box1Items: [
   '• <b>لجار ثلاثه انواع:</b><br>١. الجار القريب: من ذوي القربى وله ثلاثه حقوق: حق القرابه _ وحق الجوار _ وحق الاسلام.<br>٢. الجار غير القريب: وله حق الجوار والاسلام. <br>٣. الجار غير المسلم: وله حق الجوار.',
  '• <b>قال ﷺ "ما زال جبريل يوصيني بالجار حتى ظننت انه سيورثه".</b>',
  '• <b>اختلف الفقهاء في اكرام الضيف ، منهم من قال واجب ، ومنهم من قال مستحب.</b>',
  '• <b>من اكرام الضيف:</b><br>١. البشاشه في وجهه <br>٢. طيب الحديث معه <br>٣. اطعام الطعام'
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
   '• <b>١. منطلق جميع الاعمال هو الايمان بالله واليوم الاخر.</b>',
  '• <b>٢. الحث على قول الخير ،  واكرام الضيف ، واكرام الجار.</b>',
  '• <b>٣. على المرء التأني والتفكير قبل التكلم.</b>',
  '• <b>٤. ليس اكرام الضيف بطيب الطعام ، بل بطيب النفس ، وبشاشه الوجه.</b>',
  '• <b>٥. يجب الامر بالمعروف عن علم ، وانكار المنكر عن علم.</b>'
    ],
    box3Title: '📌 تعقيبات',
    box3Items: [
  '• <b>١. لا تكونوا اصحاب فتن.</b>',
  '• <b>٢. من عد كلامه من عمله ← قل كلامه فيما لا يعنيه.</b>',
  '• <b>٣. من آمن بالله الايمان الحق وخاف وعيده ضبط جوارحه وفي مقدمتها اللسان.</b>'
    ],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الخامس عشر (من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت)، وبيان حقوق الجار الثلاثة، وآداب إكرام الضيف، وأثر الإيمان في توجيه السلوك.',
    metaKeywords: 'الحديث الخامس عشر, من خصال الإيمان, فليقل خيراً أو ليصمت, إكرام الجار, إكرام الضيف, حقوق الجار, آداب الضيافة, حفظ اللسان, شروح الأربعين النووية',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '16': {
    title: 'الحديث السادس عشر',
    name: 'الحديث السادس عشر: [النهي عن الغضب]',
    hintText: 'دع الشك وخذ اليقين، فالحق طمأنينة والباطل ريبة وقلق.',
    audioUrl: 'audio/hadith/16.mpeg',
   phrases: [
    { text:  'الحَدِيثُ السَّادِسَ عَشَرَ: [النَّهْيُ عَنِ الغَضَبِ].', start: 0, end: 5.7},
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَوْصِنِي.', start: 5.8, end:  14.6},
    { text: ' قَالَ: «لَا تَغْضَبْ».', start: 14.7, end: 17.4 },
    { text :  'فَرَدَّدَ مِرَارًا، قَالَ: «لَا تَغْضَبْ».' , start : 17.5, end: 22 },
    { text: 'رَوَاهُ البُخَارِيُّ.', start: 22.1, end: 23 }
  ],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
        <li><b>ان رجلا:</b> <span>قيل هو ابو الدرداء ، وقيل جارية بن قدامة ، وقيل ربما تكررت الحادثه وتعدد السائل.</span></li>
        <li><b>اوصني:</b> <span>دلني على عمل ينفعني ، وفيه دليل على حرص الصحابه على خيري الدنيا والاخره.</span></li>
        <li><b>لا تغضب:</b> <span>الغضب: هو ثوران في النفس يحملها على الرغبه في البطش والانتقام.</span></li>
        <li><b>معنى لا تغضب:</b> <span>اي اجتنب اسباب الغضب ولا تعمل بمقتضى الغضب.</span></li>
        <li><b>ردد مرارا:</b> <span>كرر طلبه للوصيه.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 أنواع الناس والغضب',
    box1Items: [
      '• <b>للناس ثلاثه انواع:</b><br>١. سريع الغطب سريع الفيء.<br>٢. سريع الغضب بطيء الفيء "هذا شر الناس".<br>٣. بطيء الغضب سريع الفيء "وهو افضلهم".',
  '• <b>للغضب ثلاثه انواع:</b><br>١. الاخضر: ان يغضب بما فيه انتهاك لحرمات الله (محمود).<br>٢. الاحمر: ان يغضب على الامور التوافه التي تثير الانسان ولكنه في حدود التمكن. <br>٣. الاسود: يعمي البصر والبصيره (مذموم).'
    ],
    box2Title: '📌 كيفيه معالجه الغضب',
    box2Items: [
      '• <b>١. التعوذ من الشيطان</b>',
  '• <b>٢. الوضوء</b>',
  '• <b>٣. تغيير جلسته</b>',
  '• <b>٤. يدرب نفسه على ضبط النفس</b>',
  '• <b>٥. ترك الكلام عند الغضب</b>'
    ],
    box3Title: '📌 فوائد الحديث',
    box3Items: [
    '• <b>١. حرص المسلم على ما ينفعه في دينه ودنياه.</b>',
  '• <b>٢. الغضب جماع الشر ، والتحرير منه جماعه الخير.</b>',
  '• <b>٣. ينبغي على المسلم ان يعين نفسه على ترك الغضب (من كظم غيظا وهو قادر على ان ينفذه دعاه الله على رؤوس الخلائق حتى يخيره من الحور العين ما شاء).</b>',
  '• <b>٤. الغضب مذموم في امور الدنيا.</b>',
  '• <b>٥. الغضب ممدوح ما كان لله ولنصرة دينه.</b>'
    ],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث السادس عشر (لا تغضب)، وبيان أنواع الغضب الثلاثة (الأخضر والأحمر والأسود)، وطرق علاج الغضب كالتعوذ والوضوء وكظم الغيظ.',
    metaKeywords: 'الحديث السادس عشر, النهي عن الغضب, لا تغضب, علاج الغضب, كظم الغيظ, أنواع الغضب, ضبط النفس, شروح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  /*
  '17': {
    title: 'الحديث ',
    name: 'الحديث ',
    hintText: '',
    audioUrl: 'audio/hadith/00.mpeg',
    phrases: [
      { text: 'بينما نحن جلوس عند رسول الله', start: 0, end: 4 }
      // ... بقية الـ phrases للحديث الثاني
    ],
    explanation: 'شرح الحديث الثاني...',
    box1Title: '📌 فوائد الحديث الثاني',
    box1Items: [
      'مراتب الدين ثلاثة: الإسلام، والإيمان، والإحسان.'
    ],
    box2Title: '📌 أدب السؤال',
    box2Items: [
      'جلوس جبريل عليه السلام يبرز أدب طالب العلم أمام المعلم.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني من الأربعين النووية (حديث جبريل عليه السلام) لبيان مراتب الدين.',
    metaKeywords: 'حديث جبريل, الإسلام, الإيمان, الإحسان, الأربعون النووية',
    quizQuestions: {  } 
    }   */
  
};