export const NAWAWI_HADITHS: Record<string, any> = {
  '1': {
    title: 'الحديث الأول:', 
    name: 'الحديث الأول:  [الأعمال بالنيات]', 
    hintText: 'إجعل عملك خالص لله تعالى.',
    audioUrl: 'audio/hadith/01.mpeg',
    imageUrls: [ '/images/nawawi/hadith1.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>النيه لغه:</b> <span>قصد الشيء</span></li>
        <li><b>النية اصطلاحا:</b> <span>قصد الشيء مقترنا بفعله</span></li>
        <li><b>لكل امرئ:</b> <span>تشمل كل الناس ذكر او انثى</span></li>
        <li><b> هجرته - الهجرة لغة: </b> <span>الترك</span></li>
        <li><b>الهجرة اصطلاحا:</b> <span>ترك دار الكفر الى دار الاسلام</span></li>
        <li><b>فهجرته الى الله ورسوله:</b> <span>اي وقع الاجر وقبلت النية</span></li>
        <li><b>لدنيا يصيبها:</b> <span>اي عمل ينوي به غير الآخرة</span></li>
        <li><b>سميت بالدنيا:</b> <span>اما دنو منزله لانها ادنى من الاخره او دنو زمن لانها تاتي قبلها</span></li>
        <li><b>او امرأة ينكحها:</b> <span>يتزوجها ليس فيها اجر الهجرة</span></li>
        <li><b>الهجره كانت من الامور العظيمه في الاسلام:</b> <span>لذلك وضعها سيدنا عمر تاريخا للمسلمين لان الامم اعتادت ان تؤرخ باحداثها العظام فلم يجد سيدنا عمر اعظم من الهجره فكانت مبدأ تاريخ المسلمين</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
    'لا يعتد بالاعمال بدون نيه',
    'الهجره واجبه من دار الكفر الى دار الايمان اذا لم يستطع ان يقوم المسلم بامور دينه',
    'انعقاد الاجر حتى لو لم يقم صاحبه به',
    'اساس العمل الاخلاص لله وحده',
    'كل عمل مباح يصبح قربى لله اذا كان خالصا لله'
    ],
    box2Title: '', // اتركيه فارغاً إذا لم يكن هناك صندوق ثاني
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الأول من الأربعين النووية (الأعمال بالنيات)، مع إضاءات من حياة الراوي عمر بن الخطاب رضي الله عنه وفوائد الحديث.',
    metaKeywords:'الأعمال بالنيات, الحديث الأول, الأربعون النووية, عمر بن الخطاب, شرح الحديث',
    quizQuestions: { 
    hadith_title_prov: 'شرح الحديث الأول', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: 'من هو راوي الحديث الأول؟',
      options: ['أبو هريرة', 'عمر بن الخطاب', 'علي بن أبي طالب'],
      correctAnswer: 'عمر بن الخطاب',
    
     }  ] } 
  },

  '2': {
    title: 'الحديث الثاني',
    name:  'الحديث الثاني: [مراتب الدين: الإسلام والإيمان والإحسان] ',
    hintText: 'كل مؤمن مسلم وليس كل مسلم مؤمن',
    audioUrl: 'audio/hadith/02.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith2-1.png',
       '/images/nawawi/hadith2-2.png'],
  // الشرح والمفردات
// الشرح والمفردات المحدثة بهيكل القوائم المنظمة
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>بينما:</b> <span>ظرف ياتي للزمان او المكان.</span></li>
        <li><b>إذ طلع:</b> <span>إذ فجائية، اي خرج علينا فجأة.</span></li>
        <li><b>سيدنا جبريل جاء معلما على هيئه المتعلم:</b> <span>(سيدنا الامام مالك: كان اذا اراد ان يحدث عن النبي ﷺ يلبس اجمل الثياب).</span></li>
        <li><b>لا يرى عليه اثر السفر:</b> <span>ليس عليه اثار السفر.</span></li>
        <li><b>ولا يعرفه منا احد:</b> <span>ليس من اهل المدينه.</span></li>
        <li><b>حتى جلس الى النبي ﷺ:</b> <span>جلس جلسه المتعلم المتأدب ووضع كفيه على فخذيه: قيل على فخذي نفسه كهيئه المتأدب، وقيل على فخذي النبي ﷺ، والروايه الاولى اصح واشهر.</span></li>
        <li><b>يا محمد:</b> <span>حدثه بطريقه الاعراب في الطلب (طبع جلف).</span></li>
        <li><b>اخبرني عن الاسلام - الاسلام لغة:</b> <span>الاستسلام والانقياد.</span></li>
        <li><b>الاسلام اصطلاحا:</b> <span>اركان الاسلام التي ذكرها النبي ﷺ، فالاسلام هو الاعمال الظاهره.</span></li>
        <li><b>ان تشهد ان لا اله الا الله:</b> <span>اي (لا معبود بحق الا الله): الاقرار.</span></li>
        <li><b>وان محمدا رسول الله:</b> <span>لانه من لوازم الايمان  بالله، الايمان برساله النبي ﷺ وانه مرسل من عند الله تعالى.</span></li>
        <li><b>تقيم الصلاه - الصلاه لغه:</b> <span>الدعاء.</span></li>
        <li><b>الصلاه اصطلاحا:</b> <span>مجموعه اقوال وافعال مفتتحه بالتكبير ومختتمه التسليم.</span></li>
        <li><b>معنى تقيم الصلاه:</b> <span>اي تأتي بها تامه الاركان والاداب والسنن والشروط.</span></li>
        <li><b>الشرط:</b> <span>ما لا يتم الواجب الا به ويكون خارجا عن ماهيته مثل (الوضوء شرط للصلاه).</span></li>
        <li><b>الركن:</b> <span>ما لا يتم الواجب الا به ويكون داخلا في ماهيته مثل (السجود والركوع في الصلاه).</span></li>
        <li><b>اي الشرط خارج العباده والركن داخل العباده.</b> </li>
        <li><b> تؤتى الزكاه: الزكاه لغه:</b> <span>نماء ونقاء.</span></li>
        <li><b>الزكاه اصطلاحا:</b> <span>مال مخصوص من الاغنياء يعطى الى الفقراء.</span></li>
        <li><b>الصيام - الصيام لغه:</b> <span>الامساك.</span></li>
        <li><b>الصيام اصطلاحا:</b> <span>الامساك عن المفطرات من طلوع الفجر الصادق الى غروب الشمس بنية.</span></li>
        <li><b>فعجبنا له يسأله ويصدقه:</b> <span>لان سؤاله يدل على جهله بالمسؤول عنه وتصديقه يدل على علمه به.</span></li>
        <li><b>الايمان لغه:</b> <span>التصديق.</span></li>
        <li><b>الايمان اصطلاحا:</b> <span>هو الاعتقاد الجازم بالقلب، وقيل هو : اعتقاد بالقلب ونطق باللسان وعمل بالجوارح والاركان.</span></li>
        <li><b>الملائكه:</b> <span>مخلوقات نورانيه لا يعصون الله ما امرهم ويفعلون ما يؤمرون، ولا يتصفون بذكوره او انوثه ولا يعلم عددهم إلا الله تعالى.</span></li>
        <li><b>كتبه:</b> <span>اي الكتب السماويه التي انزلت على الانبياء.</span></li>
        <li><b>هناك اربع كتب اساسيه هي:</b> <span>(التوراه _ والانجيل _ والزبور _ والقرآن) وصحف ابراهيم وصحف موسى.</span></li>
        <li><b>رسوله:</b> <span>الايمان بجميع الرسل ، قال تعالى {لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ}.</span></li>
        <li><b>اليوم الاخر:</b> <span>يوم القيامه والايمان به يعني الايمان بكل ما اشتمل عليه من البعث والحشر والنشر والحساب والميزان والصراط والجنه والنار.</span></li>
        <li><b>كل التكاليف التي كلف الله بها العباد:</b> <span>منطلقها الايمان باليوم الاخر.</span></li>
        <li><b>ان تؤمن بالقدر:</b> <span>اي ان كل ما يحصل بأمر من الله، لحكمة لا يعلمها الا الله تعالى.</span></li>
        <li><b>الاحسان:</b> <span>الاخلاص في العباده واتقانها.</span></li>
        <li><b>الساعة:</b> <span>يوم القيامه.</span></li>
        <li><b>سميت ساعه:</b> <span>لانها تفاجئ الناس في ساعه فيموت الخلق كلهم بصحيه واحدة.</span></li>
        <li><b>ما المسؤول عنها باعلم من السائل:</b> <span>عدم الجواب عما لا يعلم، سيدنا ابو بكر رضي الله عنه كان يقول: نصف العلم قول لا اعلم.</span></li>
        <li><b>امارتها:</b> <span>علاماتها ... هناك علامات صغرى وعلامات كبرى.</span></li>
        <li><b>علامات صغرى:</b> <span>بعثة النبي ﷺ، انشقاق القمر، انتشار الفتن، كثرة الموت، وكثره الزلازل....</span></li>
        <li><b>علامات كبرى:</b> <span>ظهور الدجال ، وشروق الشمس من مغربها، نزول سيدنا عيسى، خروج يأجوج ومأجوج.</span></li>
        <li><b>الامة:</b> <span>الجارية المستولدة.</span></li>
        <li><b>ربتها:</b> <span>سيدتها، وقيل المقصود انتشار عقوق الوالدين، وقيل ان يطأ السيد ملك يمينه فتنجب ولدا ينسب لوالده فيكون سيدا كوالده.</span></li>
        <li><b>الحفاه:</b> <span>لا حذاء لهم في اقدامهم.</span></li>
        <li><b>العراة:</b> <span>ليس عليهم ثياب.</span></li>
        <li><b>العالة:</b> <span>الفقراء.</span></li>
        <li><b>رعاء الشاء:</b> <span>راع، والشاء: جمع شاة وهي واحده الضأن، وخصهم بالذكر لانهم اضعف اهل الباديه، فمن يرعى الابل افضل وغالبا لا يكونون فقراء.</span></li>
        <li><b>يتطاولون:</b> <span>يبنون الابنيه العاليه تفاخرا ورياء.</span></li>
        <li><b>فلبثت مليا:</b> <span>اي انتظرت وقتا طويلا وقيل: ثلاثه ايام.</span></li>
        <li><b>اتاكم يعلمكم دينكم:</b> <span>اي قواعد الدين وكلياته.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
  'التأدب في مجالس العلم',
  'تحسين الثياب والهيئة عند الدخول على العلماء والفضلاء والملوك',
  'وجوب الايمان بالقدر خيره وشره',
  'الاخلاص في العباده ومراقبه الله',
  'الاسلام والايمان حقيقتان متباينتان لغه وشرعا (الاسلام اعمال ظاهره ، الايمان اعمال باطنة)',
  'الايمان يزيد وينقص وهو يزيد بزياده ثمراته فالايمان يزيد بالطاعه وينقص بالمعصيه',
  'كل مؤمن مسلم وليس كل مسلم مؤمن',
  'قيام الساعه من الغيب الذي استأثر الله به لنفسه'
    ],
    box2Title: '📌 أهمية الحديث',
    box2Items: [
      'يشمل الاعمال الظاهره والباطنه كما ان الفاتحه ام الكتاب فان هذا الحديث ام السنه'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'اقرأ واستمع إلى متن الحديث السابع مع الشرح الصوتي، تفسير المفردات، وأبرز الفوائد عن كون النصيحة فرض كفاية ومن أعظم الأعمال.',
    metaKeywords:'الدين النصيحة, الحديث السابع, الأربعون النووية, تميم بن أوس الداري, حكم النصيحة, آداب النصيحة, النصيحة لله ولكتابه, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '3': {
    title: 'الحديث الثالث',
    name: 'الحديث الثالث: [أركان الإسلام ودعائمه العظام]',
    hintText:'الإسلام له خمس دعائم وركائز',
    audioUrl: 'audio/hadith/03.mpeg',
     imageUrls: [ 
      '/images/nawawi/hadith3.png'],
    explanation: `
 <div class="explanation-content" >
      <ul class="vocabulary-list" style="max-width: 100%; display: flex; flex-direction: column; wrap-flow: auto; word-break: break-word; overflow-wrap: break-word;">
        <li><b>بني الاسلام:</b> <span>أسس</span></li>
        <li><b>على خمس:</b> <span>أي خمس دعائم وركائز</span></li>
        <li><b>يقول النبي ﷺ:</b> <span>الاسلام بضع وسبعون شعبة أعلاها كلمة لا إله إلا الله وأدناها إماطة الأذى عن الطريق</span></li>
        <li><b>شهادة أن لا إله إلا الله:</b> <span>الإقرار والتصديق بأن لا معبود بحق إلا الله تعالى</span></li>
        <li><b>أن محمداً رسول الله:</b> <span>التصديق والطاعة فيما أمر به واجتناب ما نهى عنه، لأن من لوازم الإيمان بالله والإيمان برسول الله</span></li>
        <li><b>إقام الصلاة:</b> <span>أن يأتي بها كاملة الشروط والأركان والسنن والآداب</span></li>
        <li><b> إيتاء الزكاة: الزكاة لغة:</b> <span> النماء \</span> </li>
        <li><b>الزكاة اصطلاحاً:</b> <span>مال مخصوص يؤخذ ممن بلغ عنده النصاب ويعطى إلى فئة معينة من الناس وهي نماء ونقاء</span></li>
        <li><b>حج البيت:</b> <span>الحج هو القصد إلى معظم (بيت الله تعالى)</span></li>
        <li><b>عقوبة تارك الصلاة:</b> <span>يرفع أمره إلى القاضي إذ تركها متعمداً، يحبس ثلاثة أيام فأما أن يتوب أو يقتل، وذهب الجمهور أنه: يقتل حداً. وقال الحنبلي: يقتل كفراً فلا يغسل ولا يكفن ولا يصلى عليه ولا يدفن بمقابر المسلمين ولا يورث ماله</span></li>
        <li><b>تارك الزكاة:</b> <span>يرفع أمره إلى القاضي فتأخذ الزكاة منه عنوةً ويؤخذ نصف ماله لقول النبي ﷺ "من منعها أخذناها وشطر ماله"</span></li>
        <li><b>هذه الخمس دعائم هي فرض دائم:</b> <span>بينما الجهاد فرض كفاية لذلك لم يذكر ضمن الحديث</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
  'لا يتم إسلام من نكر أحد هذه الأركان',
  'حكم الإسلام في الظاهر يثبت بالشهادتين، وإنما أضيفت إليهما الصلاة والصيام لأنها أظهر للشريعة وأعظمها',
  'غاية العبادة القبول عند الله وشرطها: الإخلاص',
  'الإسلام عقيدة وعمل.. لا ينفع إيمان دون عمل.. ولا عمل دون إيمان'
    ],
    box2Title: '',
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الثالث من الأربعين النووية (بني الإسلام على خمس)، مع بيان مفصل لأركان الإسلام الخمسة وشروط قبول العبادات وعقوبة ترك الصلاة والزكاة.' ,
    metaKeywords: 'بني الإسلام على خمس, أركان الإسلام, الحديث الثالث, الأربعون النووية, شهادة أن لا إله إلا الله, إقام الصلاة, إيتاء الزكاة, حج البيت, صوم رمضان, شرح الحديث' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '4': {
    title: 'الحديث الرابع',
    name: 'الحديث الرابع: [أطوار خلق الإنسان وخاتمته]',
    hintText: ' دعاء الرسول ﷺ يا مقلب القلوب والأبصار ثبت قلبي على دينك',
    audioUrl: 'audio/hadith/04.mpeg',
        imageUrls: [ 
      '/images/nawawi/hadith4-1.png',
       '/images/nawawi/hadith4-2.png'],
   explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>الصادق المصدوق:</b> <span>ذكر ابن مسعود هذه العباره رغم ان النبي صادق حتى في الجاهليه وذلك لانه يحدث بامور لا يعرفها الناس عن كيفيه خلق الانسان واطوار خلقه وهذا الحديث من معجزات النبي حيث لم تكتشف هذه الامور الا في العصر الحديث. والمقصود بالصدق: مطابقه القول للواقع. الصادق: اي قوله الحق المطابق للواقع. المصدوق: فيما اوحي اليه لان جبريل ياتيه بالصدق من ربه والله تعالى يصدقه فيما وعده به. فهو صادق فيما يخبر مصدق فيما يتناوله من خبر</span></li>
        <li><b>إن احدكم يجمع:</b> <span>يحتمل انه يراد بها جمع ماء الرجل بماء المراه فيخلق منها الولد</span></li>
        <li><b>خلقه:</b> <span>ماده خلقه وهو الماء الذي يخلق منه</span></li>
        <li><b>في بطن امه:</b> <span>رحمها</span></li>
        <li><b>مضغه:</b> <span>قطعه لحم بمقدار ما يمضغ</span></li>
        <li><b>يرسل اليه الملك يؤمر باربع كلمات:</b> <span>المرسل والأمِر هو الله تعالى</span></li>
        <li><b>ينفخ فيه الروح:</b> <span>ويكون ذلك بعد ١٢٠ يوما اي اربعه اشهر قمريه</span></li>
        <li><b>الروح:</b> <span>هي علامه الحياة</span></li>
        <li><b>فيسبق عليه الكتاب:</b> <span>الذي سبق في علم الله تعالى</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد ',
    box1Items: [
'فائدة ١: كان دعاء الرسول ﷺ يا مقلب القلوب والأبصار ثبت قلبي على دينك',
`فائدة ٢: العشرة المبشرون بالجنة رضي الله تعالى عنهم: <br>
• أبو بكر الصديق <br>  
• عمر بن الخطاب <br>
• علي بن أبي طالب <br>
• عثمان بن عفان <br>
• الزبير بن العوام <br>
• طلحة بن عبيد الله <br>
• عبد الرحمن بن عوف <br>
• سعد بن أبي وقاص <br>
• سعيد بن زيد <br>
• أبو عبيدة بن الجراح`
    ],
    box2Title: '📌  فوائد الحديث ',
    box2Items: [
'في الحديث إثبات القدر ولكن يجب على الإنسان ألا يترك العمل اتكالاً على القدر بل تجب الأعمال التكاليف التي ورد بها الشرع',
'كتاب الله تعالى ولوحه وقلمه كل ذلك مما يجب الإيمان به وأما كيفية ذلك وصفته فعلمه إلى الله تعالى',
'القسم على الخبر الصادق يوقع في نفس السامع تأكيداً',
'من مات على شيء حكم له به من خير أو شر',
'عدم الاغترار بصور الأعمال والركون إليها بل علينا العمل والاعتماد على كرم الله',
'الاستعاذة من سوء الخاتمة',
'التنبيه على صدق البعث بعد الموت'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الرابع من الأربعين النووية (أطوار خلق الإنسان وخاتمته). بيان مراحل الجنين في بطن أمه، نفخ الروح، إثبات القدر وعلامات حسن وسوء الخاتمة.',
    metaKeywords: 'الحديث الرابع, أطوار خلق الإنسان, مراحل الجنين, نفخ الروح, الصادق المصدوق, القدر, حسن الخاتمة, سوء الخاتمة, الأربعون النووية, شرح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '5': {
    title: 'الحديث الخامس',
    name: 'الحديث الخامس: [إبطال المنكرات والبدع]',
    hintText: 'الاسلام هو اتباع لا ابتداع',
    audioUrl: 'audio/hadith/05.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith5.png'],

  explanation: `
   <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>من احدث:</b> <span>الحديث: ضد القديم، ومعنى احدث: اخترع وانشأ من قبل نفسه</span></li>
        <li><b>في امرنا:</b> <span>في ديننا وشرعنا، اما امور الدنيا فلا تدخل في هذا النهي</span></li>
        <li><b>ما ليس منه:</b> <span>اي ما ينافيه ويناقضه ولا يشهد له شيء من قواعد الدين وادلته</span></li>
        <li><b>فهو رد:</b> <span>باطل لا يقبل من فاعله ولا يعتد به</span></li>
        <li><b>الحديث يدل على ان:</b> <span>الاسلام هو اتباع لا ابتداع</span></li>
        <li><b>البدعه المحموده:</b> <span>تكون من اصل القرآن والسنه النبويه مثالها عندما امر ابو بكر رضي الله عنه بكتابه القرآن الكريم وعندما جمع عمر بن الخطاب رضي الله عنه الناس على صلاه التراويح</span></li>
        <li><b>من عمل عملا:</b> <span>اي اتبع بدعه لم يحدثها هو وإنما احدثها غيره ثم جاء هو وعملها اتباعا لمحدثها</span></li>
        <li><b>الامام الشافعي يقول:</b> <span>ما احدث وخالف كتابا او سنه او اجتماعا او اثرا فهو البدعه الضلاله، وما احدث من الخير ولم يخالف شيئا من ذلك فهو البدعه المحموده.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث ',
    box1Items: [
     '<b> الاستحداث المذموم في أمور الدين هو مرفوض</b>',
  '<b>الاستحداث المذموم هو ما خالف الكتاب والسنة</b>',
  '<b>لا أتعبد إلا بالأشياء التي أمرني بها من العبادات</b>',
  '<b>كل عمل لا يقبل عند الله إلا بشرطين: </b><br>  ١. خالصاً لله<br> ٢. موافقاً للشرع'
    ],
    box2Title: '📌 أهمية الحديث',
    box2Items: [
   '<b>يقول أحمد بن حنبل أصول الإسلام تقوم على ثلاثة أحاديث:</b>',
  '١.إنما الأعمال بالنيات.',
  '٢.من عمل عملاً ليس عليه أمرنا فهو رد .',
  '٣.الحلال بين والحرام بين.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الخامس من الأربعين النووية (إبطال المنكرات والبدع) عن أم المؤمنين عائشة. ميزان الأعمال الظاهرة وقاعدة الاتباع في الإسلام.' ,
    metaKeywords: 'الحديث الخامس, إبطال المنكرات والبدع, من أحدث في أمرنا, فهو رد, البدعة, الاتباع, عائشة أم المؤمنين, الأربعون النووية, شرح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '6': {
    title: 'الحديث السادس',
    name: 'الحديث السادس: [الحلال والحرام]',
    hintText: 'اجعل بينك وبين الحرام وقاية واتقِ الشبهات ليَسْلَم دينك وعِرضك',
    audioUrl: 'audio/hadith/06.mpeg',
     imageUrls: [ 
      '/images/nawawi/hadith6-1.png',
       '/images/nawawi/hadith6-2.png'],
        imageRotations: [-2],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>إنَّ:</b> <span>للتوكيد، لتأكيد المعنى بعدها.</span></li>
        <li><b>الحلال:</b> <span>هو ما أحله الله ورسوله وأجمع المسلمون على تحليله بعينه.</span></li>
        <li><b>الحرام:</b> <span>هو ما نص الله ورسوله وأجمع المسلمون على تحريمه بعينه.</span></li>
        <li><b>بيّن:</b> <span>ظاهر.</span></li>
        <li><b>مشتبهات:</b> <span>المشكل الذي يشبه الحلال من وجه والحرام من وجه آخر.</span></li>
        <li><b>لا يعلمهن كثير من الناس:</b> <span>لا يعلم حكمها لتنازع الأدلة، فهي تشبه مرة الحلال ومرة الحرام.</span></li>
        <li><b>من اتقى الشبهات:</b> <span>ابتعد عنها وجعل بينه وبينها وقاية.</span></li>
        <li><b>فقد استبرأ:</b> <span>طلب البراءة.</span></li>
        <li><b>لدينه:</b> <span>من النقص، وأشار بذلك إلى ما يتعلق بالله عز وجل.</span></li>
        <li><b>وعرضه:</b> <span>من الطعن وأشار بذلك إلى ما يتعلق بالناس.</span></li>
        <li><b>ومن وقع في الشبهات:</b> <span>أي اجترأ على الوقوع في الأمور المشتبهة.</span></li>
        <li><b>وقع في الحرام:</b> <span>ولهذا تفسيران: إما أن التساهل في امرها يجر للحرام (فالصغيرة تجر الى الكبيرة والكبيرة تجر الى الحرام)، أو أن من وقع في الشبهات أظلم قلبه فيقع في الحرام و لا يشعر.</span></li>
        <li><b>الحمى:</b> <span> المحظور على غير مالكه.</span></li>
        <li><b>محارمه:</b> <span>المعاصي التي حرمها الله وتسمى حمى الله.</span></li>
        <li><b>القلب:</b> <span>هو أشرف الأعضاء. <b>وما سُمي القلب إلا من تقلّبه، فاحذر على القلب من قَلْبٍ وتحويلِ.</b></span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث',
    box1Items: [
    '<b>القلب السليم:</b>  هو عنوان الفوز والنجاة في الآخرة.',
  '<b>الحث على:</b> فعل الحلال واجتناب الحرام، وترك المشتبهات.',
  '<b> اختلف الفقهاء في المشتبهات على ثلاثة أقوال:</b> <br>' +
  '• قالت طائفة: هي حرام لقوله ﷺ "فقد استبرأ لدينه وعرضه". <br>' +
  '• وقالت طائفة: هي حلال لقوله ﷺ "كالراعي يرعى حول الحمى يوشك أن يرتع فيه". <br>' +
  '• وقالت طائفة: لا نقول إنها حلال ولا حرام فهي بين الحلال والحرام، والتوقف عنها من باب الورع.'
    ],
    box2Title: '📌 أهمية الحديث ',
    box2Items: [
    '<b>الأشياء في الشريعة ثلاثة أنواع:</b>',
  '١. حلال واضح لا يخفى حِلّه.',
  '٢. حرام واضح لا تخفى حرمته.',
  '٣. مشتبهات ليست بوضاحة الحل والحرمة ولكن تركها أفضل من باب الورع.'
    ],
    box3Title: '📌 فائدة 1',
    box3Items: [
    '<b> صلاح القلب يتغذى بالحلال فيصفو ويتنور فينعكس ذلك على اعماله الصالحه</b>' ,
  '<b> اذا تغذى القلب على الحرام اصبح مرتع للشيطان </b>'
     ],
    box4Title: '📌 فائدة 2 ',
    box4Items: [
      '<b>صلاح القلب يقوم بخمسة أمور:</b> <br>' +
  '• ١. قراءة القرآن بتدبر.<br>' +
  '• ٢. خلاء البطن.<br>' +
  '• ٣. قيام الليل.<br>' +
  '• ٤. التضرع عند السحر.<br>' +
  '• ٥. مجالسة الصالحين.<br><br>' 
    ],
    metaDescription:'شرح وتدبر الحديث السابع من الأربعين النووية (الدين النصيحة)، مع بيان حكم النصيحة وآدابها وكيف تكون لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم.',
    metaKeywords: 'الدين النصيحة, الحديث السابع, الأربعون النووية, تميم بن أوس الداري, حكم النصيحة, آداب النصيحة, النصيحة لله ولكتابه, شرح الحديث' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
  
  '7': {
    title: 'الحديث السابع',
    name: 'الحديث السابع: [ الدين النصيحة ]',
    hintText: 'من نصح أخاه سراً فقد نصحه، ومن نصحه علناً فقد فضحه.',
    audioUrl: 'audio/hadith/07.mpeg',
 imageUrls: [ 
      '/images/nawawi/hadith7.png'],
  // الشرح والمفردات
// الشرح والمفردات المحدثة بهيكل القوائم المنظمة
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>الدين:</b> <span>الِملَّة وهي دين الإسلام</span></li>
        <li><b>النصيحة:</b> <span>إرادة الخير للمنصوح له، وأصلها في اللغة من التخليص والتنقية، يقال نصحت العسل: خلصته من الشمع / نصح الثوب: خاطه</span></li>
        <li><b>الدين النصيحة:</b> <span>أي عماد الدين وقوامه</span></li>
        <li><b>أئمة المسلمين:</b> <span>الحكام ومن ينوب عنهم، والعلماء والمصلحين</span></li>
        <li><b>عامتهم:</b> <span>هم عامة الناس ممن ليسوا من الأئمة</span></li>
        <li><b>النصيحة لله:</b> <span>أي تنزيه الله عن أي شريك له، وإثبات صفات الجلال والجمال له، وتنزيهه عن النقائص، والإخلاص بعبادته ومحبته (يقول القاضي عياض: المحبة أشد تعبداً من الخوف)</span></li>
        <li><b>لماذا قال الدين النصيحة (هل الدين هو النصيحة فقط؟):</b> <span>من باب التنبيه للأهم، كما في قوله ﷺ "الحج عرفة"</span></li>
        <li><b>النصيحة لكتاب الله تكون بـ:</b> <span>
          ١. الإيمان بجميع الكتب السماوية <br>
          ٢. قراءة القرآن وحفظه، يقول النبي ﷺ: "اقرؤوا القرآن فإنه يأتي يوم القيامة شفيعاً لأصحابه" <br>
          ٣. الإيمان بكل ما فيه من أمور <br>
          ٤. الإيمان بأن هذا القرآن آخر الكتب السماوية <br>
          ٥. ترتيله وتحسين الصوت بقراءته، يقول ﷺ: "ليس منا من لم يتغنَّ بالقرآن" <br>
          ٦. تدبر معانيه والوقوف على أحكامه، يقول الله تعالى: {أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا} <br>
          ٧. تعليم القرآن للأجيال، يقول ﷺ: "خيركم من تعلم القرآن وعلمه" <br>
          ٨. والأهم هو العمل بما جاء به
        </span></li>
        <li><b>النصيحة لرسول الله:</b> <span>وتكون بتصديق رسالته، والإيمان بجميع ما جاء به، وطاعته، ونصرته</span></li>
        <li><b>النصيحة لأئمة المسلمين:</b> <span>تكون بمعاونتهم على الحق، وطاعتهم ما داموا على حق، وأن نحب صلاحهم وندعو لهم بالإصلاح، وتأليف قلوب الناس لطاعتهم</span></li>
        <li><b>النصيحة لعامة المسلمين:</b> <span>بإرشادهم لمصالحهم في الدنيا والآخرة، وستر عوراتهم، وسد خِلاّتهم، وأمرهم بالمعروف ونهيهم عن المنكر، وترك غشيهم وحسدهم</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 حكم و أداب النصيحة ',
    box1Items: [
     'حكم النصيحه: فرض كفايه ، اذا قام بها البعض سقطت عن الباقيين واذا لم يقم بها احد اثموا جميعهم',
  'من اداب النصيحه: ان تكون سراً فمن نصح اخاه سراً فقد نصحه ومن نصحه علناً فقد فضحه'
    ],
    box2Title: '📌 فوائد الحديث ',
    box2Items: [
     '١. النصيحه من اعظم الاعمال',
  '٢. النصيحه فرض كفايه',
  '٣. جواز مراجعه المتعلم عند الالتباس عليه',
  '٤. من قبل النصيحة ← أمِنَ الفضيحه … ومن ابى فلا يلومن الا نفسه',
  '٥. من احب عباد الله الى الله الذين يسعون في الارض بالنصيحه',
  '٦. من وعظ اخاه فيما بينه وبينه فهي نصيحه ومن وعظه على رؤوس الناس فقد وبخه'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الخامس من الأربعين النووية (إبطال المنكرات والبدع) عن أم المؤمنين عائشة. ميزان الأعمال الظاهرة وقاعدة الاتباع في الإسلام.' ,
    metaKeywords: 'الحديث الخامس, إبطال المنكرات والبدع, من أحدث في أمرنا, فهو رد, البدعة, الاتباع, عائشة أم المؤمنين, الأربعون النووية, شرح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '8': {
    title: 'الحديث الثامن',
    name: 'الحديث الثامن: [حرمة المسلم]',
    hintText: 'حرمة دم المسلم وصيانة أمواله.',
    audioUrl: 'audio/hadith/08.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith8-1.png',
       '/images/nawawi/hadith8-2.png'],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>أمرت:</b> <span>الأمر هو من الله لرسوله وأمته داخل معه في هذا الأمر (أمر وجوب).</span></li>
        <li><b>الناس:</b> <span>المشركون وعبدة الأوثان *ونستثني* منهم أهل الكتاب لأنه يؤخذ منهم جزية أو يسلم فإن امتنعوا قاتلوهم على ذلك.</span></li>
        <li><b>يشهدوا:</b> <span>يقروا.</span></li>
        <li><b>يقيموا الصلاة:</b> <span>أن يقيم الصلاة ويؤديها تامة الشروط والأركان.</span></li>
        <li><b>يؤتوا الزكاة:</b> <span>أي دفع الزكاة لمستحقيها.</span></li>
        <li><b>عصموا:</b> <span>حرموا دمائهم ومنعوا أن نعتدي عليها.</span></li>
        <li><b>إلا بحق الإسلام:</b> <span>أي فعل فعلاً يوجب الحد في الإسلام. <b>ورد في الحديث عن النبي ﷺ "لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث الثيب الزاني ، والنفس بالنفس ، والتارك لدينه للمفارق للجماعة".</b></span></li>
        <li><b>وحسابهم على الله تعالى:</b> <span>الأخذ بظاهر العمل وحساب البواطن على الله تعالى.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 لماذا لم يذكر الحج والصيام في الحديث؟ ',
    box1Items: [
       'لاحتمال أن يكون هذا الحديث قبل مشروعية الصيام والحج (الحج السنة التاسعة للهجرة ، الصيام الثانية للهجرة).',
  'أو لأن العبادات إما مالية محضة الزكاة ، أو بدنية محضة الصلاة والصيام ، وإما تجمع بينهما كالحج والجهاد.',
  'أو جاء الحديث لمقاتلة الناس حتى يعلنوا ما يمكن إعلانه ، أما ما خفي فحسابه على الله ، فالصلاة والزكاة يمكن أن تعلن ويراها الناس ، أما الصيام والحج فيمكن عدم إعلانهما ، فيصوم خفية ، والحج من استطاع إليه سبيلاً.'
    ],
    box2Title: '📌فوائد الحديث',
    box2Items: [
     '• ١. وجوب قتال عبدة الأوثان حتى يسلموا فينطقوا الشهادتين ويقيموا الصلاة ويؤتوا الزكاة.',
  '• ٢. حرمة دم المسلم وصيانة أمواله.',
  '• ٣. حساب السرائر على الله فقط.'
    ],
    box3Title: '📌 فائدة',
    box3Items: [  '<b>تارك الصلاة عمداً ومعتقداً وجوبها ← يُقتل.</b>',
  '<b>أما تارك الزكاة ← يؤخذ منه المال قهراً.</b>'],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثامن من الأربعين النووية (حرمة المسلم)، مع بيان أحكام الصلاة والزكاة وعصمة دماء وأموال المسلمين وحساب السرائر.' ,
    metaKeywords: 'حرمة المسلم, الحديث الثامن, الأربعون النووية, ابن عمر, عصموا دماءهم, أقم الصلاة, آتوا الزكاة, شرح الحديث, الأربعين النووية',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '9': {
    title: 'الحديث التاسع',
    name: 'الحديث التاسع: [الأخذ بِالتيسير وترك التعسير]',
    hintText:'اجعل بينك وبين الحرام وقاية واتقِ الشبهات ليَسْلَم دينك وعِرضك',
    audioUrl: 'audio/hadith/09.mpeg',
   imageUrls: [ 
      '/images/nawawi/hadith9.png'],
// الشرح والمفردات التي تظهر عند الضغط على زر الشرح للحديث التاسع
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>مَا نَهَيْتُكُمْ عَنْهُ:</b> <span>طلبت منكم الكف عن فعله.</span></li>
        <li><b>فَاجْتَنِبُوهُ:</b> <span>اتركوه وابتعدوا عنه، لا تقربوه أبداً، والاجتناب أوسع من الترك.</span></li>
        
        <li class="rule-item" style="list-style-type: none; margin: 10px 0; padding: 8px; background-color: #fdf5f5; border-right: 3px solid #b81d24;">
          <b>قاعدة فقهية:</b> <span>قد يضطر الإنسان لفعل المنهي وذلك حسب الضرورة مثل أكل لحم الميتة بقدر ما يقيم صلبه إن خاف على نفسه الهلاك وغير ذلك لذلك وضع العلماء قاعدة فقهية تقول: <b>"الضرورات تبيح المحظورات"</b>.</span>
        </li>

        <li><b>وَمَا أَمَرْتُكُمْ بِهِ:</b> <span>طلبت منكم فعله، الأمر هنا معناه الطلب.</span></li>
        <li><b>فَأْتُوا مِنْهُ:</b> <span>فافعلوا منه.</span></li>
        <li><b>مَا اسْتَطَعْتُمْ:</b> <span>بقدر الاستطاعة، وتدخل في هذه القاعدة ما لا يحصى من الأحكام، مثل الصلاة إن عجز عن بعض أركانها أو بعض شروطها أتى بالباقي.</span></li>
        
        <li class="rule-item" style="list-style-type: none; margin: 10px 0; padding: 8px; background-color: #f5f8f6; border-right: 3px solid #1c3d27;">
          <b>قاعدة فقهية:</b> <span>ومن هنا جاءت القاعدة الفقهية <b>"الميسور لا يسقط بالمعسور"</b> فالمصلي إن عجز عن الصلاة قائماً صلاها قاعداً ولا تسقط عنه بسبب عجزه عن الوقوف.</span>
        </li>

        <li><b>أَهْلَكَ:</b> <span>كان سبباً في هلاكهم / أوجب عليهم عقوبة الدنيا والآخرة.</span></li>
        <li><b>اخْتِلَافُهُمْ عَلَىٰ أَنْبِيَائِهِمْ:</b> <span>عصيانهم ومجادلتهم لأنبيائهم.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌نبذة عن راوي الحديث',
    box1Items: [
  '<b>اسمه:</b> أبو هريرة عبد الرحمن بن صخر رضي الله عنه.',
  '<b>اسمه في الجاهلية:</b> كان يسمى (عبد شمس) فسماه النبي ﷺ عند إسلامه عبد الرحمن.',
  '<b>كنيته:</b> كان يكنى بأبي هريرة نسبة إلى هرة برية كان يعتني بها واشتهر بكنيته هذه.',
  '<b>إسلامه:</b> أسلم في السنة السابعة للهجرة حيث كان النبي ﷺ في خيبر فلحقه وبقي معه ولازمه كل تلك الفترة.',
  '<b>دعاء النبي له:</b> دعا له النبي ﷺ "اللهم حبب أبا هريرة وأمه للناس"، فكان يقول: "إن من رآني أو سمع بي أحبني".',
  '<b>ملازمته للرسول:</b> يقول صحبت النبي ﷺ على شبع في بطني، أي الشيء القليل الذي يقيم صلبه، من أجل أن ينهل من النبي ﷺ الأحاديث.',
  '<b>روايته للحديث:</b> لازم النبي ﷺ ثلاث سنوات وروى عنه 5374 حديثاً فكان ذلك سبباً في توجيه الانتقاد له لقلة فترة صحبته وكثرة أحاديثه.',
  '<b>قيام الليل:</b> كان يتناوب هو وزوجته وغلامه في قيام الليل.',
  '<b>لقبه:</b> كان يلقب بـ ذاكرة عصر النبوة.',
  '<b>ولايته:</b> ولي على البحرين في إمارة عمر ثم ولي إمارة المدينة عهد معاوية.',
  '<b>وفاته:</b> مات في المدينة سنة 59 هجري وكان عمره 80 سنة.',
  '<b>عبادته:</b> كان يستغفر كل يوم 12000 مرة.'
    ],
    box2Title: '📌سبب ورود الحديث',
    box2Items: [
        '• عن أبي هريرة رضي الله عنه قال خطبنا رسول الله ﷺ فقال: <b>"يا أيها الناس قد فرض الله عليكم الحج فحجوا"</b> فقال رجل: أكل عام يا رسول الله فسكت حتى قالها ثلاثاً فقال رسول الله: <b>"لو قلت نعم لوجبت ولما استطعتم"</b>.<br>' +
  '• وقيل أن السائل هو الأقرع بن حابس رضي الله عنه.'
    ],
    box3Title: '📌 فوائد الحديث ',
    box3Items: [  '<b>يجب على المسلم تجنب ما نهي عنه بشكل جذري، والإتيان بما أمر به على قدر استطاعته.</b>',
  '<b>ترك السؤال عند شيء لم يقع... خشية أن ينزل وجوب في فعله أو تحريم.</b>',
  '<b>تحريم الاختلاف وكثرة المسائل من غير ضرورة لأنها توعد بالهلاك وتفرق القلوب وتوهن الدين.</b>'],
    box4Title: '📌 فائدة: أنواع السؤال',
    box4Items: [ '<b>السؤال له أنواع:</b><br><br>' +
  '<b>١. سؤال مطلوب شرعاً وهو على درجات:</b><br>' +
  '• ✓ <b>فرض عين:</b> السؤال عما يجهله من أمور الدين.<br>' +
  '• ✓ <b>فرض كفاية:</b> السؤال للتوسع في الفقه ومعرفة أحكام الشرع.<br>' +
  '• ✓ <b>مندوب:</b> مثل السؤال عن أعمال البر والقربات.<br><br>' +
  '<b>٢. سؤال منهي عنه وهو على درجات:</b><br>' +
  '• ✓ <b>حرام:</b> مثل السؤال عما أخفاه الله تعالى كوقت الساعة، وحقيقة الروح، والسؤال عن وجه العبث، وسؤال المعجزات.<br>' +
  '• ✓ <b>مكروه:</b> السؤال عما لا يحتاج إليه مثل السؤال عما سكت عنه الشرع من الحلال والحرام.<br><br>' +
  '<b>٣. مباح:</b> فيما عدا الأنواع السابقة من الأسئلة.'],
    metaDescription: 'شرح وتدبر الحديث التاسع من الأربعين النووية (الأخذ بالتيسير وترك التعسير)، مع بيان سيرة الراوي أبي هريرة والقواعد الفقهية كالضرورات تبيح المحظورات.',
    metaKeywords:  'الأخذ بالتيسير, ترك التعسير, الحديث التاسع, الأربعون النووية, أبو هريرة, الضرورات تبيح المحظورات, الميسور لا يسقط بالمعسور, كثرة المسائل, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '10': {
    title: 'الحديث العاشر',
    name: 'الحديث العاشر: [الحلال الطيب شرط القبول]',
    hintText: 'إن الله طيب لا يقبل إلا طيباً، فأطب مطعمك وملبسك لتستجاب دعوتك ويُقبل عملك.',
    audioUrl: 'audio/hadith/10.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith10-1.png',
       '/images/nawawi/hadith10-2.png'],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>طَيِّبٌ:</b> <span>منزه عن النقائص.</span></li>
        <li><b>لَا يَقْبَلُ إِلَّا طَيِّباً:</b> <span>لا يقبل من الأعمال والأموال والأقوال إلا من كان خالصاً من المفسدة أو حلالاً.</span></li>
        <li><b>أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ:</b> <span>سوى بينهم في الخطاب بوجوب أكل الحلال.</span></li>
        <li><b>يُطِيلُ السَّفَرَ:</b> <span>في الجهاد والطاعات.</span></li>
        <li><b>أَشْعَثَ:</b> <span>المتجعد والمتلبد الشعر.</span></li>
        <li><b>أَغْبَرَ:</b> <span>يعتلي رأسه غبار السفر.</span></li>
        <li><b>يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ:</b> <span>رافعاً يديه إلى السماء.</span></li>
        <li><b>غُذِيَ بِالْحَرَامِ:</b> <span>أي غذاه غيره، أي في حال طفولته نشأ على الحرام بين أبويه.</span></li>
        <li><b>فَأَنَّىٰ يُسْتَجَابُ لِذَٰلِكَ:</b> <span>تعجب كيف ومن أين يستجاب لمن كانت هذه صفته، ولو أن الله استجاب له تكون الاستجابة تفضيلاً.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 شروط قبول الدعاء',
    box1Items: [
     '<b>ذكر النبي ﷺ في الحديث عدة أمور تدل على استجابة الدعاء لو أن كسبه كان حلالاً منها: </b><br>' +
  '• ١. إطالة السفر بوجوه الخير.<br>' +
  '• ٢. حصول التبذل في اللباس والهيئة).<br>' +
  '• ٣. رفع اليدين إلى السماء.<br>' +
  '• ٤. تكرار مناجاة الله تعالى بالربوبية والإلحاح بالدعاء.<br>' +
  '• ٥. الكسب الحلال.',

  '<b>إستثناء دعوة المظلوم:</b><br>' +
  '✓ يستثنى من هذا الحديث المظلوم، فالمظلوم لا ترد دعوته ولو كان ماله حراماً ولو كان كافراً، فقد ورد في الأثر: <i>"إني لأنصر المظلوم ولو كان كافراً، علم أن له رباً فدعاه"</i>.',

  '<b>الفرق في الخطاب القرآني:</b><br>' +
  '• <b>الرسل:</b> خاطبهم الله بقوله <i>{كُلُوا مِنَ الطَّيِّبَاتِ}</i> لأنهم يعرفون الحلال الطيب دون تذكير.<br>' +
  '• <b>المؤمنون:</b> خاطبهم بقوله <i>{كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ}</i> من باب تذكيرهم الدائم بتحري الحلال وأنه من عند الله.'
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
  '<b>الحلال هو شرط القبول عند الله تعالى.</b>',
  '<b>من آداب الدعاء: رفع اليدين والتكرار.</b>',
  '<b> الإنفاق من الحلال، والنهي عن الإنفاق من الحرام.</b>',
  '<b>استواء الأنبياء مع أممهم في الأحكام الشرعية.</b>',
  '<b>الأكل الحلال يعين صاحبه على العبادة، ويؤدي إلى قبول الله للعمل والدعاء.</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث العاشر من الأربعين النووية، مع بيان مفردات الحديث وشروط قبول الدعاء، وأثر كسب الحلال على استجابة المناجاة وفضل تحري الطيب.',
    metaKeywords:  'الحديث العاشر, الأربعون النووية, إن الله طيب, كسب الحلال, شروط قبول الدعاء, أكل الطيبات, أداب الدعاء, شرح الحديث العاشر',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '11': {
    title: 'الحديث الحادي عشر',
    name: 'الحديث الحادي عشر: [الأخذ باليقين والبعد عن الشبهات]',
    hintText: 'دع الشك وخذ اليقين، فالحق طمأنينة والباطل ريبة وقلق.',
    audioUrl: 'audio/hadith/11.mpeg',
      imageUrls: [ 
      '/images/nawawi/hadith11.png'],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>سِبْطِ:</b> <span>ولد البنت، وقيل سبط رسول الله: أي قطعة منه دلالة على شدة حب النبي له وللحسين.</span></li>
        <li><b>رَيْحَانَتِهِ:</b> <span>إما على سبيل الاستعارة: كان النبي يسر برؤيته ويرتاح كما يرتاح الإنسان عندما يشم الريحان، أو على سبيل الحقيقة: يجد منه الريح الطيب ويرتاح إليه.</span></li>
        <li><b>حَفِظْتُ مِنْ رَسُولِ اللَّهِ:</b> <span>دلالة على أنه كان صغيراً عندما سمع من النبي هذا الحديث.</span></li>
        <li><b>دَعْ:</b> <span>اترك، والأمر هنا على سبيل الندب، وفي هذا الحديث ارتباط مع الحديث الذي سبقه وكأنه يقول: لا يتم اجتناب الحرام ولا يتم اكتمال الحلال إلا بترك ما فيه ريبة.</span></li>
        <li><b>مَا يَرِيبُكَ:</b> <span>(ما بمعنى الذي) أي اترك الذي يريبك وتشك في حلاله.</span></li>
        <li><b>الرِّيبَةُ:</b> <span>هي الشك واللبس.</span></li>
        <li><b>إِلَىٰ مَا لَا يَرِيبُكَ:</b> <span>إلى ما لا تشك فيه من الحلال البين.</span></li>
        
        <li class="rule-item" style="list-style-type: none; margin: 10px 0; padding: 8px; background-color: #f5f8f6; border-right: 3px solid #1c3d27;">
          <b>المعنى العام للحديث:</b> <span>اترك الأشياء التي تشك فيها وخذ الأشياء التي لا تشك فيها، أي دع الشك وخذ اليقين.</span>
        </li>
      </ul>
    </div>
  `,
    box1Title: '📌  نبذة عن راوي الحديث',
    box1Items: [
    '<b>اسم الراوي ونسبه:</b> أبي محمد الحسن بن علي بن أبي طالب رضي الله عنه.',
  '<b>والداه:</b> والدته فاطمة رضي الله عنها ابنة النبي، ووالده علي بن أبي طالب رضي الله عنه ابن عم النبي.',
  '<b>مولده وعمره:</b> ولد في السنة الثالثة للهجرة فكان عمره سبع سنوات عندما توفي النبي ﷺ.',
  '<b>صفته الخَلقية والخُلقية:</b> كان أشبه الناس بالنبي، وسيماً جميلاً يضرب شعره منكبيه، أبيضاً مشرباً بالحمرة، أدعج العينين (أي شديد بياض العين وشديد سواد بؤبؤ العين)، سهل الخدين، دقيق المسربة، ربعة، جعد الشعر، وكان يختتم بيساريه (يلبس الخاتم بيساره)، كما كان كريماً حليماً.',
  '<b>رضاعه:</b> أرضعته أم الفضل زوجة العباس عم النبي ﷺ.',
  '<b>تسميته وعقيقته:</b> حنّكه النبي ﷺ وأذّن في أذنيه وذبح كبشاً كعقيقة عنه، وكان علي يريد أن يسميه حرباً فسماه النبي بالحسن، وفي اليوم السابع لولادته حلقت أمه فاطمة شعره وتصدقت بوزنه فضة على المساكين وأهل الصفة.',
  '<b>حب النبي له:</b> كان النبي ﷺ يحبه حباً شديداً فكان يحمله ويقول: "اللهم إني أحبه فأحبه".',
  '<b>سيادته وإصلاحه:</b> قال فيه النبي ﷺ: "إن ابني هذا سيد وعسى الله أن يصلح به بين فئتين من المسلمين".',
  '<b>خلافته وتنازله:</b> بويع بعد أبيه بالخلافة ودامت خلافته ستة أشهر، ثم تنازل عن الخلافة لمعاوية حقناً لدماء المسلمين.',
  '<b>وفاته:</b> توفي سنة 50 للهجرة مسموماً.'
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
    '<b>إذا تعارض الشك باليقين نأخذ باليقين.</b>',
  '<b> نبني أحكامنا وأمور حياتنا على اليقين.</b>',
  '<b> الإسلام حق واضح لا يقبل الشك والريبة .</b>',
    ],
    box3Title: '📌 فائدة',
    box3Items: [
'<b>قاعدة:</b><br>' +
  '• الحلال والحق والصدق ← طمأنينة ورضا.<br>' +
  '• الحرام والباطل والكذب ← ريبة وقلق.'],
    box4Title: '',
    box4Items: [],
    metaDescription:'شرح وتدبر الحديث الحادي عشر من الأربعين النووية، مع نبذة شاملة عن سبط رسول الله الحسن بن علي، وبيان قاعدة بناء الحياة على اليقين وترك الشك.' ,
    metaKeywords:  'الحديث الحادي عشر, الأربعون النووية, دع ما يريبك, الحسن بن علي, الأخذ باليقين, ترك الشبهات, ريحانة رسول الله, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '12': {
    title: 'الحديث الثاني عشر',
    name: 'الحديث الثاني عشر: [الإشتغال بما يفيد]',
    hintText: 'من كمال إيمان المرء وتمام إسلامه أن يترك ما لا مصلحة له فيه ولا يعنيه.',
    audioUrl: 'audio/hadith/012.mpeg',
       imageUrls: [ 
      '/images/nawawi/hadith12.png'],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>حُسْنِ إِسْلَامِهِ:</b> <span>من كمال إسلامه وتمامه</span></li>
        <li><b>الْمَرْءِ:</b> <span>الإنسان، ذكراً كان أم أنثى.</span></li>
        <li><b>تَرْكُهُ:</b> <span>الترك هو الكف والامتناع عن فعل الشيء.</span></li>
        <li><b>مَا لَا يَعْنِيهِ:</b> <span>ما لا تتعلق عنايته ولا مصلحته به.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث ',
    box1Items: [
  '<b>الاشتغال بما يفيد و ترك مالا يفيد.</b>',
  '<b>تأديب النفس وتهذيبها من الرذائل والنقائص.</b>',
  '<b>على الإنسان الإشتغال بما فيه صلاحه معاشاً ومعاداً.</b>'
    ],
    box2Title: '📌 فائدة',
    box2Items: [
       '<b>من حكم لقمان:</b><br>' +
  'قيل للقمان: ما بلغ بك ما نرى؟ يريدون الفضل. فقال: <i>"صدق الحديث، وأداء الأمانة، وترك ما لا يعنيني"</i>.',

  '<b>من مواعظ الحسن:</b><br>' +
  ' <i>"من علامة إعراض الله تعالى عن العبد أن يجعل شغله فيما لا يعنيه"</i>.',

  '<b>جماع آداب الخير في أربع أحاديث:</b><br>' +
  '• ١. حديث: <i>"من كان يؤمن بالله واليوم الآخر"</i>.<br>' +
  '• ٢. حديث: <i>"من حسن إسلام المرء"</i>.<br>' +
  '• ٣. حديث: <i>"لا تغضب"</i>.<br>' +
  '• ٤. حديث: <i>"لا يؤمن أحدكم"</i>.'

    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني عشر من الأربعين النووية، مع تفسير المفردات وبيان حكم لقمان الحكيم والحسن البصري في ترك الفضول والاشتغال بما ينفع.',
    metaKeywords:  'الحديث الثاني عشر, الأربعون النووية, من حسن إسلام المرء, ترك ما لا يعنيه, الاشتغال بما يفيد, جوامع الكلم, آداب الخير, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '13': {
    title: 'الحديث الثالث عشر',
    name: 'الحديث الثالث عشر: [أخوة الإِيمان والإِسلام]',
    hintText: 'الحديث ظاهره التساوي ولكن حقيقته التفاضل ، فاذا احب لاخيه مثله فقد دخل هو في جمله المفضولين.',
    audioUrl: 'audio/hadith/13.mpeg',
       imageUrls: [ 
      '/images/nawawi/hadith13.png'],
  
  // الشرح والمفردات
  explanation: ` 
  <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لا يؤمن:</b> <span>الايمان الكامل.</span></li>
        <li><b>احدكم:</b> <span>كل من يدعى الايمان والاسلام منكم.</span></li>
        <li><b>يحب لاخيه:</b> <span>من الطاعات والاشياء المباحة.</span></li>
        <li><b>اخيه:</b> <span>اخوه في الاسلام او اخوه في الانسانيه.</span></li>
        <li><b>ما يحب لنفسه:</b> <span>مثل الذي يحبه لنفسه من الخير.</span></li>
      </ul>
      <p class="explanation-note" style="margin-top: 15px; line-height: 1.6; text-align: right;">
        الحديث ظاهره التساوي ولكن حقيقته التفاضل ، فاذا احب لاخيه مثله فقد دخل هو في جمله المفضولين.
      </p>
    </div>
  `,
    box1Title: '📌 نبذة عن راوي الحديث',
    box1Items: [
    '✓ <b>الراوي:</b> ابي حمزه انس بن مالك رضي الله عنه ، والده مالك بن النظر مات كافرا ، وامه ام سليم بنت ملحان.',
  '✓ انصاري خزرجي ، يلتقي نسبه من النبي ﷺ في اخواله من بني النجار.',
  '✓ اتت به امه الى النبي ﷺ حتى يخدمه ، فخدم النبي ﷺ 10 سنوات ، وكان عمره عندما هاجر النبي ﷺ الى المدينه 10 سنوات.',
  '✓ دعا له النبي ﷺ( اللهم اكثر ماله وولده وبارك له فيما اعطيته) وكان عنده 80 صبي وابنتان واحفاده 120.',
  '✓ كان من مكثري الروايه عن النبي ﷺ حيث ياتي بالمرتبه الثالثه بعد ابي هريره وابن عمر ، روى عن النبي ﷺ 2286 حديث.',
  '✓ اصيب بالبرص في نهايه حياته ، ومر بمحنه مع الحجاج حيث ختمه الحجاج في عنقه "عتيق الحجاج".',
  '✓ اخر الصحابه وفاه في البصره ، حيث توفي وعمره 103 سنوات في خلافه الوليد بن عبد الملك ، سنه 90 هجري.',
  '✓ ما رايت احدا اشبه في صلاه رسول الله ﷺ من ابن ام سليم.'
    ],
    box2Title: '📌  فوائد الحديث ',
    box2Items: [
  '١. ان يجتهد المسلم في اصلاح اخيه المسلم',
  '٢. محبه الخير للناس',
  '٣. الايمان يزيد وينقص ، ومحبه الخير للناس من شعب الايمان',
  '٤. المؤمن للمؤمن كالنفسى الواحده (مَثَلُ المؤمنين في توادِّهم وتراحمهم وتعاطفهم كمثل الجسد الواحد؛ إذا اشتكى منه عضوٌ تداعى له سائر الجسد بالسهر والحمّى)',
  '٥. من الايمان ان يبغض لاخيه ما يبغض لنفسه من الشر.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني عشر من الأربعين النووية، مع تفسير المفردات وبيان حكم لقمان الحكيم والحسن البصري في ترك الفضول والاشتغال بما ينفع.',
    metaKeywords: 'الحديث الثاني عشر, الأربعون النووية, من حسن إسلام المرء, ترك ما لا يعنيه, الاشتغال بما يفيد, جوامع الكلم, آداب الخير, شرح الحديث',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '14': {
    title: 'الحديث الرابع عشر',
    name: 'الحديث الرابع عشر: [حرمة دم المسلم]',
    hintText: 'حرمه دم المسلم على المسلم.',
    audioUrl: 'audio/hadith/14.mpeg',
        imageUrls: [ 
      '/images/nawawi/hadith14.png'],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لا يحل دم:</b> <span>اي لا تحل اراقته والمراد: القتل.</span></li>
        <li><b>امرئ:</b> <span>ذكر او انثى.</span></li>
        <li><b>مسلم:</b> <span>من حقق اركان الاسلام.</span></li>
        <li><b>يشهد:</b> <span>يقر ويعترف ان لا معبود بحق الا الله عز وجل.</span></li>
        <li><b>باحدى ثلاث:</b> <span>اي يحل قتله اذا فعل احدى هذه الثلاث.</span></li>
        <li><b>الثيب الزاني:</b> <span>المتزوج او المحصن ، كلمه الثيب تطلق على الذكر والانثى ، وقد اجمع الفقهاء على ان عقوبه الزاني المحصن الرجم حتى الموت.</span></li>
        <li><b>الزنا:</b> <span>ان يطأ رجل امراه حية في قبلها من غير عقد شرعي.</span></li>
        <li><b>النفس بالنفس:</b> <span>من قتل نفسا عمدا وبغير حق ، ويعني به النفوس المتكافئه في الاسلام والحريه ، لقوله ﷺ "لا يقتل مسلم بكافر".</span></li>
        <li><b>التارك لدينه:</b> <span>المراد بالدين: الإسلام ،والمقصود به: المرتد.</span></li>
        <li><b>المفارق للجماعه:</b> <span>تارك لجماعه المسلمين بالردة.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌  فوائد الحديث',
    box1Items: [
   '• <b>١. حرمه دم المسلم على المسلم.</b>',
  '• <b>٢. تحريم فعل احدى هذه الخصال وعظم وزرها حتى استحق فاعلها عقوبه القتل.</b>',
  '• <b>٣. وجوب حفظ الاعراض ونقائها لذلك شرع النكاح .</b>',
  '• <b>٤. الحث على التزام جماعه المسلمين وعدم مفارقتهم.</b>',
  '• <b>٥. الترهيب من قتل النفس التي حرم الله.</b>'
    ],
    box2Title: '📌 مقارنة',
    box2Items: [
    '• <b>استدل هذا الحديث ان تارك الصلاه لا يقتل بينما حديث (حرمه المسلم) تارك الصلاه يقتل.</b>',
  '• <b>فقال ابن الجوزيه ان الذي يترك الصلاه جحودا وكفرا ← كافر لتركه الصلاة.... قالصلاة ركن من اركان الدين (فمن تركها ترك دينه بالكليه).</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الرابع عشر عن ابن مسعود (لا يحل دم امرئ مسلم)، وبيان الأحوال الثلاثة التي يحل بها القتل: الثيب الزاني، النفس بالنفس، والتارك لدينه المفارق للجماعة، مع مناقشة حكم تارك الصلاة عند ابن الجوزية.',
    metaKeywords: 'الحديث الرابع عشر, لا يحل دم امرئ مسلم, ابن مسعود, الثيب الزاني, النفس بالنفس, التارك لدينه, المفارق للجماعة, عقوبة الزاني المحصن, حكم تارك الصلاة, ابن الجوزية, شروح الأربعين النووية',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '15': {
    title: 'الحديث الخامس عشر',
    name: 'الحديث الخامس عشر: [من خصال الإِيمان]',
    hintText:'ليس اكرام الضيف بطيب الطعام ، بل بطيب النفس ، وبشاشه الوجه.',
    audioUrl: 'audio/hadith/15.mpeg',
    
     imageUrls: [ 
      '/images/nawawi/hadith15-1.png',
       '/images/nawawi/hadith15-2.png'],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>من كان يؤمن:</b> <span>الايمان الكامل.</span></li>
        <li><b>من كان يؤمن بالله واليوم الاخر:</b> <span>قاعده الانطلاق في العمل الاسلامي من فعل او ترك ، فمنطلق اي عمل هو الايمان بالله واليوم الاخر.</span></li>
        <li><b>اليوم الاخر:</b> <span>يوم القيامه يوم الجزاء والحساب.</span></li>
        <li><b>فليقل خيرا:</b> <span>يتكلم بامور الخير ومنها:
        <br>١. التبليغ عن الله ورسوله 
        <br>٢. الامر بالمعروف والنهي عن المنكر.
        <br>٣. كلمه حق عند سلطان جائر</span></li>
        <li><b>او ليصمت:</b> <span>يسكت.</span></li>
        <li><b>فليقل خيرا او ليصمت:</b> <span>يدل على ان قول الخير خير من الصمت ، والصمت خير من قول الشر.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌أنواع الجار وحقوقه',
    box1Items: [
   '• <b>لجار ثلاثه انواع:</b><br>١. الجار القريب: من ذوي القربى وله ثلاثه حقوق: حق القرابه _ وحق الجوار _ وحق الاسلام.<br>٢. الجار غير القريب: وله حق الجوار والاسلام. <br>٣. الجار غير المسلم: وله حق الجوار.',
  '• <b>قال ﷺ "ما زال جبريل يوصيني بالجار حتى ظننت انه سيورثه".</b>',
  '• <b>اختلف الفقهاء في اكرام الضيف ، منهم من قال واجب ، ومنهم من قال مستحب.</b>',
  '• <b>من اكرام الضيف:</b><br>١. البشاشه في وجهه <br>٢. طيب الحديث معه <br>٣. اطعام الطعام'
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
   '• <b>١. منطلق جميع الاعمال هو الايمان بالله واليوم الاخر.</b>',
  '• <b>٢. الحث على قول الخير ،  واكرام الضيف ، واكرام الجار.</b>',
  '• <b>٣. على المرء التأني والتفكير قبل التكلم.</b>',
  '• <b>٤. ليس اكرام الضيف بطيب الطعام ، بل بطيب النفس ، وبشاشه الوجه.</b>',
  '• <b>٥. يجب الامر بالمعروف عن علم ، وانكار المنكر عن علم.</b>'
    ],
    box3Title: '📌 تعقيبات',
    box3Items: [
  '• <b>١. لا تكونوا اصحاب فتن.</b>',
  '• <b>٢. من عد كلامه من عمله ← قل كلامه فيما لا يعنيه.</b>',
  '• <b>٣. من آمن بالله الايمان الحق وخاف وعيده ضبط جوارحه وفي مقدمتها اللسان.</b>'
    ],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الخامس عشر (من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت)، وبيان حقوق الجار الثلاثة، وآداب إكرام الضيف، وأثر الإيمان في توجيه السلوك.',
    metaKeywords: 'الحديث الخامس عشر, من خصال الإيمان, فليقل خيراً أو ليصمت, إكرام الجار, إكرام الضيف, حقوق الجار, آداب الضيافة, حفظ اللسان, شروح الأربعين النووية',
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  }
  ,
  
  '16': {
    title: 'الحديث السادس عشر',
    name: 'الحديث السادس عشر: [النهي عن الغضب]',
    hintText: 'دع الشك وخذ اليقين، فالحق طمأنينة والباطل ريبة وقلق.',
    audioUrl: 'audio/hadith/16.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith16.png'],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
        <li><b>ان رجلا:</b> <span>قيل هو ابو الدرداء ، وقيل جارية بن قدامة ، وقيل ربما تكررت الحادثه وتعدد السائل.</span></li>
        <li><b>اوصني:</b> <span>دلني على عمل ينفعني ، وفيه دليل على حرص الصحابه على خيري الدنيا والاخره.</span></li>
        <li><b>لا تغضب:</b> <span>الغضب: هو ثوران في النفس يحملها على الرغبه في البطش والانتقام.</span></li>
        <li><b>معنى لا تغضب:</b> <span>اي اجتنب اسباب الغضب ولا تعمل بمقتضى الغضب.</span></li>
        <li><b>ردد مرارا:</b> <span>كرر طلبه للوصيه.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 أنواع الناس والغضب',
    box1Items: [
      '• <b>للناس ثلاثه انواع:</b><br>١. سريع الغطب سريع الفيء.<br>٢. سريع الغضب بطيء الفيء "هذا شر الناس".<br>٣. بطيء الغضب سريع الفيء "وهو افضلهم".',
  '• <b>للغضب ثلاثه انواع:</b><br>١. الاخضر: ان يغضب بما فيه انتهاك لحرمات الله (محمود).<br>٢. الاحمر: ان يغضب على الامور التوافه التي تثير الانسان ولكنه في حدود التمكن. <br>٣. الاسود: يعمي البصر والبصيره (مذموم).'
    ],
    box2Title: '📌 كيفيه معالجه الغضب',
    box2Items: [
      '• <b>١. التعوذ من الشيطان</b>',
  '• <b>٢. الوضوء</b>',
  '• <b>٣. تغيير جلسته</b>',
  '• <b>٤. يدرب نفسه على ضبط النفس</b>',
  '• <b>٥. ترك الكلام عند الغضب</b>'
    ],
    box3Title: '📌 فوائد الحديث',
    box3Items: [
    '• <b>١. حرص المسلم على ما ينفعه في دينه ودنياه.</b>',
  '• <b>٢. الغضب جماع الشر ، والتحرير منه جماعه الخير.</b>',
  '• <b>٣. ينبغي على المسلم ان يعين نفسه على ترك الغضب (من كظم غيظا وهو قادر على ان ينفذه دعاه الله على رؤوس الخلائق حتى يخيره من الحور العين ما شاء).</b>',
  '• <b>٤. الغضب مذموم في امور الدنيا.</b>',
  '• <b>٥. الغضب ممدوح ما كان لله ولنصرة دينه.</b>'
    ],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث السادس عشر (لا تغضب)، وبيان أنواع الغضب الثلاثة (الأخضر والأحمر والأسود)، وطرق علاج الغضب كالتعوذ والوضوء وكظم الغيظ.',
    metaKeywords: 'الحديث السادس عشر, النهي عن الغضب, لا تغضب, علاج الغضب, كظم الغيظ, أنواع الغضب, ضبط النفس, شروح الأربعين النووية' ,
    quizQuestions: { /* كائن الكويز الخاص بالحديث الثاني */ }
  },
 
  '17': {
    title:'الحديث السابع عشر',
    name: 'الحديث السابع عشر [عموم الإحسان]',
    hintText: '',
    audioUrl: 'audio/hadith/17.mpeg',
       imageUrls: [ 
      '/images/nawawi/hadith17.png'],
   explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
        <li><b>كتب:</b> <span> طلب وأوجب.</span></li>
        <li><b>الإحسان:</b> <span> إتقان العمل. </span></li>
        <li><b>على كل شيء:</b> <span> لا يخرج منها اي شيء. </span></li>
        <li><b>فإذا قتلتم: </b> <span> عام في القتل من الذبائح ، والقتل قصاصاً ، او في حد ونحو ذلك.</span> <br> <p> والقتل المباح يكون إما بالجهاد المشروع ، او قصاصاً ، او حد من حدود الله.</p> </li>
        <li><b>فاحسنوا القتلة: </b> <span> الهيئة والحالة كالجلسة.</span></li>
        <li><b> واذا ذبحتم:</b> <span> الذبح يكون للشياه والدجاج ومأكول اللحم.</span></li>
        <li><b> ليحدَّ:</b> <span> من احدَّ السكين ، وحدّها واستحدها.</span></li>
        <li><b> شفرته:</b> <span> السكين وما يذبح بها ، وشفرتها: حدّها.</span></li>
        <li><b> يرح ذبيحته:</b> <span> اي يرفق بها حينما يضجعها ، وان كان تحتها من الاحجار او من الاشجار والاشواك يجب ان يزيلها ويضجعها مستريحة.</span></li>
      </ul>
    </div>
  `,
  box1Title: '📌 نبذة عن راوي الحديث',
    box1Items: [
        '• <b>  ابي يعلى شداد بن أوس رضي الله عنه. </b> <br>      ١. والده اوس بن ثابت ، ابن اخ حسان بن ثابت شاعر النبي. <br> ٢. انصاري خزرجي ، تولى ولاية حمص في عهد عمر بن الخطاب رضي الله عنه. <br> ٣. نزل الشام.  <br> ٤. فصيحاً ، كثير الورع. <br> ٥. كثير الخوف من الله. <br> ٦. اذا دخل فراشه تقلب ولم ينم فيقول: "اللهم إن النار اذهبت مني النوم فيقوم فيتوضأ ويصلي حتى يصبح". <br> ٧. توفي بفلسطين سنة 64 هجري وعمره 75 سنه. '
    
    ],


    box2Title: '📌 من الإحسان في الذبح:',
    box2Items: [
      '• <b> ١. ألا يذبحها أمام أمها وأولادها.</b>',
      '• <b> ٢. ان يرفق بالبهيمة ولا يصرعها بغتة.</b>',
      '• <b> ٣. ان يعرض الماء على الذبيحة قبل ذبحها.</b>',
      '• <b>٤. ان يقودها الى الذبح قوداً رفيقاً. </b>',
      '• <b> ٥. يواري السكين عنها ولا يظهر السكين إلا عند الذبح.</b>',
      '• <b> ٦. ورد في الاثر "أن الشاة تعرف الموت ، ولكنها تؤمن بالله وتبصر".</b>',
    ],

    box3Title: '📌 فوائد الحديث',
    box3Items: [
      '• <b> ١. الاحسان تاره يكون واجب ← كالاحسان للوالدين ، مندوب ← كالصدقه، فيكون الاحسان بالامور الظاهرة والباطنة. </b>',
      '• <b> ٢. استحباب الاحسان والرفق في الامور كلها. </b>',
      '• <b>٣. رحمة الاسلام للمخلوقات من انسان وحيوان ونبات. </b>',
      '• <b> ٤. الاحسان يشمل حتى القتل والحدود والقصاص. </b>',
      '<b>📌 اضاءه من خطبه:  </b>  ',
       ' <b> أيها الناسُ, إنَّما الدنيا أجلٌ حاضرٌ يأكلُ منها البَرُّ والفاجرُ,  <br> وإن الآخرة أجلٌ مستأخر يحكُمُ فيها مَلِكٌ قادر .. <br> الا وإن الخير كله بحذافيره في الجنة ... وإن الشر كله بحذافيره في النار. </b>'
    ],

    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني من الأربعين النووية (حديث جبريل عليه السلام) لبيان مراتب الدين.',
    metaKeywords: 'حديث جبريل, الإسلام, الإيمان, الإحسان, الأربعون النووية',
    quizQuestions: {  } 
    }   
    ,
  
  '18': {
    title: ' الحديث الثامن عشر',
    name: 'الحديث الثامن عشر [تقوى الله تعالى وحسن الخلق] ',
    hintText: '',
    audioUrl: 'audio/hadith/18.mpeg',
       imageUrls: [ 
      '/images/nawawi/hadith18.png'],
       explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b>  اتق الله: </b> ✓التقوى لغةً: <span>  ان تجعل بينك وبين ما تخاف منه حاجزاً ووقاية.</span></li>
       <li>✓التقوى اصطلاحاً:<span>  ان تجعل بينك وبين عذاب الله وقاية بأمتثال أومره وأجتناب نواهيه.</span></li>
       <li><b> حيثما كنت:</b> <span>  اي في اي زمان ومكان ، سواء رأك الناس ام لم يروك.</span></li>
       <li><b> اتبع:</b> <span> الحق.  </span></li>
       <li><b> السيئة:</b> <span> الذنب الذي يحصل من قبل الانسان. </span></li>
       <li><b>تمحوها: </b><span>  تزيلها من صحائف الملائكة وترفع المؤاخذة عن العبد.</span></li>
      <li><b> خالق:</b><span>  جاهد نفسك وتكلف المجاملة.</span></li>
        <li><b> بخلق حسن:</b><span> وهو الطبع والمزاج وقد يوصف بالسوء ، وقد يوصف بالحسن. </span></li>
          <li><b> ومعنى خالق الناس بخلق حسن:</b><span>  اي عمل الناس بما تحب ان يعاملوك به.</span></li>
          <li> <b> حسن الخلق من صفات النبيين والمرسلين وخيار المؤمنين. <b> </li>
      </ul>
    </div> 
    
  `,
    box1Title: '📌 نبذة عن راوي الحديث',
    box1Items: [
      '• <b> ابي ذر جندب بن جنادة.</b> <br>  ١. قال عنه رسول الله أشبه الناس بعيسى بن مريم. <br> ٢. من قبيلة غِفار أحد بطون كنانة ، وتقع ما بين مكة والشام. <br> ٣. أول من حيّا بتحية الاسلام. <br> ٤. كان يتعايش من قطع الطريق لكنه كان موحداً ولم يعبد الاصنام ، وحرم على نفسه الخمر والازلام. <br> ٥. كان أدما ، ضخماً جسمياً كثّ اللحية ، طويلاً ،  ابيض الشعر واللحية. <br> ٧. كان رابع او خامس من اسلموا.  <br> ٦. روا عن النبي 281 حديثاً. <br> ٨. كان النبي يحبه ويقول: (ان الله امرني بحب اربعه واخبرني انه يحبهم: علي وابي ذر و المقداد وسلمان). <br> ٩. كان كريماً لا يبقي من ماله شيئاً وعندما توفي لم يوجد ما يكفن به. <br> ١٠. اسلم نصف قومه على يده ، والنصف الاخر اسلموا عند هجرتهم الى المدينة.  <br> ١١. كان يدعو الى الله تعالى بحدّة مما اساء العلاقة بينه وبين معاوية. <br> ١٢. قال فيه رسول الله "رحم الله ابا ذر ، يمشي وحده ، ويموت وحده ، ويبعث وحده". <br> ١٣. انتقل الى الربذة ومات فيها وصلى عليه ابن مسعود وحده. <br> ١٤. قال عنه علي: "ابو ذر وعى علماً عجز عنه الناس، ثم أوكأ عليه، ولم يُخرج شيئاً منه".' ,
      '• <b> معاذ بن جبل</b> <br> ١. انصاري خزرجي ، آخى النبي بينه وبين ابن مسعود رضي الله عنهما. <br> ٢. شهد بدر وغزوات الرسول.  <br>٣. قال عنه النبي انه اعلم الناس بالحلال والحرام. <br> ٤. بعثه رسول الله قاضياً الى منطقه الجند في اليمن ، ويعلم الناس القران وشرائع الاسلام. <br>  ٥. علّم اهل الشام واليمن واهل مكة. <br>  ٦. كان امرد (اي ليس له لحية) ، كبير العينين ، طويلاً ، حسن الثغر ، ابيض ، مجموع الحاجبين ، وكان به عرج.  <br> ٧. استعمله عمر على الشام ، واستعمله الرسول على اليمن. <br>٨. كان ممن جمع القران في عهد النبي ، قال النبي: (خذوا القران من اربعه: ابن مسعود _ معاذ _ سالم مولى ابي حنيفة _ أبي بن كعب). <br> ٩. توفي في طاعون في الشام سنه 18 هجري ، وكان عمره في الثلاثينات.  <br> ١٠. لم يكن له ولد ... وقيل كان عنده ولد ، اسمه عبد الرحمن ، وكني به ، وتوفي في معركه اليرموك ، وقاتل معه. ',
   
    ],
    box2Title: '📌 اهميه الحديث ',
    box2Items: [
      '• <b> جمع خيري الدنيا والاخرة.</b>',
    ],
    box3Title: '📌 فوائد الحديث',
    box3Items: [
'• <b> ١. الامر بملازمة التقوى في كل الاحوال.</b>',
'• <b>٢. الاخلاق الحميدة رافد من روافد التقوى. </b>',
'• <b> ٣. وجوب التوبة من جميع الذنوب ومحو اثارها باتباع الاعمال الصالحة.</b>',
'• <b> ٤. يدل هذا الحديث على امكانية اكتساب الخلق الحسن.</b>',
'• <b>٥. عامل الناس بما تحب ان يعاملوك به.  </b>',
'• <b> ٦. حسن الخلق من صفات النبيين وخيار المؤمنين</b> (لا يجزون السيئة بالسيئة ، بل يصفحون ويحسنون).',
 '<b>اضاءه:</b> من كمال التقوى: كره أهل المعاصي ، والبعد عن مجالستهم ، اذا لم يأتمروا بمعروف ، او ينهو عن منكر.',

    ],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني من الأربعين النووية (حديث جبريل عليه السلام) لبيان مراتب الدين.',
    metaKeywords: 'حديث جبريل, الإسلام, الإيمان, الإحسان, الأربعون النووية',
    quizQuestions: {  } 
    }, 
  '19': {
    title: 'الحديث التاسع عشر',
    name: 'الحديث التاسع عشر [عون الله تعالى وحفظه]',
    hintText: '',
    audioUrl: 'audio/hadith/19.mpeg',
       imageUrls: [ 
      '/images/nawawi/hadith19.png'],
      explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b> كنت خلف النبي:</b> <span> المقصود انه كان راكباً خلف النبي ، منهم من قال كان يركب حماراً او بغلة  أهداها له المقوقس. </span></li>
       <li><b> يا غلام:</b> <span> تطلق على الصبي من وقت الفطام الى عمر تسع سنوات.  </span></li>
       <li><b> اني اعلمك:</b> <span>  للفت نظره انه سيعلمه جمل مفيدة تنفعه في دنياه وآخرته.</span></li>
       <li><b> كلمات:</b> <span>  جمل تحتوي على نصائح ينفعك الله بها. </span></li>
       <li><b>احفظ الله: </b> <span> اي احفظه في أوامره ونواهيه وحقوقه عليك ، واثبت له صفات الجمال و الجلال ونزهه عن النقائص، لان الله غني عن حفظك ، فهو الحافظ والحفيظ للعالم كله.  </span></li>
       <li><b> يحفظك:</b> <span>  اي يصونك ويحميك.</span></li>
       <li><b>تجده تجاهك: </b> <span>  اي تجده معك بالحفظ والتأييد والنصرة والمعونة.</span></li>
       <li><b> اذا سألت فاسأل الله:</b> <span>  اي ما تريده من امور دينك ودنياك فلا تسأل العبد ، الله تعالى يحب ان يُسأل ، لكن العبد يكره ان يُسأل.</span></li>
       <li><b>واذا استعنت فاستعن بالله: </b> <span>  اي طلبت الإعانة ، اياك نعبد واياك نستعين ، الاستعانو بالله على اي عمل.</span></li>
       <li><b> واعلم:</b> <span>  ردد تكرار العلم. </span></li>
       <li><b>الامة: </b> <span>  هي سائر المخلوقين من العقلاء.</span></li>
       <li><b>وقوله: </b> <span>  واعلم ان الامة لو اجتمعت على ان ينفعوك..... "فيه الدلالة على وجوب الايمان بالقدر خيره وشره"</span></li>
       <li><b> رفعت الاقلام:</b> <span>  عن الكتابه والتغيير الا ما شاء الله. </span></li>
       <li><b> جفت الصحف:</b> <span> انتهى الأمر واستقر فلا تبديل ولا تغيير الا بما يشاء الله. </span></li>
       <li><b>الرخاء: </b> <span>  سعة العيش والامن وغير ذلك.</span></li>
       <li><b> الكرب:</b> <span> الحزن والغم الذي يأخذ بالنفس. </span></li>
       <li><b> واعلم ان النصر مع الصبر.....: فيه ان الانسان في الدنيا معرض للمصائب فعليه بالصبر لان العسر يتبعه يسر ، والكرب يتبعه فرج.</b>  </li> 
      </ul>
    </div>
  `,

    box1Title: '📌 نبذة عن راوي الحديث',
    box1Items: [
     '• <b> ابو العباس عبد الله بن عباس رضي الله عنهما. </b> <br> ١. ابن عم النبي ، والده العباس عم النبي ، ووالدته لبابة الكبرى بنت الحارث ، اخت ميمونو بنت الحارث زوجة النبي. <br> ٢. دعا له النبي "اللهم فقهه في الدين وعلمه التأويل" ، ودعا له بأن: "يؤتي الحكمة". <br> ٣. قال عنه مسروق: اذا رأيته قلت اجمل الناس ، واذا انطلق قلت افصح الناس ، واذا تحدث قلت اعلم الناس. <br> ٤. ولد في حصار شعب ابي طالب قبل الهجرة بثلاث سنوات. <br> ٥. قال عنه جرجير: ما ينبغي مثلك الا ان يكون حبر العرب .  <br> ٦. كان الصحابه اذا ابتدروا في امر ← لجؤوا الى ابن عباس. <br> ٧. هو من العبادل الا ربعة.  <br> ٨. كان سريع الحفظ متقد الذهن. <br> ٩. كان عمر يدنيه في مجلسه رغم صغر سنه ، وذلك لذكائه وعلمه.  <br> ١٠. شاهد الوحي مرتين بأم عينه ، فلما اخبر النبي بذلك ، اخبره النبي انه سيفقد بصره ، وقد فقده حقاً في اخر حياته. <br> ١١. سمي ترجمان القران لسعة علمه. <br> ١٢. قال محمد بن الحنفية: دخل طائر ابيض في كنفه ولم يخرج. '
    ],
    box2Title: '📌 اهميه الحديث',
    box2Items: [
      '<b> له اصل كبير في رعايه حقوق الله ، والتفويض لامره ، والتوكل عليه. </b>'
    ],
    box3Title: '📌 فوائد الحديث',
    box3Items: [
      '• <b>  ١. التوكل على الله والايمان بالقضاء والقدر.  </b>',
      '• <b> ٢. سؤال الله عز وجل والاستعانة به ، وترك سؤال الناس.</b>',
      '• <b> ٣. الايمان بالقضاء والقدر هو توكل لا تواكل ، فمن ترك الاسباب محتجاً بالقدر فقد عصى الله تعالى.</b>',
      '• <b>٤. من حفظ حدود الله ورعى حقوقه حفظه الله (الجزاء من جنس العمل). </b>',
      '• <b>٥. من عامل الله بالتقوى والطاعة في حال رخائه.. عامله الله باللطف والاعانة في حال شدته. </b>',
      '• <b> ٦. كل ما كان في ام الكتاب ثابت لا يتبدل ولا يتغير ولا ينسخ. </b>',
      '• <b>٧. ينبغي لمن نزل به البلاء ان يكون صابراً محتسباً. </b>',
    ],

    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني من الأربعين النووية (حديث جبريل عليه السلام) لبيان مراتب الدين.',
    metaKeywords: 'حديث جبريل, الإسلام, الإيمان, الإحسان, الأربعون النووية',
    quizQuestions: {  } 
    },

  '20': {
    title: 'الحديث العشرون',
    name: 'الحديث العشرون [الحياء من الإيمان]',
    hintText: '',
    audioUrl: 'audio/hadith/20.mpeg',
      imageUrls: [ 
      '/images/nawawi/hadith20.png'],
     imageRotations: [1],
      explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b>  ان مما ادرك الناس: </b> <span> اي مما بلغ الناس من كلام الانبياء قبلنا.  </span></li>
       <li><b> من كلام النبوه الاولى:</b> <span> مما اتفق عليه الانبياء ، ولم ينسخ في شريعة سيدنا محمد ، وهذا يدل على وحدة الشرائع ، فشرع ما قبلنا شرع لنا الا اذا ورد دليل على نسخه. </span></li>
       <li><b> اذا لم تستح فاصنع ما شئت:</b> <span> لها ثلاثه معانٍ:  <br> ✓من باب الامر: اذا لم تستح فاصنع ما شئت فانك مجازى به. <br> ✓من باب الاخبار: فيكون المعنى ان من لم يستحي صنع ما شاء. <br> ✓من باب الاباحه: اذا اتيت بالعمل فقسه فإن وجدت نفسك تستحي منه فلا تفعله ، وان وجدت نفسك لا تستحي منه فافعله.</span></li>
       <li><b>تعريف الحياء: </b> <span> هو امتناع النفس عن فعل ما يُعاب ، وانقباضها عن فعل شيء او تركه مخافة ما يعقبه من ذم. </span></li>
       <li><b> الفجور:</b> <span>
 هو عكس الحياء وهي صفة مذمومة قال النبي: "كل امتي معافى الا المجاهرون". </span></li>
       <li><b> ما يذم من الحياء: </b> <span> ✓ان يستحي من الامر بالمعروف والنهي عن المنكر. <br>✓ ان يستحي من طلب العلم قال رسول الله: "لا ينال العلم مستح ولا متكبر". </span></li>
      </ul>
    </div>
  `,

    box1Title: '📌 نبذة عن راوي الحديث',
    box1Items: [
      '<b> ابو مسعود عقبة بن عمرو الانصاري البدري رضي الله عنه.</b> <br> ١. اطلق عليه البدري لانه سكن قرب بدر.  <br>  ٢. شهد بيعة العقبة الثانية ولم يشهد بدراً ، لكنه شهد احد وما بعدها.  <br> ٣. نزل الكوفة وسكن فيها ، ثم رجع الى المدينه ومات فيها في خلافة معاويه سنه 40 هجري. '
    ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
      '<b> ١. يجب على الانسان ان يتخلق بخلق الحياء وهو اكد في حق المرأة.</b>',
      '<b> ٢. يتوجب على الاباء والامهات تربية اولادهم على الحياء.</b>',
      '<b> ٣. لا حياء في تعليم احكام الدين وتعليمها ، ولا حياء في طلب الحق. </b>',
      '<b> ٤. تعظيم امر الحياء والوعيد والتحذير من قلة الحياء.</b>',
      '<b> ٥. هناك حياء ندم شرعاً: ممن يستحي من ان يأمر بالمعروف وينهى عن منكر ← فهذا جبن وليس حياء.</b>  <br>',
      '<b> إضاءة: الحياء نوعان</b> <br> <b> ١. فطري: ما كان من خلقة الانسان ، وهو من اجل الاخلاق التي يمنحها الله للانسان.</b> <br> <b> ٢. مكتسب: من معرفة الله ومعرفة عظيمة وقربة منه يحمله على الحياء منه.</b>',
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني من الأربعين النووية (حديث جبريل عليه السلام) لبيان مراتب الدين.',
    metaKeywords: 'حديث جبريل, الإسلام, الإيمان, الإحسان, الأربعون النووية',
    quizQuestions: {  } 
    },
     '21': {
    title: 'الحديث  الحادي و العشرون',
    name: 'الحديث الحادي و العشرون [ الإستقامة و الإيمان]',
    hintText: '',
    audioUrl: 'audio/hadith/00.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith21.png'],
      explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b>   قل لي في الإسلام:</b> <span> أي في عقيدة الإسلام. </span></li>
       <li><b> قولاً: </b> <span>جامعاً لمعاني الإسلام. </span></li>
       <li><b> لا أسأل عنه أحد غيرك:</b> <span>  أي واضحاً لا يحتاج إلى تفسير. </span></li>
       <li><b>قل آمنت بالله: </b> <span>  جدد إيمانك ، بالله متذكراً بقلبك ذاكراً بلسانك.</span></li>
       <li><b> استقم:</b> <span>  أي داوم على الطاعة وعدم المعصية. </span></li>
       <li><b> والاستقامة:</b> <span>  هي امتثال كل مأمور واجتناب كل محظور.</span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن الراوي',
    box1Items: [
      '<b> الراوي: </b> ١. أبو عمرو وقيل أبو عمرة سفيان بن عبد الله الثقفي رضي الله عنه. ',
      '• <b>  ٢. كان من الوفد الذي قدم إلى النبي صلى الله عليه وسلم من الطائف فأسلم.   </b>',
      '• <b>  ٣. ولاه عمر بن الخطاب رضي الله عنه إمارة الطائف لفترة قصيرة.  </b>',
      '• <b>  ٤. وولاه أيضا على صدقات أهل الطائف.  </b>' 

   ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
        '<b>  ١. أصل الاستقامة القلب. </b>', 
      '<b>٢. استقامة القلب لا تأتي إلا باستقامة اللسان. </b>', 
      '<b> ٣. الاستقامة تدل ع كمال الايمان وعلو الهمة.</b>', 
      '<b> ٤. دعوى الايمان لا تكفي ما لم يكن معها عمل (فالعمل هو ترجمة الإيمان وثمرة من ثمراته).</b>', 
 ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الحادي والعشرون .',
    metaKeywords: 'شرح وتدبر الحديث الحادي والعشرون .',
    quizQuestions: {  } 
    } , 
     '22': {
    title: 'الحديث الثاني و العشرون',
    name: 'الحديث الثاني و العشرون [طريق الجنة]',
    hintText: '',
    audioUrl: 'audio/hadith/00.mpeg',
    imageUrls: [ 
      '/images/nawawi/hadith22.png'],
      explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b> رجلا</b> <span>  هو النعمان بن قوقل، وكان من الذين استشهدوا يوم أحد. </span></li>
       <li><b> أرأيت: </b> <span>  أفتني وأخبرني.</span></li>
       <li><b> إذا صليت المكتوبات:</b> <span>   المفروضات أي الصلوات الخمس.</span></li>
       <li><b>وأحللت الحلال: </b> <span>     اعتقدت حله وفعلت الواجب منه. </span></li>
       <li><b> والحلال </b> <span>  هو المأذون بفعله شرعا، منه ما هو واجب ومنه ما هو مباح.</span></li>
       <li><b> حرمت الحرام:</b> <span> اجتنبته معتقدا حرمته. </span></li>
        <li><b>والحرام: </b> <span> كل ما منع الشرع فعله على سبيل الحتم، ويترتب على فعله عقوبة أو حد. </span></li>
         <li><b> أأدخل الجنة:</b> <span> أي أدخل الجنة مع السباقين، من غير عذاب. </span></li>
          <li><b> ولم أزد على ذلك شيئاً:</b> <span> لم آتِ بأي شيء من التطوع أو النوافل.  </span></li>
 <li><b> قال نعم:</b> <span> وهو جواب يطمئن قلبه ويشرح صدره ، ويدل على أن الدين يسر. </span></li>

      </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن الراوي ',
    box1Items: [
   '<b> الراوي:</b> ١. ابو عبد الله جابر بن عبد الله رضي الله عنهما. ', 
   '• <b> ٢. شهد بيعة العقبة الثانية وكان اصغر من شهدها.</b>', 
    '• <b>٣. انصاري خزرجي. </b>', 
   '• <b>٤. والده عبد الله بن حرام، استشهد في غزوة أحد، وبشر النبي صلى الله عليه وسلم سيدنا جابر أن الله عز وجل كلّم والده كفاحا. </b>', 
    '• <b>٥. استغفر له رسول الله ليلة البعير /٢٥/ مرة. </b>',
   '• <b>٦. لازم النبي وأخذ عنه الكثير من الأحاديث، وروى عنه أكثر من 1540 حديثا. </b>', 
    '• <b>٧. شهد كل الغزوات مع النبي صلى الله عليه وسلم عدا بدر عمل فيها على سقاية الجيش، وأحد حيث منعه أبوه من الخروج. </b>', 
     '• <b> ٨. اجتهد في طلب العلم، حتى كان من كبار المفتين بالمدينة إلى جانب عائشة وابن عمر. </b>', 
      '• <b> ٩. كُفَ بصره في آخر عمره، وتوفي في المدينة وعمره 94 سنة. </b>', 
      '• <b>١٠. آخر من مات في المدينة ممن شهد بيعة العقبة الثانية.  </b>', 
    

 ],
    box2Title: '📌 فوائد الحديث ',
    box2Items: [
      '<b>      ١. ترك النبي صلى الله عليه وسلم تنبيهه على السنن والفضائل: <br> ✓إما تسهيلا عليه، لقرب عهده بالإسلام. <br>  ✓أو لئلا يعتقد بأن السنن والتطوعات واجبة عليه.</b>', 
      '<b>٢. لماذا لم يذكر الزكاة والحج ضمن هذا الحديث؟  <br>✓إما لأنهما لم يفرضا بعد. <br> ✓أو لكونه غير مكلف بهما لفقره وعدم استطاعته.  </b>', 
      '<b>٣. جواز ترك التطوعات اذا لم يكن من باب الاستهانة.  </b>', 
      '<b> ٤. من قام بالواجبات وترك المحرمات ← دخل الجنة. </b>', 
      '<b>٥. من ترك التطوعات ← ضيّع عن نفسه ربح عظيم. </b>'
  ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني والعشرون .',
    metaKeywords: 'شرح وتدبر الحديث التاني والعشرون .',
    quizQuestions: {  } 
    } ,
     '23': {
    title: 'الحديث الثالث و العشرون',
    name: 'الحديث الثالث و العشرون [من جوامع الخير]',
    hintText: '',
    audioUrl: 'audio/hadith/00.mpeg',
      imageUrls: [ 
      '/images/nawawi/hadith23.png'],
      explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b> الطهور:</b> <span>  هو رفع حدث ،هو الوضوء والغسل.</span></li>
       <li><b> شطر:</b> <span> نصف. </span></li>
       <li><b> الحمد لله تملأ الميزان:</b> <span>  الحمد هو الثناء على الله تعالى لما أعطاه من نعم.</span></li>
       <li><b>الميزان: </b> <span> أي كفة الحسنات من الميزان الذي توزن به أعمال العباد يوم القيامة.   </span></li>
       <li><b> سبحان الله : </b> <span>  تعظيم الله وتنزيهه من النقائص.</span> </li>
       <li><b>تملآن :</b> <span>  يملأ ثوابها ما بين السماوات والأرض من عظم أجرها.</span></li>
       <li><b> الصلاة نور:</b> <span>✓تهدي إلى فعل الخير كما يهدي النور إلى الطريق السليم. <br> ✓وقيل أنها نور في وجه صاحبها في الآخرة، وبهاء على وجهه في الدنيا.  <br>  ✓وقيل أنها نور لصاحبها يوم القيامة.</span></li>
       <li><b>النور :</b> <span> هو ضوء دون حرارة. </span></li>
       <li><b>الصدقة برهان: </b> <span> البرهان هو الدليل والحجة ومدافع عنك. <br> ✓إما برهان وحجة على إيمان العبد، لأن المنافق يمتنع عنها لكونه لا يعتقدها.  </span></li>
       <li><b> الصبر</b> <span>  وهو حبس النفس عما تتمنى، وتحمّلها ما يشق عليها، وثباتها على الحق رغم المصائب.</span></li>
       <li><b>وللصبر أنواع: </b> <span> صبر على الطاعة ـ صبر عن المعصية ـ صبر على البلاء..... . </span></li>
       <li><b>ضياء: </b> <span>  شدة النور، أي نور مع حرارة واحراق, ووصف الصبر بالضياء: لأنه شاق على النفس. </span></li>
       <li><b> القرآن حجة:</b> <span>  برهان ودليل ومرشد ومدافع عنك.</span></li>
        <li><b>لك: </b> <span>  إن اتبعت منهجه و عملت بما به فيكون حجة لك.</span></li>
       <li><b> أو عليك:</b> <span>  إن خالفت أوامره ولم تجتنب نواهيه.</span></li>
       <li><b> كل الناس يغدو:</b> <span> يذهب باكرا يسعى لنفسه، والغدو الذهاب ما بين طلوع الفجر وشروق الشمس. </span></li>
       <li><b> فبائع نفسه:</b> <span> إما بائع نفسه الله تعالى بطاعته، أو للشيطان بطاعته واتباع هوى نفسه. </span></li>
       <li><b>فمعتقها: </b> <span>  معتق نفسه من النار عندما يبيع نفسه الله.</span></li>
       <li><b> أو موبقها:</b> <span>  مهلكها بالمعاصي، وما يترتب عليها من العذاب عندما يبيع نفسه للشيطان.</span></li>
  </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن راوي',
    box1Items: [
      '<b>الراوي </b> ١. أبو مالك الحارث بن الحارث الأشعري رضي الله عنه.',
 '• <b> ٢. وقيل كعب بن عاصم.</b>', 
  '• <b>٣. من الأشاعرة الذين قدموا إلى النبي صلى الله عليه وسلم في السفينة إلى المدينة المنورة.  </b>', 
   '• <b>٤. توفي في خلافة عمر بن الخطاب عام 18 للهجرة في طاعون عمواس. </b>', 
 ],
    box2Title: '📌 فوائد الحديث',
    box2Items: [
      '<b> ١. المحافظة والصلوات في أوقاتها والصبر على الشدائد.</b> ',
       '<b>٢. القرآن دستور المسلم عليه أن يُقبل على تلاوته. </b> ',
        '<b> ٣. لابد لكل إنسان من عمل يغدو به حتى لا يترك نفسه هملاً.</b> ',
         '<b> ٤. المسلم يسعى للاستفادة من عمره في الطاعة.</b> ',
          '<b> ٥. الإيمان قول وعمل يزيد بالطاعة وينقص بالمعصية.</b> ',
           '<b>٦. الاعمال توزن لها خفة وثقل. </b> ',

    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثالث والعشرون .',
    metaKeywords: 'شرح وتدبر الحديث الثالث والعشرون .',
    quizQuestions: {  } 
    }  /*
     '24': {
    title: 'الحديث العشرون',
    name: 'الحديث العشرون []',
    hintText: '',
    audioUrl: 'audio/hadith/00.mpeg',
     imageUrls: [ 
      '/images/nawawi/hadith24.png'],
      explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
      <li><b> </b> <span> </span></li>
       <li><b> </b> <span> </span></li>
       <li><b> </b> <span> </span></li>
       <li><b> </b> <span> </span></li>
       <li><b> </b> <span> </span></li>
       <li><b> </b> <span> </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث الثاني',
    box1Items: [
      'مراتب الدين ثلاثة: الإسلام، والإيمان، والإحسان.'
    ],
    box2Title: '📌 أدب السؤال',
    box2Items: [
      'جلوس جبريل عليه السلام يبرز أدب طالب العلم أمام المعلم.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription: 'شرح وتدبر الحديث الثاني من الأربعين النووية (حديث جبريل عليه السلام) لبيان مراتب الدين.',
    metaKeywords: 'حديث جبريل, الإسلام, الإيمان, الإحسان, الأربعون النووية',
    quizQuestions: {  } 
    }  
  */
};