export const RYAD_BAB3_HADITHS: Record<string, any> = {

    '1': {
    title: 'باب الصبر',
    name: '', 
    hintText: '',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: ' باب الصبر ',
    box1Items: [
     '<b> لغةً :</b>  الحبس والكف.',
'<b> شرعاً :</b>  حبس النفس عم ما يقتضيه العقل أو الشرع، حبس اللسان عن الشكوى، حبس النفس عند الجزع والتسخط.',
 '<b> ابن عطاء:</b> الصبر: الوقوف مع البلاء بحسن الأدب. وحقيقة الصبر الايعترض ع المقدور أما إظهار البلاء لاتقصد الشكوى فلا ينافي الصبر ... قال الله واصفاً سيدنا أيوب : إنا وجدناه صابراً ، نعم العبد.',
'<b> - وأجر الصبر غير مقدر بمقدار ( إنما يوفى الصابرون أجرهم بغير حساب).  </b> ', 
'<b>- بعض السلف قال، وقد عزيّ بمصيبة نالته مالي لا أصبر وقد وعدني اللون الصبر ثلاث خصال كل خصلة منها خير من الدنيا وما عليها: </b>', 
'<b>- الصلاة منه علي ورحمته في وهدايته إيايّ (وبشر الصابرين الذين اذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون أولئك عليهم صلوات من ربهم ورحمة وأولئك هم المهتدون)  </b> ',
'<b> - وجعل الله الصبر عوناً في الدنيا على شؤون الحياة والقلب والتحلي بمكارم الأخلاق. (واستعينوا بالصبر والصلاة إن الله مع الصابر مين الصابرين). الصبر المحمود ثلاثة أنواع:  </b> <br> ١. إطصبر ع طاعة الله. <br> ٢. صبر عن معاصي الله. <br> ٣. صبر على أقدار الله.', 
' <b> ـ والانسان مبتلى بشتى أنواع الابتلاء تمحيصاً للمؤمن وتميزاً للمنافق (ولنبلونكم بشيئ من الخوف والجوع ونقص من الأموال والأنفس والثمرات) . </b> '
    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '2': {
    title: 'الحديث الأول:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-3/hadith-25.m4a',
    imageUrls: [ '/images/bab3/ryad-bab3-hadith1-1.jpeg'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> الطهور: </b><span>    بالضم التظهر ، بالفتح الماء الذي يتطهر به كالوضوء.</span></li>
        <li><b> موبقها: </b><span>  مهلكها.</span></li>
        <li><b>يغدو: </b><span> غدا أو بكر والغدوة هي ما بين صلاة الغداة وطلوع الشمس. <br> الغدوة هي السير أول النهار.  </span></li>
      </ul>
    </div>
  `,
    box1Title: '  راوي الحديث',
    box1Items: [
   '<b>الراوي:</b>  الحارث بن عاصم الاشعري.',
  '• ١. قال لي : هذا وهم . هو كعب بعد عاصم أو الحارث بن الحارث والأرجح هو الحارث بن الحارث الشامي وهو مشهور باسمه. ',
  '• ٢. وقال ابو سلام ممطور هو غير أبو مالك الاشعري المشهور بكنيته فهو متقدم الوفا.',
  '• ٣. توفي بالطاعون بينما الحارث توفي متأخراً و الأرجح هو كعب بن عاصم.',
  '• ٤. والأشعري نسبه إلى الأشعر (قبيلة من المي) وقيل لأن أمه ولدته والشعر على بدنه.',
    ],
    box2Title: ' فوائد الحديث:', 
    box2Items: [
   '<b>١. هذا حديث عظيم هو أصل من أصول الإسلام ذكر فيه الطهارة وذكر الله والصلاة و الصدقة و الصبر. </b> ',
   '<b> ٢. بالصبر تثبت أركان الاسلام وبه أحكمت قواعد الإيمان.</b> ',
   '<b> ٣. لابد لكل إنسان من عمل يغدو له حتى لا يترك نفسه هملاً.</b> ',
   '<b>٤. المسلم يسعى للاستفادة من عمره في طاعة الله. </b> ',
   '<b> ٥. القرآن سلطان قاهر وحاكم فيصل يفرق به بين الحق والباطل... فهو حجة الله في الخلق به السعادة والشقاء ... فهو حجة لك أو عليك .</b> '
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '3': {
    title: 'الحديث الثاني:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-3/hadith-26.m4a',
    imageUrls: [ '/images/bab3/ryad-bab3-hadith2.jpeg'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>نَفِد: </b><span>  فني وذهب.</span></li>
        <li><b>يستعفف: </b><span> الكف عند الحرام والسؤال من الناس والاستشراف الى مافي أيديهم.</span></li>
        <li><b> يعفه الله:</b><span> يرزقه الله العفة فيصير عفيفاً قنوعاً. </span></li>
        <li><b> يغنيه الله :</b><span> يجعله غني النفس. </span></li>
        <li><b>يتصبر </b><span> يتكلف الصبر على ضيق العيش ولا يشكو لغير مولاه. </span></li>
        <li><b> يصبره الله :</b><span> يعطيه من حقائق الصبر الموصلة للرضا مما يهون عليه كل مشقة وكدر. </span></li>
      </ul>
    </div>
  `,
    box1Title: '  فوائد الحديث: ',
    box1Items: [
    '<b>١. جواز السؤال للحاجة وإن كان الأولى تركه والصبر حتى يأتيه رزقه بغير مسألة. </b>',
    '<b> ٢. كَرمُ النبي وكان عليه من السخاء و السماحة ومكارم الاخلاق. </b>',
    '<b>٣. جواز إعطاء السائل أكثر من مرة عند الحاجة والاعتدار منه عند العجز. </b>',
    '<b>٤. الحض على التعفف عن المسألة والتنزه عنها. </b>',
    '<b> ٥. الحث على الصبر على ضيق العيش وغيره من مكان الدنيا. </b>',
    '<b>٦. الصبر أفضل ما يعطاه المرء لكون الجزاء عليه غير مقدر وغير محدد. </b>',
    '<b>٧. ليس الغنى عن كثرة العرض ، ولكن الغنى غنى النفس. <br> أي الغنى الحقيقي ليس بكثرة المال و المتاعع بل هي قناعة النفس والرضا ما بما قسمه الله. </b>'
    ],
    box2Title: '', 
    box2Items: [
      
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '4': {
    title: 'الحديث الثالث:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-3/hadith-27.m4a',
    imageUrls: [ '/images/bab3/ryad-bab3-hadith3.jpeg'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>عجباً: </b><span> إنكار ما يرد عليك لقلة اعتياده وتعجب إبن آدم من الشيء إذا عظم موقعه عنده وخفي عليه سببه.</span></li>
        <li><b> سراء</b><span> النعمة والرخاء والسعة والراحة. </span></li>
        <li><b> ضراء:</b><span> الحالة التى يضر فيها البدن أو ما يتعلق به من مال أو أهل أو ولد ، أي الشدة والحزن. </span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
    '<b>الراوي:  كان أبوه سنان بن مالك أو عمه.</b>  ',
    '• ١. كان عاملاً بكسرى على أيلة.',
    '• ٢. أغارت الروم على تلك الناحية فأخذت صهيباً فتربى في بلاط الروم فأخذ لكنتهم.',
    '• ٣. اشترته قبيلة كلب ثم قدمت به مكة فاشتراه عبد الله بن جدعان ثم أعتقه وأقام معه في مكة حتى توفي وبعث النبي. ',
    '• ٤. أسلم مع عمار في نفس اليوم.',
    '• ٥. شهد كل المشاهد. ',
    '• ٦. کان من المستضعفين بمكة ومن عذب كثيراً.',
    '• ٧. ونزلت به (ومن الناس من يشري نفس ابتغاء مرضاة الله ).',
    '• ٨. قال عنه رسول الله ربح البيع أبا يحيى.',
    '• ٩. توفي بالمدينه.',
    '• ١٠. صلى عليه سعد بن ابي وقاص.',

  ],
    box2Title: ' فوائد الحديث: ', 
    box2Items: [
'<b>  ١. حياة المسلم بما فيها من مسرة ومضرة كلها خير.</b> ',
'<b> ٢. المؤمن الكامل يشكر الله في السراء ويصبر على الضراء فينال خيري الدارين. </b> <br> <br> أما ناقص الايمان فإنه يتضجر و يسخط من المصيبة ... فيجتمع عليه المصيبة و وزر سخطها ولا يعرف للنعمة قدرها فلا يقوم بحقها ولا يشكرها فتنقلب النعمة في حقه نقمة وينعكس عليه الحال.', 
'<b>٣. ان العبد بين نعمة يجب عليه شكر المنعم بها ومصيبة يجب عليه الصبر عليها بين امر ينفذه ونهي يجتنبه. </b> '
   ],
    box3Title: ' إضاءة', 
    box3Items: [
      ' <b> قال رسول الله صلى الله عليه وسلم من كان يؤمن بالله ورسوله فليحب صهيباً حب الوالدة لولدها ،  صهيب سابق الروم ، وسلمان سابق الفرس ، وبلال سابق الحبشة ، وانا سابق العرب. </b> '
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '5': {
    title: 'الحديث الرابع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-3/hadith-28.m4a',
    imageUrls: [ '/images/bab3/ryad-bab3-hadith4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>ثقل: </b><span>  من شدة المرض.</span></li>
        <li><b> الكرب:</b><span>  الشدة من سكرات الموت. <br> وقيل هو الهم والحزن الذي يأخذ بالنفس.</span></li>
        <li><b> مكروب:</b><span> الكرائب الشرائد.</span></li>
        <li><b> الفردوس:</b><span>يجمع كل ما في البساتين امن شجر و زهر. ننعاه: نرفع خبر موته إليه. مأواه: المنزل هو المكان الذي يأوي إليه. </span></li>
        <li><b> تحثوا</b><span> حث التراب أي رماه. </span></li>
      </ul>
    </div>
  `,
    box1Title: ' فوائد الحديث: ',
    box1Items: [
    '<b>  ١. صبر النبي على ما هوفيه من سكرات الموت و شدائده. </b> ',
    '<b>٢. الانبياء يصيبهم ما يصيب الناس من وجع ومرض ويعانون من سكرات الموت (أشد الناس إبتلاء الابناء ثم الأولياء ثم الأمثل فالأمثل). </b> ',
    '<b>٣. جواز إظهار التوجع للميت عند احتضاره والحزن عليه من غير ندب أو عويل. </b> ',
    '<b> ٤. جواز نعي الميت.</b> ',
    '<b> ٥. إن معاناة رسول الله من سكرات الموت وآلامه وهو الحبيب المحبوب سلواناً لأمته وتعبيراً لها وتثبيتاً .</b> '
 ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '6': {
    title: 'الحديث الخامس:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-3/hadith-29.m4a',
    imageUrls: [ '/images/bab3/ryad-bab3-hadith5-1.png', '/images/bab3/ryad-bab3-hadith5-2.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> احتضر:</b><span>  حضرته وقد مات مفارقة الحياة ودنا موته.</span></li>
        <li><b> فاشهدنا:</b><span>احضرنا. </span></li>
        <li><b> أجل مسمى:</b><span> معلوم مقدر. </span></li>
        <li><b> تقعقع</b><span>  تتحرك وتضطرب.</span></li>
        <li><b> تحتسب:</b><span>: تحتسب الأجر بصبرها على مصيبتها. </span></li>
        <li><b> والاحتساب:</b><span> : طلب وجه الله. حجره: الثوب والخضن.</span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث ',
    box1Items: [
    '<b> الراوي:</b>  أسامة بن زيد. ',
    '• ١. أبو زيد.',
    '• ٢. الحب بنُ الحب.',
    '• ٣. كان أسود كالليل بينما أبوه أبيض أشقر.',
    '• ٤. أمه أم أيمن بركة مولاة رسول الله وحاضنته.',
    '• ٥. قالت دخل علي النبي مروراً تبرق أسارير وجهه فقال: ألم تري مجززاً نظر إلى زيد بن حارثة وأسامة فقال: هذه الأقدام بعضها من بعض.',
    '• ٦. أمره رسول الله قبل أن يبلغ /20 سنه/ قيادة جيش فيه أبو بكر وعمر.',
    '• ٧. كان عمر يجله ويكرمه ويفضله عن ابنه عبد الله.',
    '• ٨. اعتزل أسامة الفتن بعد قتل عثمان إلى أن مات في أواخر معاوية.',
    '• ٩. مات في المدينة'
    ],
    box2Title: ' فوائد الحديث: ', 
    box2Items: [
    '<b>١. جواز استحضار ذوي الفضل للمحتضر رجاء بركتهم ودعائهم. </b> ',
    '<b>٢. استحباب إبرار المقسم. </b> ',
    '<b> ٣. جواز البكاء من غير نواح.</b> ',
    '<b>٤. جواز مرافقة من أراد التعزية والعيادة بغير إذن بخلاف الوليمة. </b> ',
    '<b> ٥. مطالبة من حلّ به مصيبة أن يصبر ويحتسب.</b> ',
 ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '7': {
    title: 'الحديث السادس:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-3/hadith-31.m4a',
    imageUrls: [ '/images/bab3/ryad-bab3-hadith6.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>الصدمة </b><span>     كل أمر مكروه حصل بغته.</span></li>

      </ul>
    </div>
  `,
    box1Title: ' فوائد الحديث: ',
    box1Items: [
    '<b> ١. إن عدم الصبر ينافي التقوى. </b> ',
    '<b> ٢. جواز زيارة النساء للقبور ولو كان منكراً لنهاها الرسول عنه.</b> ',
    '<b> ٣. ملازمة الأمر بالمعروف والنهي عن المنكر مع احتمال الأذى عند بذل النصيحة ونشر الموعظة.</b> ',
    '<b>٤. من أمر بمعروف ينبغي له أن ن يقبل ولو لم يعرف الآمر. </b> ',
    '<b>٥. تواضع النبي ورفقه بالجاهل ومسامحة المصاب وقبول اعتذاره. </b> ',
    '<b>٦. لزوم الاعتذار إلى أهل الفضل إن أساء الأدب معهم. </b> '
   
 ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }
  /*,
   '5': {
    title: 'الحديث الأول:', 
    name: '', 
    hintText: '',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: '  ',
    box1Items: [
    '',
    ''
    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }*/

}