export const RYAD_BAB2_HADITHS: Record<string, any> = {
'1': {
    title: 'باب التوبة', 
    name: '', 
    hintText: '',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: 'باب التوبة ',
    box1Items: [
  '• <b>التوبه: لغةً:</b>  الرجوع. ',
  '• <b> اصطلاحاً:</b>   هي الرجوع من البعد عن الله الى القرب اليه سبحانه ، هي الرجوع عما نهى الله عنه الى امره ،وعن معصيته الى طاعته ،وعما يكرهه الى ما يرضاه.',
    ],
    box2Title: '📌 حكم ،  شروط ،  انواع ،  وثمرات التوبة', 
    box2Items: [
  '• <b>حكم التوبه:</b> واجبه من كل ذنب. <br><br> ' ,
  '• <b> شروط التوبه:</b>  ',
    '١- الاقلاع عن المعصيه ',
    '٢- الندم على فعلها ',
    '٣- العزم على عدم العوده الى المعصيه<br> <br>',
  '• <b> انواع التوبه:</b>  ',
    ' ١- توبه واجبه: هي التوبه من ترك المأمور او فعل المحظور ←من الابرار المقتصدين ',
    '٢- توبه مستحبه: ترك المستحبات وفعل المكروهات ← السابقين المقربين<br><br>',
  '• <b> ثمرات التوبه:</b>  ',
    '١- تكفير السيئات حتى يصير كمن لا ذنب له  ',
    '٢- نيله درجات حتى يصير حبيباً'
    ],
    box3Title: '📌 أمور تساعدني على التوبة',
    box3Items: [
  '١- صدق النيه واخلاص التوبه لله',
  '٢- محاسبه النفس فهي تدفعك الى العباده الى الخيرات ',
  '٣- تذكير النفس بالموت وعذاب القبر',
  '٤- الصحبه الصالحه والبعد عن رفاق السوء ',
  '٥- مخالفه الهوى والتذكير بعواقب الذنوب ',

    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '2': {
    title: 'الحديث الأول:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-13.mpeg',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith1.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>لاستغفر الله:</b> <span>  اطلب المغفره وهي الصفح عن الذنب واصل المغفره الستر.  </span></li>
        <li><b>اتوب اليه:</b> <span>  الرجوع من الذنب والندم على ما فرّط منه. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌فوائد الحديث ',
    box1Items: [
    '<b>١- جواز القسم للتاكيد على اهميه الامر.</b>',
  '<b> ٢- حال النبي وما كان عليه من دوام المراقبه لله.  </b> ',
  '<b> ٣- حاجه الناس للاستغفار. </b> ',
  '<b> ٤- ضروره قرن الاستغفار مع التوبه.  </b> ',
  '<b> ٥- المواظبه يومياً على الاستغفار والتوبه. </b> ',
    ],
    box2Title: '📌 من فوائد الإستغفار', 
    box2Items: [
  '<b>١- الاستغفار سبب النجاه (قال علي رضي الله عنه: العجب ممن يهلك ومعه النجاه قيل: وما هي؟ قال: الاستغفار).</b>',
  '<b>٢- يمحو الذنوب والخطايا (قيل لابن الجوزي؛ أأسبح ام استغفر؟ فقال: الثوب الوسخ احوج الى الصابون من البخور).</b>',
  '<b> ٣- الاستغفار سبب لنزول البركات من السماء والامداد بالاموال والبنين (فقلت استغفروا ربكم انه كان غفارا يرسل السماء عليكم مدرارا).</b> '
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }
  , 
  '3': {
    title: 'الحديث الثاني:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-14.mpeg',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith2.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>لاستغفر الله:</b> <span>  اطلب المغفره وهي الصفح عن الذنب واصل المغفره الستر.  </span></li>
        <li><b>اتوب اليه:</b> <span>  الرجوع من الذنب والندم على ما فرّط منه. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن الراوي  ',
    box1Items: [
     '<b>الراوي: </b> <span>  الاغر بن يسار. </span>',
  '<b> ١- من المهاجرين الاوائل </b> ',
  '<b>٢- روي ثلاث احاديث عن رسول الله. </b> ',
  '<b> ٣- المزني نسبه الى قبيله مزينة.  </b> ',

    ],
    box2Title: '📌  فوائد الحديث', 
    box2Items: [
        '<b>١- دعوه الناس جميعهم محسنهم ومسيئهم الى التوبه والاستغفار. ',
  '<b>٢- الاقتداء برسول الله في قوله وفعله. </b>',
  '<b>٣- وجوب التوبه والاستغفار في كل وقت وعلى كل حال. </b> '
    ],
    box3Title: '📌 إضاءة من فوائد التوبة ',
    box3Items: [
          '<b>١- طاعه لامر الله (يا ايها الذين امنوا توبوا الى الله توبه نصوحا).</b>',
  '<b>٢- سبب للفلاح في الدنيا والاخره (وتوبوا الى الله جميعا ايها المؤمنون).</b>',
  '<b> ٣- سبب لمحبه الله للعبد (ان الله يحب التوابين ويحب المتطهرين).</b> ', 
  '<b> ٤- سبب لدخول الجنه والنجاه من النار. </b> ', 
  '<b> ٥- سبب لنزول البركات من السماء وزياده القوه. </b> ', 
  '<b> ٦- سبب لتكفير السيئات وتبديلها بحسنات (فاولئك يبدل الله سيئاتهم حسنات).</b> ', 
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '4': {
    title: 'الحديث الثالث:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-15.mpeg',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith3.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> افرح:  </b> <span>  اشد فرحا. </span></li>
        <li><b>فلاة: </b> <span>  الارض الفقر التي لا ماء فيها. </span></li>
        <li><b>راحلته: </b> <span> الراحله من الابل وهي البعير القوي. </span></li>
        <li><b>اضله: </b> <span> ضيعه. </span></li>
        <li><b>الخطام: </b> <span> حبل ليف او شعر فيجعل في احدى طرفه حلقه ثم يشد فيه الطرف الاخر حتى يصير كالحلقه.   </span></li>
        <li><b>المعنى: </b> <span> الله يفرح بتوبه عبده اعظم واشد من فرحه هذا العبد براحلته التي ظن سبب هلاكه. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌  نبذة عن الراوي ',
    box1Items: [
  '<b>الراوي:</b> انس بن مالك.',
' ١. ابو حمزه الانصاري ',
'٢. خادم رسول الله، ولد بالمدينه',
'٣. خدم النبي 10 سنوات ',
'٤. اخر من مات من الصحابه بالبصره.',
' ٥. قال ثابت: قال لي انس: "هذه شعرة من شعر رسول الله ﷺ فضعها تحت لساني، قال: فوضعتها تحت لسانه، فدُفن وهي تحت لسانه".', 
'٦. دعى له رسول الله (اللهم اكثر ماله وولده وادخله الجنه) فقد رايت اثنين وانتظر الثالثه.',
'٧. كان من صلبه 80 صبي وبنتان وعنده 120 حفيد. ',
'٨. وله بستان يحمل كل سنه مرتين وكان فيه رياحين فهي بريح المسك.',
'٩. قال ابو هريره: ما رايت احدا اشبه صلاتي برسول الله من ابن ام سليم. '
    ],
    box2Title: '📌  فوائد الحديث', 
    box2Items: [
'<b>١- الترغيب بالتوبه والحث عليها. </b>',
'<b>٢- عدم المؤاخذه في الخطا غير المتعمد. </b>',
'<b> ٣- جواز سفر المرء وحده لان الشارع لا يضرب المثل الا بما يجوز. </b> ',
'<b> ٤- ضرب المثل بما يصل الى الافهام من الامور '
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '5': {
    title: 'الحديث الرابع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-16.mpeg',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: '📌  فوائد الحديث',
    box1Items: [
    '<b>١- سعه رحمه الله وكثرة تجاوزه عن المذنبين. </b>',
'<b>٢- تطيب نفوس العباد وتنشيطهم للتوبه وردعهم عن اليأس والقنوط من رحمه الله. </b>',
'<b>٣- قبول التوبه مستمر ما دام بابها مفتوح ، فيغلق بابها من طلوع الشمس من المغرب ، وهي علامه الساعه من علامات الكبرى. </b> ',

    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '6': {
    title: 'الحديث الخامس:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-17.mpeg',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: '📌  فوائد الحديث',
    box1Items: [
  '<b>١. من شروط قبول التوبه ان تقع قبل طلوع الشمس من مغربها. </b>',
'<b>٢. على المؤمن المبادره بالاعمال الصالحه قبل ان لا يقدر عليها ويحال بينه وبينها اما بمرض او بموت ، او ان يدركه طلوع الشمس من المغرب (من هذه الايات) لا يقبل منه العمل.</b>',

    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '7': {
    title: 'الحديث السادس:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-18.m4a',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith6.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
           <li><b> يغرغر:  </b> <span> الغرغره ان يجعل المشروب في الفم ويردده الى اصل الحلق ولا يبتلع،<br> <b> والمراد: </b> وصول الروح الى الحلقوم وهو اسفل الحلق.  </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 فوائد الحديث ',
    box1Items: [
    '<b>١. على المؤمن اغتنام ما بقي من عمره</b> (كل يوم يعيشه المؤمن غنيمه).',
' <b> ٢. للتوبه الصادقه شروط لابد منها حتى تكون صحيحه ومقبولة ومنها:</b>  <br> <b> ✓ - </b> ان تصدر قبل حضور الاجل،<br>  <b> ✓ - </b>  وقبل طلوع الشمس من مغربها. </b>',
    ],
    box2Title: '📌 من شروط التوبة', 
    box2Items: [
'<b>١- الاخلاص لله. </b>',
'<b>٢- العزم على عدم العوده.  </b>',
'<b> ٣- الندم.  </b> ',
'<b> ٤- الاعتراف بالذنب.',
'<b> ٥- رد المظالم الى اهلها.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '8': {
    title: 'الحديث السابع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-19.m4a',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith7.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
              <li><b> ابتغاء العلم: </b> <span>    من اجل طلب العلم.   </span></li>
         <li><b> تضع اجنحتها: </b> <span>   مجاز عن معاونته وتيسير سعيه. </span></li>
          <li><b> حك في صدري: </b> <span>  وقع فيك شك.  </span></li>
           <li><b> سفْراً: </b> <span>  وهي جمع مسافر ، <b>وسمي السفر سفراً: </b> لانه يسفر عن وجوه المسافرين واخلاقهم ويظهر ما كان خافياً منها.  </span></li>
            <li><b> يأمرنا: </b> <span>   الامر بالاباحه والجواز. </span></li>
             <li><b> الجنابه: </b> <span>   هي ما يوجب الغسل. </span></li>
              <li><b> الهوى: </b> <span>  الحب.  </span></li>
               <li><b> جهوري:</b> <span> شديد عال.   </span></li>
                <li><b> هاؤم: </b> <span>  تعال. </span></li>
                 <li><b>  اغضض:</b> <span> انقص من صوتك.  </span></li>
                  <li><b> ويحك: </b> <span> كلمه ترحّم وتوجع لمن وقع فيه سوء لا يستحقه.   </span></li>
                   <li><b> يحب القوم:</b> <span>  الاخيار من احياء واموات.   </span></li>
                    <li><b> لما يلحق بهم: </b> <span>   لم يعمل عمل مثل اعمالهم الصالحة من حيث الكمال. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن الراوي',
    box1Items: [
 '<b>الراوي: زر بن حبيش.</b> <br> ١. اسدي كوفي.<br> ٢. ابو مريم. <br>  ٣. من كبار التابعين.   <br> ٤. ادرك ايام الجاهليه ثقه كبيره بالحديث.  <br> ٥. حدث عن عمر وعثمان وعلي.  <br> ٦. كان مقرئ الكوفه وعالمها. <br>  ٧. وفد الى المدينه في خلافه عثمان لرؤية ولقاء اصحاب رسول الله. <br> ٨. لازم عبد الرحمن بن عوف وأبي بن كعب. <br> ٩. مات وعمره 120 سنه.',
  '<b>صفوان بن عسال</b><br>  ١. بني الربض بن زاهر. <br> ٢. من سكان الكوفه.  <br> ٣. غزا مع النبي 12 غزوه.   <br> ٤. روى عنه ابن مسعود.'
    ],
    box2Title: '📌 فوائد الحديث', 
    box2Items: [
    '<b>١- ندب الرحله في طلب العلم. </b>',
'<b>٢- فضل طالب العلم وتواضع الملائكه له</b> (اذا كان هذا الطالب لعلم فكيف لاحباره).',
'<b> ٣- الحث على محبه الصالحين رجاء اللحاق بهم والخلاص من النار. </b> ',
'<b> ٤- فضل حب الله ورسوله واهل الخير الاحياء والاموات.',
'<b>٥- جواز المسح على الخفين.',
'<b>٦- التادب مع العلماء والصالحين وخفض الصوت في مجالس العلم. </b>',
'<b>٧- التسليم والايمان بالمغيبات مما اخبر به النبي. </b>',
'<b> ٨- يقول الصحابه ما فرحنا بعد الاسلام فرحا اشد مما فرحنا من قول النبي</b> (المرء مع من احب يوم القيامه).'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '9': {
    title: 'الحديث الثامن:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-20.m4a',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith8.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
             <li><b> راهب: </b> <span> المتخلي عن اشغال الدنيا ، والتارك لملاذلها ، والزاهد فيها ، المعتزل لاهله. </span></li>
         <li><b> فنأى بصدره: </b> <span>  بَعُدَ عن الارض التي خرج منها. </span></li>
          <li><b> الارضين:</b> <span>   التي خرج منها والتي ذهب اليها.  </span></li>
           <li><b> أدنى: </b> <span>  اقرب.  </span></li>
            <li><b> نأى: </b> <span>   نهض بجهد ومشقه رغم ثقل ما اصابه من الموت. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌  نبذة عن الراوي ',
    box1Items: [
  '<b>الراوي: ابو سعيد الانصاري الخدري (مشهور بكنيته).</b> <br> ١. من المكثرين من الرواية ... وأفقه أحداث الصحابه. <br> ٢. غزا مع رسول الله 12 غزوه ، واول غزوة ... غزوة بني المصطلق ، وعمره 15 سنه.  <br> ٣. قال ابو سعيد مات ابي يوم احد ولم يترك لنا مالا ... فاتيت رسول الله اساله شيئا فحين رأني قال: (من استغنى اغناه الله ، ومن يستعفف اعفه الله) فرجعت دون ان اطلب منه.  <br> ٤. توفي يوم الجمعه ودفن في البقيع. '
    ],
    box2Title: '📌  فوائد الحديث', 
    box2Items: [
    '<b>١- مشروعيه التوبه من جميع الكبائر حتى من قتل النفس والترغيب بها وعدم اليأس.</b>',
'<b>٢- المفتي قد يجيب بالخطأ وقد يجيب بالصواب. </b>',
'<b> ٣- فضل العالم على العابد. </b> ',
'<b> ٤- حسن الادب في التعامل مع الناس وعدم احتقارهم بسبب ما يصدر منهم من ذنوب. </b>',
'<b>٥. ينبغي للانسان التائب ان يتحول من الارض التي كان يقوم فيها بالمعصيه لكيلا تغلب عليه بحكم العاده في افعاله قبل ذلك. </b>',
'<b>٦- فضيلة مصاحبة اهل التقوى والعلم والصلاح وما تنطوي عليه من خير.  </b>',
'<b>٧- مجانبة اهل المعاصي ومقاطعتهم ما داوموا على حالهم خشية اللحاق بهم.</b>',
'<b> ٨- على الحاكم اذا تعارضت عنده الاحوال وتعددت البيانات ان يستدل بالقرائن للترجيح.</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '10': {
    title: 'الحديث التاسع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-22.m4a',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith9-1.png', '/images/bab2/ryad-bab2-hadith9-2.png', '/images/bab2/ryad-bab2-hadith9-3.png', '/images/bab2/ryad-bab2-hadith9-4.png', '/images/bab2/ryad-bab2-hadith9-5.png', '/images/bab2/ryad-bab2-hadith9-6.png', '/images/bab2/ryad-bab2-hadith9-7.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
  <li><b> عير قريش: </b> <span>   الإبل بأحمالها.</span></li>
      <li><b> ورّى بغيرها: </b> <span>  سترها وكنى عنها وأوهم يريد غيرها. </span></li>
      <li><b>ورّى: </b> <span> اخف مقصده واظهر غيره.   </span></li>
      <li><b> تبوك:</b> <span>  اسم موضع.  </span></li>
      <li><b> تخلّف: </b> <span>  لم يخرج معه الى الجهاد. </span></li>
      <li><b> ليلة العقبة:</b> <span>   هي الليلة التي بايع فيها الانصار النبي على الاسلام وان يؤيدوه وينصروه. </span></li>
       <li><b>  تواثقنا:</b> <span>  تبايعنا وتعاهدنا. </span></li>
      <li><b> مفازاً:</b> <span>   في الفلاة التي لا ماء فيها. </span></li>
       <li><b> فجلّى: </b> <span>  كشف وأوضح المقصد الذي يريده من غير تورية. </span></li>
      <li><b> ليتأهبوا:</b> <span>  ليستعدوا بما يحتاجون اليه في سفرهم.  </span></li>
       <li><b>  الأهبة:</b> <span> العدة.  </span></li>
      <li><b> طابت:</b> <span>   أينعت ونضجت. </span></li>
       <li><b> اصعر: </b> <span>  اميل. </span></li>
      <li><b>جهازي: </b> <span>  حاجيات سفري.  </span></li>
        <li><b> ممغوصاً: </b> <span>  مطعوناً في دينه. </span></li>
      <li><b>برداه: </b> <span>  الازار او الرداء.  </span></li>
        <li><b> لمزه: </b> <span>  طعنه.  </span></li>
      <li><b> عطفيه:</b> <span>  جانبيه (كناية على العجب والكِبر).  </span></li>
        <li><b> بثي: </b> <span>  اشد من الحزن.  </span></li>
      <li><b>ظهرك: </b> <span>  الظهر هي الابل التي تركب.  </span></li>
        <li><b> تنكرت: </b> <span>  تغيرت. </span></li>
      <li><b> اجلدهم:</b> <span>  اقواهم.  </span></li>
        <li><b> جفوة: </b> <span>  إعراض. </span></li>
      <li><b>حائط: </b> <span>  بستان.  </span></li>
        <li><b> نبطي: </b> <span>  فلاح وسمي بذلك لانه يستنبط الماء.  </span></li>
      <li><b> اوفى:</b> <span>   صعد وارتفع.  </span></li>
        <li><b> سلع: </b> <span> جبل في المدينة.  </span></li>
      <li><b> انخلع:</b> <span>  اتصدق.   </span></li>
        <li><b> ابلاه الله: </b> <span>  انعم عليه.  </span></li>
      <li><b>ساعة العسرة: </b> <span>  وقت الشدة.  </span></li>
       <li><b> أرجأ: </b> <span>  أخّر. </span></li>
      <li><b> الديوان:</b> <span>  الدفتر الذي يكتب فيه اسماء الجيش واهل العطاء.   </span></li>
       <li><b>  تفارط الغزو:</b> <span>  فات وقته وتقدم.  </span></li>
      <li><b>مبيضاً: </b> <span>  لابس البياض.  </span></li>
       <li><b> فأجمعت صدقه: </b> <span>  عزمت عليه. </span></li>
      <li><b> جدلاً:</b> <span>   مقابلة الحجة بالحجة. </span></li>
       <li><b> يؤنبوني: </b> <span>  المبالغة في التوبيخ والتعنيف. </span></li>
      <li><b>اسارقه النظر: </b> <span>   اختلس النظر اليه.  </span></li>
       <li><b> هوان: </b> <span>  الخزي. </span></li>
      <li><b> مضيعة:</b> <span>   الموضع الذي يضيع فيه الانسان ولا يعرف قدره.  </span></li>
       <li><b> فسجرتها: </b> <span>  الايقاد في التنور. </span></li>
      <li><b> فآذن الناس:</b> <span>   اعلمهم. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن الراوي ',
    box1Items: [
    '<b>الراوي:عبد الله بن كعب الانصاري السلمي.</b> <br> ١. ابو فضالة.<br> ٢. من كبار التابعين.  <br> ٣. ثقة جليل. <br> ٤. روى عن عمر وعثمان وعلي وجابر بن عبد الله وابن عباس. <br> ٥. كعب ابوه كان يكنى ابا البشير فكناه رسول الله ابو عبد الله بولده هذا فهو اكبر اولاده. <br> ٦. كان وصي أبيه. <br>  ٧. توفي في خلافة سليمان بن عبد الملك. <br>    ٨. كعب بن مالك: ابو عبد الله الانصاري الخزرجي السلمي ... شاعر رسول الله ... وأحد الثلاثة الذين خلفوا فتاب الله عليهم.  <br> ٩. شهد بيعة العقبة. <br>  ١٠. آخى النبي بينه وبين طلحة بن عبد الله.<br>  ١١. ذهب بصره في خلافة معاوية ... ولم يتخلف عن رسول الله الا في غزوة بدر وتبوك. <br> ١٢. يقول كعب: لما انكشفنا يوم أحد ، كنت أول من عرف رسول الله وبشرت به المسلمين انه حيّاً سوياً وانا في الشِّعب ... فدعا رسول الله كعباً بلأمته وكانت صفراء فلبسها كعب ولبس النبي مرة لأمة كعب ... وقاتل قتالاً شديداً حتى جرح 17 جرح. <br>  ١٣. كان من شعراء النبي: حسان بن ثابت ، وكعب بن مالك ، وعبد الله بن رواحة. <br> ١٤. كعب كان يخوف المشركين الحرب ، اما حسان فكان يذكر عيوبهم وأيامهم ، وابن رواحة كان يعيرهم بكفرهم.    '
    ],
    box2Title: '📌  فوائد الحديث', 
    box2Items: [
    '<b> ١- عِظم امر المعصية.</b>',
'<b> ٢- صراحة المسلم وصدقه واعترافه بتقصيره وعدم تلفيق الاعذار.</b>',
'<b> ٣- رد غيبة المسلم غير المتهم بالباطل وجواز مدح المرء بما فيه من الخير اذا أمِن الفتنة.</b>',
'<b>٤- التاسف والبكاء على ما فات من الخير وأنَّ المرء اذ لاحت له فرصة في الطاعة فحقه ان يبادر اليها ولا يسوّف حتى لا يحرم منها. </b>',
'<b> ٥- فضيلة الصدق وملازمته وان كان فيه مشقة.</b>',
'<b>٦- التنبيه على اجتناب المعاصي.  </b>',
'<b> ٧- الورع و الاحتياط بمجانبة ما يخاف منه الوقوع في منهي عنه.</b>',
'<b>٨- تبريد حرّ المعصية بالتأسّي بالنظير. </b>',
'<b> ٩- استحباب صلاة ركعتين في المسجد للقادم من السفر.</b>',
'<b> ١٠- يعامل الانسان على الظاهر ويترك الباطن لله. </b>',
'<b>١١- وجوب إيثار طاعة الله ورسوله على مودة الصديق والقريب. </b>',
'<b>١٢- جواز إحراق ورقة فيها ذكر الله تعالى لمصلحة. </b>',
'<b>١٣- استحباب هجران اهل المعاصي والبدع الظاهرة وترك السلام عليهم ومقاطعتهم تحقيراً لمعصيتهم  وزجراً لهم. </b>',
'<b>١٤- استحباب القيام للقادم إكراماً له إن كان من أهل الفضل. </b>',
'<b> ١٥- استحباب التبشير بالخير وإكرام المبشر واستحباب تهنئة من رزقه الله خيراً ظاهراً.</b>',
'<b>١٦- استحباب سجود شكر عند تجدد نعمة ظاهرة او اندفاع بلية ظاهرة. </b>',
'<b> ١٧- استحباب التصديق بشيء صالح من ماله شكراً لله على احسانه.</b>',
'<b> ١٨- كراهية التصديق بجميع المال خشية إلا يصبر على الضائقة.</b>'

    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '11': {
    title: 'الحديث العاشر:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-22.m4a',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith10.png'],
        imageRotations: [1],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
            <li><b>  اصبت حدّاً: </b> <span> فعلت ما يعاقب عليه بحد.</span></li>
      <li><b> فشدت: </b> <span>  جمعت اطرافها لتستتر.  </span></li>
      <li><b> فقال له عمر:</b> <span>  مستجلياً للحكمة وليس منكراً.  </span></li>
      <li><b> سبعين: </b> <span>   من العصاة.  </span></li>
      <li><b> لوسعتهم: </b> <span>   لكفتهم في رفع اثامهم. </span></li>
      <li><b> جادت بنفسها: </b> <span>    بذلتها لمرضاة الله تعالى. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌 نبذة عن الراوي ',
    box1Items: [
   '<b>الراوي: عمران بن الحصين.</b> <br> ١. ابو نجيد الخزاعي.  <br>  ٢. من علماء الصحابة. <br> ٣. اسلم هو وابوه عام خيبر سنة 7 هجري <br> ٤. وكانت معه راية خزاعة يوم فتح مكة. <br> ٥. بعثه عمر الى البصرة ليفقههم. <br>٦. اعتزل الفتنة وقال: (وددت أني رماد تذروني الرياح). <br> ٧. كان مجاب الدعوة. <br>٨. كان في مرضه تسلم عليه الملائكة ، فاكتوي ففقد التسليم ثم عاد اليه ، فأصيب باستسقاء فطال به سنين كثيرة وهو صابر عليه وشق بطنه وثقب له سرير فبقي عليه 30 سنة. <br>٩. ويعرض عليه الكي فيأبى حتى قبل وفاته بستنين اكتوى فما عادت سلمت عليه وكان يقول: (اكتوينا فما افلحن ولا انجحن). '
    ],
    box2Title: '📌  فوائد الحديث', 
    box2Items: [
'<b>١- الجلد ثابت في كتاب الله على البكر ، والرجم ثابت بسنه رسول الله على الثيب.</b> <br> (الشيخ والشيخة إذا زنيا فارجموهما البتة)',
'<b>٢- من خُلُق المؤمن التألم والندم اذا فرط بالذنب وحرصه على تطهير نفسه من لوثة الاثم ولو كان في ذلك هلاكه ليلقي الله وهو عنه راض.</b>',
'<b> ٣- بيان عظمه التوبة وانها تمحو الذنب وتلحق التائب بمن لم يقترف شيئاً من الذنب.</b> ',
'<b> ٤- الحامل من الزنى لا تجلد ولا ترجم حتى تضع حملها لئلا تقتل جنينها. </b>',
'<b>٥- جواز الصلاه على المرجوم. </b>',
'<b>٦- العقوبه الدنيويه تكفر الذنب اذا اقترن بالندم والتوبة. </b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '12': {
    title: 'الحديث الحادي عشر:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-23.m4a',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith11.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
      <li><b>لا يملأ فاه إلا التراب:</b> <span> كناية عن الموت فكأنه لا يشبع من الدنيا حتى يموت ...<br>  وذكر التراب لأن المرء لا ينقضي طعمه حتى يموت ...<br>  فإذا مات كان من شأنه أن يدفن فإذا دفن صب عليه التراب فملأ جوفه وفاه عيناه.</span></li>
      <li><b> ويتوب الله على من تاب: </b> <span>   الله يقبل التوبه من الحريص على التوبه. </span></li>
     
      </ul>
    </div>
  `,
    box1Title: '📌  فوائد الحديث ',
    box1Items: [
    '<b>١. حرص بني آدم على جمع المال وغيره من متاع الدنيا وهذا حرص مذموم ، اذا كان فيه تضييع للطاعة وانشغال القلب بالدنيا اكثر من الاخرة. </b>',
'<b>٢. من يسال الله في كل ساعة توسعة الدنيا لينفقها على الخلق فلا حرج ... فحكم من يطلب من الله كثره الدنيا لينفقها حُكم من يطلب من الله كثرة الاعمال الصالحة ← لان كليهما عبادة. </b>',
'<b> ٣. على الانسان ان يتذكر الموت ليقطع طعمه من الدنيا.</b>',
'<b> ٤. باب التوبه مفتوح (إن ربك واسع المغفرة).</b>',
'<b>٥. لا يمكن للانسان ان يتخلص من صفاته المذمومة الا بالرجوع الى الله وطلب المغفرة منه. </b>',
    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
  '13': {
    title: 'الحديث الثاني عشر:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-2/hadith-24.mpeg',
    imageUrls: [ '/images/bab2/ryad-bab2-hadith12.png'],
    imageRotations: [-2],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
    <li><b> يضحك:  </b> <span>   الله اعلم بهذا الضحك … <br> <b>المراد بالضحك بالنسبة لله </b>  دليل على محبته لفعلهما والرضا عنه والثواب عليه. </span></li>
      </ul>
    </div>
  `,
    box1Title: '📌فوائد الحديث ',
    box1Items: [
  '<b>١- كل من قتل في سبيل الله فهو في الجنة. </b>',
'<b>٢- وجوب التوبة من الذنب مهما كبر وعدم اليأس من رحمة الله. </b>',
'<b>٣- الاسلام يمحو ما قبله من جريمة الكفر والتوبة تمحو ما قبلها من الآثام. </b> ',

    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }
    
}