export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي مُوسَى عَبْدِ اللهِ بنِ قَيْسٍ الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ ﷺ قَالَ:', start: 0, end: 8.7 },
  { text: '«إِنَّ اللهَ تَعَالَى يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ،', start: 8.8, end: 13.6 },
  { text: 'وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ اللَّيْلِ،', start: 13.7, end: 17 },
  { text: 'حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا»', start: 17.1, end: 20}
],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b> يضحك:  </b> <span>   الله اعلم بهذا الضحك … <br> <b>المراد بالضحك بالنسبة لله </b>  دليل على محبته لفعلهما والرضا عنه والثواب عليه. </span></li>
      </ul>
    </div>
  
  `,
  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-16.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>١- كل من قتل في سبيل الله فهو في الجنة. </b>',
'<b>٢- وجوب التوبة من الذنب مهما كبر وعدم اليأس من رحمة الله. </b>',
'<b>٣- الاسلام يمحو ما قبله من جريمة الكفر والتوبة تمحو ما قبلها من الآثام. </b> ',

];






