export const hadithDetails = {

 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رضي الله عنه', start: 0, end: 4.7 },
    { text: 'قَالَ: قَالَ رَسُولُ اللهِ ﷺ:', start: 4.8, end: 8.2 },
    { text: '«إِنَّ اللهَ لَا يَنْظُرُ إِلَى أَجْسَامِكُمْ،', start: 8.3, end: 11.3 },
    { text: 'وَلَا إِلَى صُوَرِكُمْ،', start: 11.4, end: 12.5 },
    { text: 'وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ', start: 12.6, end: 15}
  ],
 
  // رابط صوت متن الحديث السادس
 audioUrl: 'audio/ryad-bab-1/hadith-7.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> ابو هريره. ',
  '• اسمه عبد شمس فاسماه رسول الله عبد الرحمن وكناه اباه هريره نسبا لهره معه.',
  '•اسلم في السنه السادسه للهجره. ',
  '•كان من اهل الصفه.',
  '•اكثر رواه للاحاديث عند رسول الله. ',
  '•من يبسط رداءه حتى اقضي مقالتي ثم يقبضه اليه فلن ينسى شيئا سمعه مني فكان ابوه هريره من بسط رداءه (فلم ينسى بعدها شيء). ',
  '•دعا له النبي ان يحببه الله الى المؤمنين. ',
  '•كان يقسم الليل هو وزوجته وخادمه في قيام الليل كله. ',
  '• كان يسبح كل اليوم ١٢ الف تسبيحه',

 
];

export const hadithFawaedList = [
'• <b>  القلب موضع نظر الرب فعلى المسلم ان يهتم بقلبه فيطهره ويزينه لئلا يرى الله الا المحمود والصالح في قلبه.</b>',
'• <b>  الاعمال الظاهره لا تحصل بالتقوى انما التقوى تقع في القلب ونحصل عليها من خشيه الله والشعور بمراقبته. </b>',
'• <b> مجازات العبد ومحاسبته فيما يقع في قلبه من نيه. </b>',
'• <b> على المسلم ان لا يحكم على الناس لمجرد الظاهر بصلاح المظهر والصوره فليحكم على ما ظهر منه من عمل صالح. </b>',
'• <b>الاعتناء بصلاح القلب مقدم على عمل الجوارح لان عمل القلب يصحح الاعمال الظاهره.</b>',
'• <b> معامل الناس بظاهر اعمالهم ونترك سرائرهم لله.</b>'
];