export const hadithDetails = {
  title: 'الحديث الأول',
  name: '[الأعمال بالنيات]',
  hintText: 'اجعل عملك خالص لله',
  phrases: [
    // 💡 هنا ينطق العنوان في أول ثانيتين
    { text: 'الْحَدِيثُ الْأَوَّلُ: الْأَعْمَالُ بِالنِّيَّاتِ.', start: 0, end: 3.5 },

    // يبدأ عَنْ أَمِيرِ الْمُؤْمِنِينَ...
    { text: 'عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ:', start: 3.6, end: 12 },
    { text: '«إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ،', start: 12.1, end: 14.5 },
    { text: 'وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى؛', start: 14.6, end: 17 },
    { text: 'فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللهِ وَرَسُولِهِ،', start: 17.1, end: 22 },
    { text: 'وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا».', start: 22.1, end: 26 },
    { text: 'أَوْ امْرَأَةٍ يَنْكِحُهَا.', start: 26.1, end: 28 },
    { text: 'فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ».', start : 28.1, end: 31.0}, 
    // 💡 ينطق التخريج بالعربي فقط، ثم يبدأ الصمت حتى نهاية الملف
    { text: 'رواه إماما المحدثين: ' , start : 31.1, end: 33.0},
    { text:' أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بردزبة البخاري، ', start: 33.1, end: 40.0 },
    { text:' وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري رضي الله عنهما', start: 40.1, end: 48 },
    { text:' في صحيحيهما اللذين هما أصح الكتب المصنفة', start: 48.1, end: 53 }
    
  ],
  // الشرح والمفردات التي تظهر عند الضغط على الحديث
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>النيه لغه:</b> <span>قصد الشيء</span></li>
        <li><b>النية اصطلاحا:</b> <span>قصد الشيء مقترنا بفعله</span></li>
        <li><b>لكل امرئ:</b> <span>تشمل كل الناس ذكر او انثى</span></li>
        <li><b> هجرته - الهجرة لغة: </b> <span>الترك</span></li>
        <li><b>الهجرة اصطلاحا:</b> <span>ترك دار الكفر الى دار الاسلام</span></li>
        <li><b>فهجرته الى الله ورسوله:</b> <span>اي وقع الاجر وقبلت النية</span></li>
        <li><b>لدنيا يصيبها:</b> <span>اي عمل ينوي به غير الآخرة</span></li>
        <li><b>سميت بالدنيا:</b> <span>اما دنو منزله لانها ادنى من الاخره او دنو زمن لانها تاتي قبلها</span></li>
        <li><b>او امرأة ينكحها:</b> <span>يتزوجها ليس فيها اجر الهجرة</span></li>
        <li><b>الهجره كانت من الامور العظيمه في الاسلام:</b> <span>لذلك وضعها سيدنا عمر تاريخا للمسلمين لان الامم اعتادت ان تؤرخ باحداثها العظام فلم يجد سيدنا عمر اعظم من الهجره فكانت مبدأ تاريخ المسلمين</span></li>
      </ul>
    </div>
  `,
  // 💡 NYTT: Den exakta, stabila direktlänken från Archive.org
  audioUrl: 'audio/hadith/01.mpeg'
};


// 📌 باکس 1: فوائد الحديث (Omgjord till ren array för matning i *ngFor)
export const hadithImportanceList = [
  'لا يعتد بالاعمال بدون نيه',
  'الهجره واجبه من دار الكفر الى دار الايمان اذا لم يستطع ان يقوم المسلم بامور دينه',
  'انعقاد الاجر حتى لو لم يقم صاحبه به',
  'اساس العمل الاخلاص لله وحده',
  'كل عمل مباح يصبح قربى لله اذا كان خالصا لله'
];

