import { Verse, Section, QuizQuestion, QuizAnswer } from '../../../../../models/surah.model';
export const verses: Verse[] =[
{ number: 1, text: 'عَمَّ يَتَسَاءَلُونَ', tafsir: ' عن أي شيء يتساءلون من أمر <b>القيامة</b>.' },
{ number: 2, text: 'عَنِ ٱلنَّبَإِ ٱلْعَظِيمِ', tafsir: '<b>النبأ العظيم</b> يعني الخبر <b>الهائل</b> <b> المُفْظِع</b> <b>الباهر</b> أو <b>البعث بعد الموت</b>  أو <b>القرآن</b>.' },
{ number: 3, text: 'ٱلَّذِي هُمْ فِيهِ مُخْتَلِفُونَ', tafsir: 'يعني الناس فيه على قولين: <b>مؤمن</b> به و<b> كافر</b>.' },
{ number: 4, text: 'كَلَّا سَيَعْلَمُونَ', tafsir: 'تهديد شديد ووعيد أكيد لمنكري <b>القيامة</b>.' },
{ number: 5, text: 'ثُمَّ كَلَّا سَيَعْلَمُونَ', tafsir: 'تأكيد <b>للوعيد</b> و<b>التهديد</b>.' },
{ number: 6, text: 'أَلَمۡ نَجۡعَلِ ٱلۡأَرۡضَ مِهَٰدٗا', tafsir: 'أي: ممهدة للخلائق ذلولاً لهم, قارة ساكنة لاتتحرك.' },
{ number: 7, text: 'وَٱلْجِبَالَ أَوْتَادًا', tafsir: 'جعل للأرض <b> أوتادا</b>. أي: أرساها وثبتها و قررها حتى <b>سكنت ولم تضطرب بمن عليها </b>.' },
{ number: 8, text: 'وَخَلَقْنَاكُمْ أَزْوَاجًا', tafsir: 'أي <b>ذكرا</b> و<b>أنثى</b>.' },
{ number: 9, text: 'وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا', tafsir: 'أي: <b>قطعا للحركة</b> لتحصل <b>الراحة</b> من كثرة الترداد والسعي في المعايش في عرض النهار.' },
{ number: 10, text: 'وَجَعَلْنَا ٱلَّيْلَ لِبَاسًا', tafsir: 'أي يغشى الناس <b>ظلامه</b> ويكون <b> سكنا </b>.' },
{ number: 11, text: 'وَجَعَلْنَا ٱلنَّهَارَ مَعَاشًا', tafsir: 'جعلناه  <b>مشرقا </b> <b> نيرا </b> <b>مضيئا</b>  ليتمكن الناس من التصرف فيه والذهاب والمجيء للمعاش والتكسب والتجارات وغير ذلك.' },
{ number: 12, text: 'وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا', tafsir: 'يعني <b> السموات السبع</b> في اتساعها وارتفعاها وإحكامها وإتقانها وتزيينها بالكواكب الثوابت والسيارات.' },
{ number: 13, text: 'وَجَعَلْنَا سِرَاجًا وَهَّاجًا', tafsir: 'يعني <b>الشمس المنيرة</b> على جميع العالم التي يتوهج ضوءها لأهل الأرض كلهم.' },
{ number: 14, text: 'وَأَنْزَلْنَا مِنَ ٱلْمُعْصِرَاتِ مَاءً ثَجَّاجًا', tafsir: '<b>المعصرات</b>: السحاب، و<b>ثجاجا</b>: مُنصَباً بكثرة.' },
{ number: 15, text: 'لِّنُخْرِجَ بِهِۦ حَبًّا وَنَبَاتًا', tafsir: 'لنخرج بهذا الماء الكثير الطيب النافع المبارك <b> حبا </b> يدخر للأناسي والأنعام، <b> ونباتا </b> أي : خضرا يؤكل رطبا.' },
{ number: 16, text: 'وَجَنَّاتٍ أَلْفَافًا', tafsir: '<b>وجنات </b> أي : بساتين وحدائق من ثمرات متنوعة، وألوان مختلفة، وطعوم وروائح متفاوتة، وإن كان ذلك في بقعة واحدة من الأرض مجتمعا، ولهذا قال : <b> وجنات ألفافا </b> أي: مجتمعة.' },
{ number: 17, text: 'إِنَّ يَوْمَ ٱلْفَصْلِ كَانَ مِيقَاتًا', tafsir: 'يقول تعالى مخبرا عن يوم الفصل، وهو يوم<b> القيامة</b>، أنه مؤقت بأجل معدود، لا يزاد عليه ولا ينقص منه، ولا يعلم وقته على التعيين إلا الله - عز وجل.' },
 { number: 18, text: 'يَوْمَ يُنْفَخُ فِي ٱلصُّورِ فَتَأْتُونَ أَفْوَاجًا', tafsir: `
    تفسير: <b>النفخة في الصور</b> تعني بدء يوم القيامة، حيث تأتي كل أمة مع رسولها <b>أفواجا</b> - زمرا.
    <br> <br>
    <details style="margin-top:5px; font-size:0.85em; color:#444;">
      <summary style="cursor:pointer; color:#b88a00;">📜 عرض الحديث</summary>
      <em>
        عن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: 
        "ما بين النفختين أربعون". قالوا: أربعون يوما؟ قال: "أبيت". قالوا: أربعون شهرا؟ قال: "أبيت". قالوا: أربعون سنة؟ قال: "أبيت". 
        قال: "ثم ينزل الله من السماء ماء فينبتون كما ينبت البقل، ليس من الإنسان شيء إلا يبلى، إلا عظما واحدا، وهو عجب الذنب، ومنه يركب الخلق يوم القيامة".
        <br>
        الراوي: أبو هريرة | المحدث: البخاري | المصدر: صحيح البخاري | الصفحة أو الرقم: 4935 | خلاصة حكم المحدث: <b>صحيح</b> | التخريج: أخرجه البخاري (4935)، ومسلم
      </em>
    </details>
    <br>
    <a href="https://dorar.net/hadith/sharh/35003" target="_blank" style="color: blue; text-decoration: underline;">رابط الحديث وشرحه في موقع الدرر السنية</a>
    `},
{ number: 19, text: 'وَفُتِحَتِ ٱلسَّمَآءُ فَكَانَتْ أَبْوَابًا', tafsir: 'أي: طرقا ومسالك لنزول الملائكة.' },
  { number: 20, text: 'وَسُيِّرَتِ ٱلْجِبَالُ فَكَانَتْ سَرَابًا', tafsir: 
    `
    تفسير: كقوله : <b>وترى الجبال تحسبها جامدة وهي تمر مر السحاب</b> [النمل : 88] وكقوله : <b>وتكون الجبال كالعهن المنفوش</b> [القارعة : 5].
    <br>
    وقال هاهنا : <b>فكانت سرابا</b> أي : يخيل إلى الناظر أنها شيء، وليست بشيء، بعد هذا تذهب بالكلية، فلا عين ولا أثر.
   `},
{ number: 21, text: 'إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا', tafsir: `<b>مرصادًا</b> أي مرصدة معدة. وقال الحسن: "يعني أنه لا يدخل أحد الجنة حتى يجتاز بالنار، فإن كان معه جواز نجا وإلا احتبس".` },
{ number: 22, text: 'لِلطَّاغِينَ مَآبًا', tafsir:  `<b>للطاغين</b> وهم المردة العصاة المخالفون للرسل، <b>مآبا</b> أي مرجعا ومتقلبا ومصيرا ونزلا.` },
{ number: 23, text: 'لَّابِثِينَ فِيهَآ أَحْقَابًا', tafsir:  ` أي ماكثين فيها أحقابا، وهي جمع <b>حقب</b>، وهو المدة من الزمان.` },
{ number: 24, text: 'لَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا', tafsir: 'أي لا يجدون في جهنم بردا لقلوبهم ولا شرابا طيبا يتغذون به.' },
{ number: 25, text: 'إِلَّا حَمِيمًا وَغَسَّاقًا', tafsir: `استثنى من البرد الحميم ومن الشراب الغساق.  <br>  <b>الحميم</b>: هو الحار الذي قد انتهى حره وحموه. <br> <b>الغساق</b>: ما اجتمع من صديد أهل النار وعرقهم ودموعهم وجروحهم، فهو بارد لا يُطاق من برده، ولا يواجه من نتنه.`},
{ number: 26, text: 'جَزَآءً وِفَاقًا', tafsir: 'أي هذا الذي صاروا إليه من هذه العقوبة وفق أعمالهم الفاسدة التي كانوا يعملونها في الدنيا.' },
{ number: 27, text: 'إِنَّهُمْ كَانُوا۟ لَا يَرْجُونَ حِسَابًا', tafsir: 'أي لم يكونوا يعتقدون أن ثم دارا يجازون فيها ويحاسبون.' },
{ number: 28, text: 'وَكَذَّبُوا۟ بِـَٔايَاتِنَا كِذَّابًا', tafsir: 'وكانوا يكذبون بحجج الله ودلائله على خلقه التي أنزلها على رسله ، فيقابلونها بالتكذيب والمعاندة .وقوله : <b> كذابا </b> أي : تكذيبا.' },
{ number: 29, text: 'وَكُلَّ شَيْءٍ أَحْصَيْنَٰهُ كِتَٰبًا', tafsir: 'أي وقد علمنا أعمال العباد كلهم وكتبناهم عليهم وسنجزيهم على ذلك إن خيرا فخير وإن شرا فشر.' },
{ 
  number: 30, 
  text: 'فَذُوقُوا۟ فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا', 
  tafsir: `
    تفسير: يُقال لأهل النار: <b>ذوقوا ما أنتم فيه</b> من العذاب، <b>فلن نزيدكم إلا عذابًا</b>،من جنسه، وآخر من شكله.
    <br>
    <details style="margin-top:5px; font-size:0.85em; color:#444;">
    <summary style="cursor:pointer; color:#b88a00;">📜 عرض الحديث</summary>
      <em>قال قتادة:
        عن أبي أيوب الأزدي، عن عبد الله بن عمرو قال:  
        "لم يُنزل على أهل النار آية أشد من هذه:  
        (<b>فذوقوا فلن نزيدكم إلا عذابًا</b>)،  
        قال: فهم في مزيد من العذاب أبدًا."
        <br>
      </em>
    </details>
  `},
{ number: 31, text: 'إِنَّ لِلْمُتَّقِينَ مَفَازًا', tafsir: 'يقول تعالى مخبرا عن السعداء وما أعد لهم من الكرامة والنعيم: "<b>إن للمتقين مفازا</b>" أي : فازوا فنجوا من النار.' },
{ number: 32, text: 'حَدَآئِقَ وَأَعْنَابًا', tafsir: 'الحدائق و البساتين من النخيل وغيرها.' },
{ number: 33, text: 'وَكَوَاعِبَ أَتْرَابًا', tafsir: 'أي: وحورا من النساء.  "كواعب" أي: نواهد.' },
{ number: 34, text: 'وَكَأْسًا دِهَاقًا', tafsir: 'مملوءة متتابعة صافية.' },
{ number: 35, text: 'لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّٰبًا', tafsir: 
    `
   كقوله : <b> ( لا لغو فيها ولا تأثيم )  </b> [ الطور : 23 ] . <br> 
     أي : ليس فيها كلام لاغ عار عن الفائدة ، ولا إثم كذب ، بل هي دار السلام ، وكل ما فيها سالم من النقص.
 `},
{ number: 36, text: 'جَزَآءً مِّن رَّبِّكَ عَطَآءً حِسَابًا', tafsir: 'أي : هذا الذي ذكرناه جازاهم الله به وأعطاهموه، بفضله ومنه وإحسانه ورحمته. <b>عطاء حسابا</b> أي : كافيا وافرا شاملا كثيرا.' },
{ number: 37, text:'رَّبِّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ٱلرَّحْمَٰنِ لَا يَمْلِكُونَ مِنْهُ خِطَابًا',  tafsir: `يخبر تعالى عن عظمته وجلاله ، وأنه رب السموات والأرض وما فيهما وما بينهما ، وأنه الرحمن الذي شملت رحمته كل شيء . <br> وقوله : <b> لا يملكون منه خطابا </b> أي : لا يقدر أحد على ابتداء مخاطبته إلا بإذنه.` },
{ number: 38, text: 'يَوْمَ يَقُومُ ٱلرُّوحُ وَٱلْمَلَٰٓئِكَةُ صَفًّاۖ لَّا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ ٱلرَّحْمَٰنُ وَقَالَ صَوَابًا', tafsir: `
    اختلف المفسرون في المراد بـ <b>الروح</b> هاهنا.<br>
    <b>أحدهم قال:</b> أنهم أرواح بني آدم.<br>
    <b>الثاني:</b> هم بنو آدم.<br>
    <b>الثالث:</b> أنهم خلق من خلق الله، على صور بني آدم، وليسوا بملائكة ولا ببشر، وهم يأكلون ويشربون.<br>
    <b>الرابع:</b> هو جبريل.<br>
    <b>الخامس:</b> أنه القرآن.<br>
    <b>السادس:</b> أنه ملك من الملائكة بقدر جميع المخلوقات.<br>
    قوله: (<b>يوم يقوم الروح</b>) قال: هو ملك عظيم من أعظم الملائكة خلقا.<br>
    وتوقف <i>ابن جرير</i> فلم يقطع بواحد من هذه الأقوال كلها، وقال <i>ابن كثير</i>: أنهم بنو آدم.<br>
    وقوله: (<b>إلا من أذن له الرحمن</b>) كقوله: (<b>لا تكلم نفس إلا بإذنه</b>) [هود: 105].<br>
    وكما ثبت في الصحيح: "ولا يتكلم يومئذ إلا الرسل".<br>
    وقوله: (<b>وقال صوابا</b>) أي: حقا، ومن الحق: "لا إله إلا الله".
  ` },
{ number: 39, text: 'ذَٰلِكَ ٱلْيَوْمُ ٱلْحَقُّۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ مَـَٔابًا', tafsir: '<b>ذلك اليوم الحق :</b> أي الكائن لا محالة. <br> <b>فمن شاء اتخذ إلى ربه مابا :</b> أي : مرجعا وطريقا يهتدي إليه ومنهجا يمر به عليه.' },
{ number: 40, text: 'إِنَّآ أَنذَرْنَٰكُمْ عَذَابًا قَرِيبًاۖ يَوْمَ يَنظُرُ ٱلْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ ٱلْكَافِرُ يَـٰلَيْتَنِى كُنتُ تُرَٰبًا', tafsir: 
    `
    وقوله: (<b>إنا أنذرناكم عذابا قريبا</b>) يعني: <i>يوم القيامة</i>، لتأكد وقوعه صار قريبا، لأن كل ما هو آت آت.<br>
    (<b>يوم ينظر المرء ما قدمت يداه</b>) أي: يعرض عليه جميع أعماله، خيرها وشرها، قديمها وحديثها.<br>
    (<b>ويقول الكافر يا ليتني كنت ترابا</b>) أي: يود الكافر يومئذ أنه كان في الدار الدنيا ترابا، ولم يكن خلق، ولا خرج إلى الوجود.<br>
    وذلك حين عاين عذاب الله، ونظر إلى أعماله الفاسدة قد سطرت عليه بأيدي الملائكة <i>السفرة الكرام البررة</i>.
  `}
];

  // fråga till quiz-komponenten
export const alnabbaQuestions: QuizQuestion[] = [
  {
  question: "ما المقصود بالجبال أوتادًا؟",
  answers: [
    { text: "أنها تعطي الأرض لونًا جميلاً", isCorrect: false },
    { text: "أنها تضيء في الليل", isCorrect: false },
    { text: "أنها تثبت الأرض كالوتد للخيمة", isCorrect: true },
    { text: "أنها مصدر للمطر", isCorrect: false }
  ]
},
{
  question: "لماذا ذكر الله خلق الأزواج في السورة؟",
  answers: [
    { text: "للتشجيع على الزواج", isCorrect: false },
    { text: "لبيان الفرق بين البشر والملائكة", isCorrect: false },
    { text: "لإظهار اختلاف الألوان", isCorrect: false },
    { text: "للتذكير بقدرة الله على الخلق", isCorrect: true }
  ]
},
{
  question: "إلى ماذا يشير قوله تعالى: 'وفجرنا من المعصرات ماءً ثجاجًا'؟",
  answers: [
    { text: "المطر الغزير النازل من السحاب", isCorrect: true },
    { text: "الماء الجوفي", isCorrect: false },
    { text: "ماء البحر", isCorrect: false },
    { text: "الثلوج الذائبة", isCorrect: false }
  ]
},
{
  question: "ماذا ينتج عن الماء الكثير المذكور في السورة؟",
  answers: [
    { text: "الفيضانات", isCorrect: false },
    { text: "الأنهار فقط", isCorrect: false },
    { text: "الحب والنبات والجنات", isCorrect: true },
    { text: "الثلوج", isCorrect: false }
  ]
},
{
  question: "متى يكون يوم الفصل الذي ذكر في السورة؟",
  answers: [
    { text: "يوم غزوة بدر", isCorrect: false },
    { text: "ليلة الإسراء", isCorrect: false },
    { text: "أول أيام الخلق", isCorrect: false },
    { text: "يوم القيامة", isCorrect: true }
  ]
},
{
  question: "ماذا يحدث عندما يُنفخ في الصور؟",
  answers: [
    { text: "تأتي الأمم جماعات مع رسلها", isCorrect: true },
    { text: "تسقط الأمطار", isCorrect: false },
    { text: "ينزل القرآن", isCorrect: false },
    { text: "تتحرك الجبال", isCorrect: false }
  ]
},
{
  question: "ما معنى قوله: 'كانت سرابًا' عن الجبال؟",
  answers: [
    { text: "أنها تصبح أكبر", isCorrect: false },
    { text: "أنها تتلاشى ولا يبقى لها أثر", isCorrect: true },
    { text: "أنها تتحول إلى أنهار", isCorrect: false },
    { text: "أنها تضيء كالشمس", isCorrect: false }
  ]
},
{
  question: "من هم المآب المعد لهم جهنم في السورة؟",
  answers: [
    { text: "المؤمنون الصادقون", isCorrect: false },
    { text: "الطاغون العصاة", isCorrect: true },
    { text: "الملائكة", isCorrect: false },
    { text: "الشهداء", isCorrect: false }
  ]
},
{
  question: "ما جزاء المتقين المذكور في السورة؟",
  answers: [
    { text: "قصور من ذهب في الدنيا", isCorrect: false },
    { text: "شهرة ومحبة بين الناس", isCorrect: false },
    { text: "القوة والعافية", isCorrect: false },
    { text: "حدائق وأعناب وكواعب أتراب", isCorrect: true }
  ]
},
{
  question: "ما المقصود بالكأس دهاقًا في السورة؟",
  answers: [
    { text: "شراب ممتلئ لا ينقص", isCorrect: true },
    { text: "كأس صغير من الذهب", isCorrect: false },
    { text: "وعاء للطعام", isCorrect: false },
    { text: "وعاء للماء المالح", isCorrect: false }
  ]
},
{
  question: "كيف يكون موقف الملائكة والروح يوم القيامة كما ورد في السورة؟",
  answers: [
    { text: "جماعات متفرقة", isCorrect: false },
    { text: "فردًا فردًا", isCorrect: false },
    { text: "صفوف منتظمة", isCorrect: true },
    { text: "راكبين على الخيل", isCorrect: false }
  ]
},
{
  question: "متى يتكلم الناس يوم القيامة؟",
  answers: [
    { text: "عندما يأذن الله لمن يشاء", isCorrect: true },
    { text: "عند دخول الجنة", isCorrect: false },
    { text: "عند خروجهم من القبور", isCorrect: false },
    { text: "عند الحساب فقط", isCorrect: false }
  ]
},
{
  question: "ماذا يقول من أذن له الرحمن بالكلام يوم القيامة؟",
  answers: [
    { text: "أنا بريء من الذنوب", isCorrect: false },
    { text: "أدخلني الجنة", isCorrect: false },
    { text: "لا إله إلا الله", isCorrect: true },
    { text: "لم أعمل سوءًا", isCorrect: false }
  ]
},
{
  question: "ما سبب قرب يوم القيامة في التعبير القرآني؟",
  answers: [
    { text: "لأنه يحدث كل عام", isCorrect: false },
    { text: "لأن كل ما هو آت فهو قريب", isCorrect: true },
    { text: "لأنه يحدث في الليل", isCorrect: false },
    { text: "لأنه يحدث فجأة في أي لحظة", isCorrect: false }
  ]
},
{
  question: "ما الذي يراه المرء يوم القيامة كما ذكر في السورة؟",
  answers: [
    { text: "أهله وأقاربه", isCorrect: false },
    { text: "الملائكة فقط", isCorrect: false },
    { text: "أشجار الجنة", isCorrect: false },
    { text: "أعماله التي قدمها", isCorrect: true },
  ]
},
{
  question: "لماذا يتمنى الكافر أن يكون ترابًا؟",
  answers: [ 
    { text: "ليعود إلى الحياة الدنيا", isCorrect: false },
    { text: "ليصبح غير مرئي", isCorrect: false },
    { text: "ليهرب من العذاب", isCorrect: true },
    { text: "ليرتاح في الجنة", isCorrect: false }
  ]
},
    
];


export const  rubtTassweerySections : Section[] =[
    {
     title: '❓ السؤال عن النبأ العظيم',
     description: 'تبدأ السورة بسؤال يهز القلوب: عن أي أمر عظيم يختلف الناس؟ إنهم سيعرفون حقيقته قريبًا، فلا مجال للغفلة.',
     verseNumbers: [1, 2, 3, 4, 5]
    },
    {
      title: '🌍 آيات الخلق وعظمة الله',
      description: 'مشاهد الكون من أرض ممهدة وجبال راسيات وليل ساتر ونهار معاش، كلها دلائل مهيبة على قدرة الله و لتذكير الغافلين بأن خالق هذا النظام قادر على البعث، وإعداد الكون ليوم الفصل.',
      verseNumbers: [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
    },
    {
      title: '⏳ يوم الفصل والحساب',
      description: 'ينتقل الخطاب مباشرة من دلائل القدرة إلى مشهد يوم القيامة/الفصل ، نفخ الصور، فتح السماء، وسير الجبال، ونهاية الكافرين في جهنم.',
      verseNumbers: [17,18, 19, 20, 21, 22]
    },
    {
      title: '🔥 عذاب الكافرين وجزاؤهم',
      description: 'حرمان تام من الراحة والشراب الطيب، جزاءً وفاقًا لتكذيبهم وعنادهم، وتأكيد أن عذابهم لا يزيد إلا شدة.',
      verseNumbers: [ 23, 24, 25, 26, 27, 28, 29, 30]
    },
    {
      title: '🌿 جزاء المتقين ونعيم الجنة',
 description: 'في المقابل، يُعرض مشهد آخر يفيض جمالًا وسكينة: جنة, شراب لذيذ وصحبة طيبة… جزاءً من رب رحيم لمن اتقاه.',
     verseNumbers: [ 31, 32, 33, 34, 35, 36]
    },
    {
      title: 'ختام السورة بعظمة الله والحساب الأخير',
      description: 'مشهد ختامي يذكّر بعظمة رب السماوات والأرض، ويوم يقوم الروح والملائكة صفًّا، حيث لا يتكلم أحد إلا بإذن، وينتهي الحساب لكل نفس بندم الكافر وتمنّيه لو كان ترابًا.',
      verseNumbers: [ 37,  38, 39, 40]
    }
  ]
;
