export const hadithDetails = {
  title: 'الحديث الثَّالِثَ عَشَرَ',
  name: '[أُخُوَّةُ الإِيمَانِ وَالإِسْلَامِ]',
  hintText: ' الحديث ظاهره التساوي ولكن حقيقته التفاضل ، فاذا احب لاخيه مثله فقد دخل هو في جمله المفضولين.',
  phrases: [
    { text: 'الحديث الثَّالِثَ عَشَرَ: أُخُوَّةُ الإِيمَانِ وَالإِسْلَامِ' , start: 0, end: 6 },
    { text: 'عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ ، خَادِمِ رَسُولِ اللهِ ﷺ ، ', start: 6.1, end: 14.6 },
    { text : 'عَنِ النَّبِيِّ ﷺ قَالَ:'  , start: 14.7, end: 18.2 },
      { text : '« لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ».'  , start: 18.3, end: 24.2 },
    { text:  'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ. ', start: 24.3, end: 27 }
  ],
  
  // الشرح والمفردات
  explanation: `
  <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لا يؤمن:</b> <span>الايمان الكامل.</span></li>
        <li><b>احدكم:</b> <span>كل من يدعى الايمان والاسلام منكم.</span></li>
        <li><b>يحب لاخيه:</b> <span>من الطاعات والاشياء المباحة.</span></li>
        <li><b>اخيه:</b> <span>اخوه في الاسلام او اخوه في الانسانيه.</span></li>
        <li><b>ما يحب لنفسه:</b> <span>مثل الذي يحبه لنفسه من الخير.</span></li>
      </ul>
      <p class="explanation-note" style="margin-top: 15px; line-height: 1.6; text-align: right;">
        الحديث ظاهره التساوي ولكن حقيقته التفاضل ، فاذا احب لاخيه مثله فقد دخل هو في جمله المفضولين.
      </p>
    </div>
  `,
  audioUrl: 'audio/hadith/13.mpeg'
};

export const hadithImportanceList = [
'✓ <b>الراوي:</b> ابي حمزه انس بن مالك رضي الله عنه ، والده مالك بن النظر مات كافرا ، وامه ام سليم بنت ملحان.',
  '✓ انصاري خزرجي ، يلتقي نسبه من النبي ﷺ في اخواله من بني النجار.',
  '✓ اتت به امه الى النبي ﷺ حتى يخدمه ، فخدم النبي ﷺ 10 سنوات ، وكان عمره عندما هاجر النبي ﷺ الى المدينه 10 سنوات.',
  '✓ دعا له النبي ﷺ( اللهم اكثر ماله وولده وبارك له فيما اعطيته) وكان عنده 80 صبي وابنتان واحفاده 120.',
  '✓ كان من مكثري الروايه عن النبي ﷺ حيث ياتي بالمرتبه الثالثه بعد ابي هريره وابن عمر ، روى عن النبي ﷺ 2286 حديث.',
  '✓ اصيب بالبرص في نهايه حياته ، ومر بمحنه مع الحجاج حيث ختمه الحجاج في عنقه "عتيق الحجاج".',
  '✓ اخر الصحابه وفاه في البصره ، حيث توفي وعمره 103 سنوات في خلافه الوليد بن عبد الملك ، سنه 90 هجري.',
  '✓ ما رايت احدا اشبه في صلاه رسول الله ﷺ من ابن ام سليم.'
]; 

// 📝 الصندوق الثاني: من فوائد الحديث الشريف
export const hadithFawaedList = [
  '١. ان يجتهد المسلم في اصلاح اخيه المسلم',
  '٢. محبه الخير للناس',
  '٣. الايمان يزيد وينقص ، ومحبه الخير للناس من شعب الايمان',
  '٤. المؤمن للمؤمن كالنفسى الواحده (مَثَلُ المؤمنين في توادِّهم وتراحمهم وتعاطفهم كمثل الجسد الواحد؛ إذا اشتكى منه عضوٌ تداعى له سائر الجسد بالسهر والحمّى)',
  '٥. من الايمان ان يبغض لاخيه ما يبغض لنفسه من الشر.'

];
