export const hadithDetails = {

 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  { text: 'عَنْ أَبِي إِسْحَاقَ سَعْدِ بْنِ أَبِي وَقَّاصٍ الْقُرَشِيِّ الزُّهْرِيِ رضي الله عنه', start: 0, end: 6.6},
    { text: ':أَحَدِ الْعَشَرَةِ الْمَشْهُودِ لَهُمْ بِالْجَنَّةِ رضي الله عنهم، قَالَ', start: 6.7, end: 11.9},
    { text: '، جَاءَنِي رَسُولُ اللهِ ﷺ', start: 12, end: 15 },
    { text: 'يَعُودُنِي عَامَ حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ اشْتَدَّ بِي', start: 15.1, end: 19.6 },
    { text: '، فَقُلْتُ: يَا رَسُولَ اللهِ،', start: 19.7, end: 21.2 },
    { text: 'إِنِّي قَدْ بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى،', start: 21.3, end: 24.7 },
    { text: 'وَأَنَا ذُو مَالٍ، وَلَا يَرِثُنِي إِلَّا ابْنَةٌ لِي،', start: 24.8, end: 29 },
    { text: 'أَفَأَتَصَدَّقُ بِثُلُثَيْ مَالِي؟ قَالَ: «لَا».', start: 29.1, end: 33.5 },
    { text: 'قُلْتُ: فَالشَّطْرُ يَا رَسُولَ اللهِ؟', start: 33.6, end: 35.7},
    { text: 'فَقَالَ: «لَا».', start: 35.8, end: 36.2 },
    { text: 'قُلْتُ: فَالثُّلُثُ يَا رَسُولَ اللهِ؟', start: 36.3, end: 39},
    { text: 'قَالَ: «الثُّلُثُ،', start: 39.1, end: 40.2 },
    { text: 'وَالثُّلُثُ كَثِيرٌ ـ أَوْ: كَبِيرٌ ـ إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ', start: 40.3, end: 45.2 },
    { text: 'خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ', start: 45.3, end: 50.2 },
    { text: '، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللهِ إِلَّا أُجِرْتَ عَلَيْهَا،', start: 50.3, end: 56.7 },
    { text: 'حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ». قَالَ:', start: 56.8, end: 60.2},
    { text: 'فَقُلْتُ: يَا رَسُولَ اللهِ،', start: 60.3, end: 62.5},
    { text: 'أُخَلَّفُ بَعْدَ أَصْحَابِي', start: 62.6, end: 64 },
    { text: '؟ قَالَ: «إِنَّكَ لَنْ تُخَلَّفَ، فَتَعْمَلَ عَمَلًا تَبْتَغِي بِهِ وَجْهَ اللهِ،', start: 64.1, end: 69.2},
    { text: 'إِلَّا ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً،', start: 69.3, end: 72.5 },
    { text: 'وَلَعَلَّكَ أَنْ تُخَلَّفَ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ،', start: 72.6, end: 79 },
    { text: 'اللَّهُمَّ أَمْضِ لِأَصْحَابِي هِجْرَتَهُمْ وَلَا تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ،', start: 79.1, end: 84 },
    { text: 'لَكِنِ الْبَائِسُ سَعْدُ بْنُ خَوْلَةَ»', start: 84.1, end: 87},
    { text: '. يَرْثِي لَهُ رَسُولُ اللهِ ﷺ أَنْ مَاتَ بِمَكَّةَ. مُتَّفَقٌ عَلَيْهِ', start: 87.1, end: 94 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>يعودني:</b> <span> يزورني </span></li>
        <li><b>وجع:</b> <span> اسم جامع لكل مرض. </span></li>
         <li><b>الشطر:</b> <span>النصف.</span></li>
         <li><b>تذر:</b> <span>تدع.</span></li>
         <li><b>العالة:</b> <span>الفقراء.</span></li>
         <li><b>يرثي له:</b> <span>يرحمه.</span></li>
         <li><b>يتكففون الناس:</b> <span>يتساءلون ما في ايديهم.</span></li>
         <li><b>لعلك:</b> <span>للترجي ومن الله امر واقع. .</span></li>
         <li><b>البائس:</b> <span>من اشتدت حاجته واشتد حزنه.</span></li>
         <li><b>امضِ:</b> <span>اتمم.</span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/ryad-bab-1/hadith-6.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> سعد بن ابي وقاص. ',
  '• اول من اسلم وكان عمره ١٧ سنه.',
  '•(هذا خالي فليرني امرؤ خاله) ابن عم ام رسول الله ﷺ واقارب الام اخوال.',
  '• (ارمِ سعدُ فداكَ أبي وأمي) في يوم احد. ',
  '•  اول من رمى بسهم في الاسلام. ',
  '•  اول من اراق دمًا في سبيل الله.',
  '• احد العشره المبشرين بالجنه.',
  '•  فتح العراق. ',
  '•  مجاب الدعوه.',
  '•  اخر المهاجرين موتاً.',
 
];

export const hadithFawaedList = [
  '• <b> استحباب عياده المريض للامام.</b>',
  '• <b> الدعاء للمريض بالشفاء والدعاء عنده بخير رجاء الاستجابه.</b>',
'• <b> اباح الجميع المال الحلال.</b>',
'• <b>الحث على صله الارحام والاحسان الى الاقارب والشفق على الورثه.</b>',
'• <b>استحباب الانفاق في وجوه الخير.</b>',
'• <b> فضيله طول العمر للازدياد من الاعمال الصالحه.</b>',
'• <b>من ترك شيئا لله لا ينبغي الرجوع فيه.</b>',
'• <b>هذا الحديث من جمله الاخبار عن المغيبات عند رسول الله ﷺ.</b>',
'• <b>الصدقه والوصيه لا يجوز اكثر من الثلث.</b>',
];