import { Verse, Section, QuizQuestion, QuizAnswer } from '../../../../../models/surah.model';

  // verser
export const verses: Verse[] =[
  { "number": 1, "text": "إِذَا ٱلسَّمَآءُ ٱنفَطَرَتۡ", "tafsir": "<b>انفطرت</b>: أي انشقت." },
  { "number": 2, "text": "وَإِذَا ٱلۡكَوَاكِبُ ٱنتَثَرَتۡ", "tafsir": " <b>انتثرت</b>: أي تساقطت." },
  { "number": 3, "text": "وَإِذَا ٱلۡبِحَارُ فُجِّرَتۡ", "tafsir": "أي: اختلطت ببعضها وأصبحت بحراً واحداً الملح والعذب سواء." },
  { "number": 4, "text": "وَإِذَا ٱلۡقُبُورُ بُعۡثِرَتۡ", "tafsir": "<b>القبور بعثرت</b>: قلب ترابها وبعث موتاها." },
  { "number": 5, "text": "عَلِمَتۡ نَفۡسٞ مَّا قَدَّمَتۡ وَأَخَّرَتۡ", "tafsir": "أي: من الأعمال وما أخرت منها فلم تعمله وذلك عند قراءتها كتاب أعمالها." },
  { "number": 6, "text": "يَٰٓأَيُّهَا ٱلۡإِنسَٰنُ مَا غَرَّكَ بِرَبِّكَ ٱلۡكَرِيمِ", "tafsir": "<b>ما غرك بربك</b>: أي: أي شيء خدعك وجرّأك على عصيانه." },
  { "number": 7, "text": "ٱلَّذِي خَلَقَكَ فَسَوَّىٰكَ فَعَدَلَكَ", "tafsir": "<b>الذي خلقك</b>:  أي بعد أن لم تكن.<b> فسواك</b>: أي جعلك مستوى الخلقة سالم الأعضاء. <b>فعدلك</b>: أي جعلك معتدل الخلق متناسب الأعضاء ليست يد أطول أو رجل أطول من الأخرى." },
  { "number": 8, "text": "فِيٓ أَيِّ صُورَةٖ مَّا شَآءَ رَكَّبَكَ", "tafsir": " يعني: الله رَكَّبَك في أي صورة شاء، مِن الناس مَن هو جميل، ومنهم مَن هو قبيح، ومنهم المتوسط، ومنهم الأبيض، ومنهم الأحمر، ومنهم الأسود، ومنهم ما بين ذلك، أيّ صورة يُرَكِّبُك الله عز وجل على حسب مشيئته، ولكنه عز وجل شاء للإنسان أن تكون صورته أحسن الصور." },
  { "number": 9, "text": "كَلَّا بَلۡ تُكَذِّبُونَ بِٱلدِّينِ", "tafsir": "أي: مع هذا الوعظ والتذكير، لا تزالون مستمرين على التكذيب بالجزاء." },
  { "number": 10, "text": "وَإِنَّ عَلَيۡكُمۡ لَحَٰفِظِينَ", "tafsir": "الإنسان عليه حافظ يحفظه، ويكتب كل ما عمل،  يكتبون كل ما قال، كل ما فعل، وهؤلاء الحفظة كرام ليسوا لئامًا، بل عندهم من الكرم ما ينافي أن يَظْلِمُوا أحدًا فيكتبوا عليه ما لم يعمل، أو يُهْدِرُوا ما عمل؛ لأنهم موصوفون بالكرم." },
  { "number": 11, "text": "كِرَامٗا كَٰتِبِينَ", "tafsir": "كاتبين: لأعمالكم خيرها وشرها، حسنها وقبيحها." },
  { "number": 12, "text": "يَعۡلَمُونَ مَا تَفۡعَلُونَ", "tafsir": "إما بالمشاهدة إن كان فعلًا، وإما بالسماع إن كان قولًا، بل إن عمل القلب يُطْلِعُهُم الله عليه. " },
  { "number": 13, "text": "إِنَّ ٱلۡأَبۡرَارَ لَفِي نَعِيمٖ", "tafsir": "يخبر تعالى عمَّا يصير الْأَبرار إِليه من النَّعيمِ، وهم الَّذين أطاعوا اللَّه عزَّ وجلَّ، ولم يقابلوه بالمعاصي. "},
  { "number": 14, "text": "وَإِنَّ ٱلۡفُجَّارَ لَفِي جَحِيمٖ", "tafsir": "هذا ما يَصِيرُ إِلَيْهِ الْفُجَّارُ مِنَ الْجَحِيمِ وَالْعَذَابِ الْمُقِيمِ." },
  { "number": 15, "text": "يَصۡلَوۡنَهَا يَوۡمَ ٱلدِّينِ", "tafsir": " أَيْ: يَوْمَ الْحِسَابِ وَالْجَزَاءِ وَالْقِيَامَةِ." },
  { "number": 16, "text": "وَمَا هُمۡ عَنۡهَا بِغَآئِبِينَ", "tafsir": "أَيْ: لَا يَغِيبُونَ عَنِ الْعَذَابِ سَاعَةً وَاحِدَةً، وَلَا يُخَفَّفُ عَنْهُمْ مِنْ عَذَابِهَا، وَلَا يُجَابُونَ إِلَى مَا يَسْأَلُونَ مِنَ الْمَوْتِ أَوِ الرَّاحَةِ، وَلَوْ يَوْمًا وَاحِدًا." },
  { "number": 17, "text": "وَمَآ أَدۡرَىٰكَ مَا يَوۡمُ ٱلدِّينِ", "tafsir": "﴾ تَعْظِيمٌ لِشَأْنِ يَوْمِ الْقِيَامَةِ" },
  { "number": 18, "text": "ثُمَّ مَآ أَدۡرَىٰكَ مَا يَوۡمُ ٱلدِّينِ", "tafsir": " ثُمَّ أَكَّدَهُ بِقَوْلِهِ: ﴿ثُمَّ مَا أَدْرَاكَ مَا يَوْمُ الدِّينِ﴾" },
  { "number": 19, "text": "يَوۡمَ لَا تَمۡلِكُ نَفۡسٞ لِّنَفۡسٖ شَيۡـٔٗاۖ وَٱلۡأَمۡرُ يَوۡمَئِذٖ لِّلَّهِ", "tafsir": "ثُمَّ فَسَّرَهُ بِقَوْلِهِ: ﴿يَوْمَ لَا تَمْلِكُ نَفْسٌ لِنَفْسٍ شَيْئًا وَالأمْرُ يَوْمَئِذٍ لِلَّهِ﴾ أَيْ:لَا يَقْدِرُ وَاحِدٌ(٢) عَلَى نَفْعِ أَحَدٍ وَلَا خَلَاصِهِ مِمَّا هُوَ فِيهِ، إِلَّا أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشَاءُ وَيَرْضَى." }
]
;


  // fråga till quiz-komponenten
export const InfitarQuestions: QuizQuestion[] = [

  {
    question: "ما معنى قوله تعالى ﴿إِذَا ٱلسَّمَآءُ ٱنفَطَرَتۡ﴾؟",
    answers: [
      { text: "أي انشقت وتصدعت", isCorrect: true },
      { text: "أي احترقت وتبددت", isCorrect: false },
      { text: "أي ارتفعت في السماء", isCorrect: false },
      { text: "أي أظلمت تمامًا", isCorrect: false }
    ]
  },
  {
    question: "ماذا تعني كلمة ﴿ٱنتَثَرَتۡ﴾ في قوله تعالى: ﴿وَإِذَا ٱلۡكَوَاكِبُ ٱنتَثَرَتۡ﴾؟",
    answers: [
      { text: "اجتمعت وتلألأت أكثر", isCorrect: false },
      { text: "اختفت وراء السحب", isCorrect: false },
      { text: "تحولت إلى شهب", isCorrect: false },
      { text: "تساقطت وتناثرت من أماكنها", isCorrect: true },
    ]
  },
  {
    question: "ما المقصود بـ﴿وَإِذَا ٱلۡبِحَارُ فُجِّرَتۡ﴾؟",
    answers: [
      { text: "أي غارت مياهها وجفت", isCorrect: false },
      { text: "أي اختلط بعضها ببعض فصارت بحراً واحداً", isCorrect: true },
      { text: "أي امتلأت بالحيوانات", isCorrect: false },
      { text: "أي تغير لونها وصارت حمراء", isCorrect: false }
    ]
  },
  {
    question: "ما معنى قوله تعالى ﴿وَإِذَا ٱلۡقُبُورُ بُعۡثِرَتۡ﴾؟",
    answers: [
      { text: "نُسفت القبور وتطاير ترابها", isCorrect: false },
      { text: "انقلب ترابها وأخرجت موتاها", isCorrect: true },
      { text: "أغلقت القبور على أصحابها", isCorrect: false },
      { text: "امتلأت بالنار", isCorrect: false }
    ]
  },
  {
    question: "في قوله تعالى ﴿عَلِمَتۡ نَفۡسٞ مَّا قَدَّمَتۡ وَأَخَّرَتۡ﴾، ما المقصود بما قدمت وأخرت؟",
    answers: [
      { text: "الأعمال التي عملتها أو تركتها", isCorrect: true },
      { text: "المال الذي أنفقته", isCorrect: false },
      { text: "الأولاد والأقارب", isCorrect: false },
      { text: "الأشياء التي نسيها الإنسان", isCorrect: false }
    ]
  },
  {
    question: "ما معنى قوله تعالى ﴿مَا غَرَّكَ بِرَبِّكَ ٱلۡكَرِيمِ﴾؟",
    answers: [
      { text: "أي أيّ شيء خدعك حتى عصيت ربك الكريم", isCorrect: true },
      { text: "أي من جعلك تؤمن بربك", isCorrect: false },
      { text: "أي ما الذي جعلك تتقِ الله", isCorrect: false },
      { text: "أي من أنقذك من العقاب", isCorrect: false }
    ]
  },
  {
    question: "ما المقصود بقوله تعالى ﴿ٱلَّذِي خَلَقَكَ فَسَوَّىٰكَ فَعَدَلَكَ﴾؟",
    answers: [
      { text: "أي منحك القوة والشجاعة", isCorrect: false },
      { text: "أي جعلك غنيًّا في الأرض", isCorrect: false },
      { text: "أي جعلك تحفظ القرآن", isCorrect: false },
      { text: "أي جعلك معتدل الخلقة متناسب الأعضاء", isCorrect: true }
    ]
  },
  {
    question: "في قوله ﴿فِيٓ أَيِّ صُورَةٖ مَّا شَآءَ رَكَّبَكَ﴾، ما المقصود؟",
    answers: [
      { text: "أن الله يختار شكل الإنسان كما يشاء", isCorrect: true },
      { text: "أن الإنسان يختار صورته بنفسه", isCorrect: false },
      { text: "أن جميع الناس متشابهون", isCorrect: false },
      { text: "أن الصورة لا علاقة لها بقدرة الله", isCorrect: false }
    ]
  },
  {
    question: "ما معنى قوله تعالى ﴿كَلَّا بَلۡ تُكَذِّبُونَ بِٱلدِّينِ﴾؟",
    answers: [
      { text: "أي تؤمنون بيوم الحساب", isCorrect: false },
      { text: "أي تنكرون وجود الله", isCorrect: false },
      { text: "أي تستهزئون بالرسل فقط", isCorrect: false },
      { text: "أي تستمرون في التكذيب بالبعث والجزاء", isCorrect: true }
    ]
  },
  {
    question: "من هم ﴿ٱلۡحَٰفِظِينَ كِرَامٗا كَٰتِبِينَ﴾ الذين ورد ذكرهم؟",
    answers: [
      { text: "العلماء الصالحون", isCorrect: false },
      { text: "الملائكة الذين يكتبون أعمال العباد", isCorrect: true },
      { text: "الأنبياء والرسل", isCorrect: false },
      { text: "الصحابة رضي الله عنهم", isCorrect: false }
    ]
  },
  {
    question: "ما دلالة قوله تعالى ﴿يَعۡلَمُونَ مَا تَفۡعَلُونَ﴾؟",
    answers: [
      { text: "أن الناس يراقبون بعضهم", isCorrect: false },
      { text: "أن الله وحده يعلم أعمالهم", isCorrect: false },
      { text: "أن الملائكة يعلمون كل فعل وقول بإذن الله", isCorrect: true },
      { text: "أن الشياطين تسجل السيئات فقط", isCorrect: false }
    ]
  },
  {
    question: "ما مصير الأبرار كما ورد في السورة؟",
    answers: [
      { text: "في نعيم ورضوان من الله", isCorrect: true },
      { text: "في عذاب مؤقت", isCorrect: false },
      { text: "في انتظار الحساب", isCorrect: false },
      { text: "في نار خفيفة", isCorrect: false }
    ]
  },
  {
    question: "بماذا توعّد الله الفجار في السورة؟",
    answers: [
      { text: "أنهم سيغفر لهم سريعًا", isCorrect: false },
      { text: "أنهم في جحيم لا يغيبون عنها", isCorrect: true },
      { text: "أنهم يعذبون قليلًا ثم يخرجون", isCorrect: false },
      { text: "أنهم ينجون من النار بعمل يسير", isCorrect: false }
    ]
  },
  {
    question: "ما المقصود بقوله تعالى ﴿يَوۡمَ لَا تَمۡلِكُ نَفۡسٞ لِّنَفۡسٖ شَيۡـٔٗاۖ وَٱلۡأَمۡرُ يَوۡمَئِذٖ لِّلَّهِ﴾؟",
    answers: [
      { text: "أن الناس يتعاونون لإنقاذ بعضهم", isCorrect: false },
      { text: "أن الشفاعة تكون للجميع بلا شرط", isCorrect: false },
      { text: "أن الإنسان يعتمد على قوته", isCorrect: false },
      { text: "أنه لا أحد يملك نفع أحد إلا بإذن الله", isCorrect: true }
    ]
  }
];


export const  rubtTassweerySections : Section[] =[
  {
    title: 'شاهد انهيار الكون وبداية القيامة',
    description: 'تصوِّر السورة مشاهد عظيمة من بداية يوم القيامة: السماء تنشق، والكواكب تتناثر، والبحار تتفجّر، والقبور تنقلب ويُبعث من فيها. عندها تدرك كل نفس ما قدمت من عمل وما تركت.',
    verseNumbers: [1,2,3,4,5]
  },
   {
    title: ' ⚠️ عتاب الإنسان الغافل عن ربه الكريم',
    description: '  توجِّه الآيات خطابًا مؤثرًا إلى الإنسان: “ ما غرك بربك الكريم؟ ” تذكّره بخلق الله له وتسويته وعدله في صورته، فكيف يقابل هذا الإحسان بالجحود والغفلة؟ ',
    verseNumbers: [6,7,8]
  },
   {
    title: '📜 استمرار التكذيب رغم الموعظة والرقابة الإلهية ',
    description: ' بعد هذا التذكير، يكشف الله سبب الغفلة: “كلا بل تكذبون بالدين.” ثم يذكّر بأن على الإنسان ملائكة كرامًا كاتبين، يراقبون كل قول وفعل، لا يغيب عنهم شيء.',
    verseNumbers: [9, 10, 11, 12]
  },
   {
    title: ' 🌿 مصير الأبرار والفجار',
    description: 'عرض جزاء الناس يوم القيامة: الأبرار في نعيم وسرور دائم، والفجار في جحيم لا يغيبون عنه لحظة ولا يجدون منه راحة. ',
    verseNumbers: [13,14,15, 16]
  },
   {
    title: '⏳ تعظيم يوم الدين وبيان سلطان الله المطلق ',
    description: ' يُختَم المشهد بتعظيم شأن يوم الدين وتأكيد عجز الجميع عن نفع بعضهم: “يوم لا تملك نفس لنفس شيئًا، والأمر يومئذٍ لله.”  إنه ختام مهيب يبيّن أن كل سلطة دنيوية تزول، ولا يبقى إلا حكم الله وعدله.',
    verseNumbers: [17,18,19]
  }
];