export const hadithDetails = {

 phrases: [
{ text: 'عَنْ أَبِي سَعِيدٍ - سَعْدِ بْنِ مَالِكِ بْنِ سِنَانٍ - الخُدْرِيِّ رضي الله عنه: أَنَّ نَبِيَّ اللهِ ﷺ قَالَ:', start: 0, end: 0 },
  { text: '«كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْساً،', start: 0, end: 0 },
  { text: 'فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ،', start: 0, end: 0 },
  { text: 'فَدُلَّ عَلَى رَاهِبٍ', start: 0, end: 0 },
  { text: '(١)، فَأَتَاهُ فَقَالَ:', start: 0, end: 0 },
  { text: 'إِنَّهُ قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْساً، فَهَلْ لَهُ مِنْ تَوْبَةٍ؟', start: 0, end: 0 },
  { text: 'فَقَالَ: لَا، فَقَتَلَهُ فَكَمَّلَ بِهِ مِئَةً،', start: 0, end: 0 },
  { text: 'ثُمَّ سَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ،', start: 0, end: 0 },
  { text: 'فَدُلَّ عَلَى رَجُلٍ عَالِمٍ،', start: 0, end: 0 },
  { text: 'فَقَالَ: إِنَّهُ قَتَلَ مِئَةَ نَفْسٍ، فَهَلْ لَهُ مِنْ تَوْبَةٍ؟', start: 0, end: 0 },
  { text: 'فَقَالَ: نَعَمْ، وَمَنْ يَحُولُ بَيْنَهُ وَبَيْنَ التَّوْبَةِ؟', start: 0, end: 0 },
  { text: 'انْطَلِقْ إِلَى أَرْضِ كَذَا وَكَذَا،', start: 0, end: 0 },
  { text: 'فَإِنَّ بِهَا أُنَاساً يَعْبُدُونَ اللهَ تَعَالَى فَاعْبُدِ اللهَ مَعَهُمْ،', start: 0, end: 0 },
  { text: 'وَلَا تَرْجِعْ إِلَى أَرْضِكَ فَإِنَّهَا أَرْضُ سُوءٍ.', start: 0, end: 0 },
  { text: 'فَانْطَلَقَ حَتَّى إِذَا نَصَفَ الطَّرِيقَ (٢) أَتَاهُ المَوْتُ،', start: 0, end: 0 },
  { text: 'فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ العَذَابِ،', start: 0, end: 0 },
  { text: 'فَقَالَتْ مَلَائِكَةُ الرَّحْمَةِ:', start: 0, end: 0 },
  { text: 'جَاءَ تَائِباً مُقْبِلاً بِقَلْبِهِ إِلَى اللهِ تَعَالَى،', start: 0, end: 0 },
  { text: 'وَقَالَتْ مَلَائِكَةُ العَذَابِ:', start: 0, end: 0 },
  { text: 'إِنَّهُ لَمْ يَعْمَلْ خَيْراً قَطُّ،', start: 0, end: 0 },
  { text: 'فأَتَاهُمْ مَلَكٌ فِي صُورَةِ آدَمِيٍّ فَجَعَلُوهُ بَيْنَهُمْ،', start: 0, end: 0 },
  { text: 'أَيْ حَكَماً، فَقَالَ: قِيسُوا مَا بَيْنَ الأَرْضَيْنِ،', start: 0, end: 0 },
  { text: 'فَإِلَى أَيَّتِهِمَا كَانَ أَدْنَى فَهُوَ لَهُ.', start: 0, end: 0 },
  { text: 'فَقَاسُوا فَوَجَدُوهُ أَدْنَى إِلَى الأَرْضِ الَّتِي أَرَادَ،', start: 0, end: 0 },
  { text: 'فَقَبَضَتْهُ مَلَائِكَةُ الرَّحْمَةِ»', start: 0, end: 0 },
  { text: 'وَفِي رِوَايَةٍ فِي الصَّحِيحِ:', start: 0, end: 0 },
  { text: '«فَكَانَ إِلَى القَرْيَةِ الصَّالِحَةِ أَقْرَبَ بِشِبْرٍ،', start: 0, end: 0 },
  { text: 'فَجُعِلَ مِنْ أَهْلِهَا» .', start: 0, end: 0 },
  { text: 'وَفِي رِوَايَةٍ فِي الصَّحِيحِ :', start: 0, end: 0 },
  { text: '«فَأَوْحَى اللهُ تَعَالَى إِلَى هَذِهِ: أَنْ تَبَاعَدِي،', start: 0, end: 0 },
  { text: 'وَإِلَى هَذِهِ: أَنْ تَقَرَّبِي،', start: 0, end: 0 },
  { text: 'وَقَالَ: قِيسُوا مَا بَيْنَهُمَا.', start: 0, end: 0 },
  { text: 'فَوَجَدُوهُ إِلَى هَذِهِ أَقْرَبَ بِشِبْرٍ، فَغُفِرَ لَهُ» .', start: 0, end: 0 },
  { text: 'وَفِي رِوَايَةٍ: «فَنَأَى بِصَدْرِهِ نَحْوَهَا».', start: 0, end: 0 }

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b> راهب: </b> <span> المتخلي عن اشغال الدنيا ، والتارك لملاذلها ، والزاهد فيها ، المعتزل لاهله. </span></li>
         <li><b> فنأى بصدره: </b> <span>  بَعُدَ عن الارض التي خرج منها. </span></li>
          <li><b> الارضين:</b> <span>   التي خرج منها والتي ذهب اليها.  </span></li>
           <li><b> أدنى: </b> <span>  اقرب.  </span></li>
            <li><b> نأى: </b> <span>   نهض بجهد ومشقه رغم ثقل ما اصابه من الموت. </span></li>
      </ul>
    </div>

  `,
  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-15.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي: ابو سعيد الانصاري الخدري (مشهور بكنيته).</b> <br> ١. من المكثرين من الرواية ... وأفقه أحداث الصحابه. <br> ٢. غزا مع رسول الله 12 غزوه ، واول غزوة ... غزوة بني المصطلق ، وعمره 15 سنه.  <br> ٣. قال ابو سعيد مات ابي يوم احد ولم يترك لنا مالا ... فاتيت رسول الله اساله شيئا فحين رأني قال: (من استغنى اغناه الله ، ومن يستعفف اعفه الله) فرجعت دون ان اطلب منه.  <br> ٤. توفي يوم الجمعه ودفن في البقيع. '
];




export const hadithFawaedList = [
'<b>١- مشروعيه التوبه من جميع الكبائر حتى من قتل النفس والترغيب بها وعدم اليأس.</b>',
'<b>٢- المفتي قد يجيب بالخطأ وقد يجيب بالصواب. </b>',
'<b> ٣- فضل العالم على العابد. </b> ',
'<b> ٤- حسن الادب في التعامل مع الناس وعدم احتقارهم بسبب ما يصدر منهم من ذنوب. </b>',
'<b>٥. ينبغي للانسان التائب ان يتحول من الارض التي كان يقوم فيها بالمعصيه لكيلا تغلب عليه بحكم العاده في افعاله قبل ذلك. </b>',
'<b>٦- فضيلة مصاحبة اهل التقوى والعلم والصلاح وما تنطوي عليه من خير.  </b>',
'<b>٧- مجانبة اهل المعاصي ومقاطعتهم ما داوموا على حالهم خشية اللحاق بهم.</b>',
'<b> ٨- على الحاكم اذا تعارضت عنده الاحوال وتعددت البيانات ان يستدل بالقرائن للترجيح.</b>'
];























