export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ الأَنْصَارِيِّ خَادِمِ رَسُولِ اللهِ ﷺ رضي الله عنه قَالَ:', start: 0, end: 7.9 },
  { text: 'قَالَ رَسُولُ اللهِ ﷺ:', start: 8, end: 11.5},
  { text: '«للهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ مِنْ أَحَدِكُمْ سَقَطَ عَلَى بَعِيرِهِ وَقَدْ أَضَلَّهُ فِي أَرْضٍ فَلَاةٍ»', start: 11.6, end: 19 },
  { text: 'وَفِي رِوَايَةٍ لِمُسْلِمٍ:', start: 19.1, end: 21 },
  { text: '«للهُ أَشَدُّ فَرَحاً بِتَوْبَةِ عَبْدِهِ، حِينَ يَتُوبُ إِلَيْهِ، مِنْ أَحَدِكُمْ كَانَ عَلَى رَاحِلَتِهِ بِأَرْضٍ فَلَاةٍ،', start: 21, end: 29 },
  { text: 'فَانْفَلَتَتْ مِنْهُ وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ مِنْهَا،', start: 29.1, end: 33.5 },
  { text: 'فَأَتَى شَجَرَةً فَاضْطَجَعَ فِي ظِلِّهَا،', start: 33.6, end: 36.5 },
  { text: 'وَقَدْ أَيِسَ مِنْ رَاحِلَتِهِ،', start: 36.6, end: 38.9 },
  { text: 'فَبَيْنَمَا هُوَ كَذَلِكَ إِذَا هُوَ بِهَا قَائِمَةً عِنْدَهُ،', start: 39, end: 43 },
  { text: 'فَأَخَذَ بِخِطَامِهَا»، ثُمَّ قَالَ مِنْ شِدَّةِ الفَرَحِ:', start: 43.1, end: 46.7 },
  { text: '«اللَّهُمَّ أَنْتَ عَبْدِي وَأَنَا رَبُّكَ، أَخْطَأَ مِنْ شِدَّةِ الفَرَحِ»', start: 46.6, end: 52 },

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b> افرح:  </b> <span>  اشد فرحا. </span></li>
        <li><b>فلاة: </b> <span>  الارض الفقر التي لا ماء فيها. </span></li>
        <li><b>راحلته: </b> <span> الراحله من الابل وهي البعير القوي. </span></li>
        <li><b>اضله: </b> <span> ضيعه. </span></li>
        <li><b>الخطام: </b> <span> حبل ليف او شعر فيجعل في احدى طرفه حلقه ثم يشد فيه الطرف الاخر حتى يصير كالحلقه.   </span></li>
        <li><b>المعنى: </b> <span> الله يفرح بتوبه عبده اعظم واشد من فرحه هذا العبد براحلته التي ظن سبب هلاكه. </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-15.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:</b> انس بن مالك.',
' ١. ابو حمزه الانصاري ',
'٢. خادم رسول الله، ولد بالمدينه',
'٣. خدم النبي 10 سنوات ',
'٤. اخر من مات من الصحابه بالبصره.',
' ٥. قال ثابت: قال لي انس: "هذه شعرة من شعر رسول الله ﷺ فضعها تحت لساني، قال: فوضعتها تحت لسانه، فدُفن وهي تحت لسانه".', 
'٦. دعى له رسول الله (اللهم اكثر ماله وولده وادخله الجنه) فقد رايت اثنين وانتظر الثالثه.',
'٧. كان من صلبه 80 صبي وبنتان وعنده 120 حفيد. ',
'٨. وله بستان يحمل كل سنه مرتين وكان فيه رياحين فهي بريح المسك.',
'٩. قال ابو هريره: ما رايت احدا اشبه صلاتي برسول الله من ابن ام سليم. '
];





export const hadithFawaedList = [
'<b>١- الترغيب بالتوبه والحث عليها. </b>',
'<b>٢- عدم المؤاخذه في الخطا غير المتعمد. </b>',
'<b> ٣- جواز سفر المرء وحده لان الشارع لا يضرب المثل الا بما يجوز. </b> ',
'<b> ٤- ضرب المثل بما يصل الى الافهام من الامور '
];




