export const hadithDetails = {
  title: 'مقدمة',
  hintText: 'باب الاخلاص واحضار النيه في جميع الاعمال والاحوال'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '• <b>الاخلاص:</b> افراد الحق سبحانه وتعالى بالقصد في الطاعات ويزيد بحركته ويكون في سره وعلى نيته التقرب الى الله لا يمازجه نفس او دينا او هوى.',
  '• <b>الاخلاص شريكين الله وبين العبد:</b> لا يعلمه ملك فيكتبه ولا شيطان فيفسده ولا هوى فيميله.',
  '• <b>ابن عطاء يقول:</b> ان الله لا يحب العمل المشترك والقلب المشترك فالعمل المشترك هو لا يقبله والقلب المشترك هو لا يقبل عليه.'
];
