export const hadithDetails = {
  title: 'نسب الرسول محمد ﷺ',
  phrases: [
    { text: ' هو محمّد بن عبد الله بن عبد المطلب بن هاشم بن عبد مناف بن قصيّ بن كلاب بن مُرّة بن كعب بن لؤي بن غالب بن فِهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن مَعَدّ بن عدنان صلوات الله عليه وسلام. ', start: 0, end: 3.5 }

  
  ],
  // الشرح والمفردات التي تظهر عند الضغط على الحديث
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>النيه لغه:</b> <span>قصد الشيء</span></li>
        <li><b>النية اصطلاحا:</b> <span>قصد الشيء مقترنا بفعله</span></li>
        <li><b>لكل امرئ:</b> <span>تشمل كل الناس ذكر او انثى</span></li>
        <li><b> هجرته - الهجرة لغة: </b> <span>الترك</span></li>
        <li><b>الهجرة اصطلاحا:</b> <span>ترك دار الكفر الى دار الاسلام</span></li>
        <li><b>فهجرته الى الله ورسوله:</b> <span>اي وقع الاجر وقبلت النية</span></li>
        <li><b>لدنيا يصيبها:</b> <span>اي عمل ينوي به غير الآخرة</span></li>
        <li><b>سميت بالدنيا:</b> <span>اما دنو منزله لانها ادنى من الاخره او دنو زمن لانها تاتي قبلها</span></li>
        <li><b>او امرأة ينكحها:</b> <span>يتزوجها ليس فيها اجر الهجرة</span></li>
        <li><b>الهجره كانت من الامور العظيمه في الاسلام:</b> <span>لذلك وضعها سيدنا عمر تاريخا للمسلمين لان الامم اعتادت ان تؤرخ باحداثها العظام فلم يجد سيدنا عمر اعظم من الهجره فكانت مبدأ تاريخ المسلمين</span></li>
      </ul>
    </div>
  `,
  // 💡 NYTT: Den exakta, stabila direktlänken från Archive.org
  audioUrl: 'audio/hadith/01.mpeg'
};


// 📌 باکس 1: فوائد الحديث (Omgjord till ren array för matning i *ngFor)
export const hadithImportanceList = [
  'لا يعتد بالاعمال بدون نيه',
  'الهجره واجبه من دار الكفر الى دار الايمان اذا لم يستطع ان يقوم المسلم بامور دينه',
  'انعقاد الاجر حتى لو لم يقم صاحبه به',
  'اساس العمل الاخلاص لله وحده',
  'كل عمل مباح يصبح قربى لله اذا كان خالصا لله'
];

