import { Component } from '@angular/core';
import { CommonModule } from '@angular/common'; 
import { SurahHintComponent } from '../../../surah-hint/surah-hint.component';
import { SurahsStartComponent } from '../../../surahs-start/surahs-start.component';
import { SurahTabsComponent } from '../../../surah-tabs/surah-tabs.component';
import { QuixTafserComponent } from '../../../quix-tafser/quix-tafser.component';
import { FooterInfoComponent } from '../../../footer-info/footer-info.component';
import { FawaedOfSurahComponent } from '../../../fawaed-of-surah/fawaed-of-surah.component';
import { RouterModule } from '@angular/router';


@Component({
  selector: 'app-surah-79',
  standalone: true,
  imports: [
    RouterModule,
    CommonModule,
    SurahHintComponent,
    SurahsStartComponent,
    SurahTabsComponent,
    QuixTafserComponent,
    FooterInfoComponent,
    FawaedOfSurahComponent
  ],
  templateUrl: './surah-79.component.html',
  styleUrl: './surah-79.component.css'
})
export class Surah79Component {
  // flikstyrning
  selectedTab: 'tadabbur' | 'visual' = 'tadabbur';

  // toggling av tafsir
  shown: boolean[] = [];

  // verser
 verses = [
  { number: 1, text: "وَٱلنَّٰزِعَٰتِ غَرۡقٗا", tafsir: "الملائكة التي تنزع <b> أرواح الكفار </b> تنزعها بشدة ." },
  { number: 2, text: "وَٱلنَّٰشِطَٰتِ نَشۡطٗا", tafsir: "الملائكة التي تقبض <b> أرواح المؤمنين</b> بسهولة ويسر." },
  { number: 3, text: "وَٱلسَّٰبِحَٰتِ سَبۡحٗا", tafsir: "الملائكة تسبق إلى <b>أمر الله</b> .عز وجل, ولهذا كانت *الملائكة* أسبق إلى أمر الله وأَقْوَمَ بأمر الله من بني آدم" },
  { number: 4, text: "فَٱلسَّٰبِقَٰتِ سَبۡقٗا", tafsir: "<b>فَالسَّابِقَاتِ</b> لغيرها <b>سَبْقًا</b> فتبادر لأمر الله، وتسبق الشياطين في إيصال الوحي إلى رسل الله حتى لا تسترقه." },
  { number: 5, text: "فَٱلۡمُدَبِّرَٰتِ أَمۡرٗا", tafsir: "<b>الملائكة</b>، الذين وكلهم الله أن يدبروا كثيرا من أمور العالم العلوي والسفلي، من الأمطار، والنبات، والأشجار، والرياح، والبحار، والأجنة، والحيوانات، والجنة، والنار [وغير ذلك]." },
  { number: 6, text: "يَوۡمَ تَرۡجُفُ ٱلرَّاجِفَةُ", tafsir: "وهي قيام الساعة" },
  { number: 7, text: "تَتۡبَعُهَا ٱلرَّادِفَةُ", tafsir: "أي:<b> الرجفة</b>الأخرى التي تردفها وتأتي تلوها"  },
  { number: 8, text: "قُلُوبٞ يَوۡمَئِذٖ وَاجِفَةٌ", tafsir: " خائفة موجفة ومنزعجة من شدة ما ترى وتسمع" },
  { number: 9, text: "أَبۡصَٰرُهَا خَٰشِعَةٞ", tafsir: "أي: ذليلة حقيرة، قد ملك قلوبهم الخوف، وأذهل أفئدتهم الفزع، وغلب عليهم التأسف <b>واستولت عليهم</b> الحسرة" },
  { 
  number: 10, 
  text: "يَقُولُونَ أَءِنَّا لَمَرۡدُودُونَ فِي ٱلۡحَافِرَةِ", 
  tafsir: "المقصود <b>مشركو قريش</b> ومن قال بقولهم في إنكار <b>المعاد</b>، إذ يستبعدون وقوع <b>البعث</b> بعد المصير إلى <b>الحافرة</b> أي: القبور، كما قال <b>مجاهد</b>. وذلك بعد تمزق أجسادهم وتفتت عظامهم ونخورها." 
  },
  { 
  number: 11, 
  text: "أَإِذَا كُنَّا عِظَامًا نَّخِرَةً", 
  tafsir: "يقول الكفار في الدنيا على وجه <b>التكذيب</b>: <b>أَئِذَا كُنَّا عِظَامًا نَّخِرَةً</b> أي: بالية فتاتا." 
  },
  { 
  number: 12, 
  text: "قَالُوا۟ تِلۡكَ إِذࣰا كَرَّةٌ خَاسِرَةࣱ", 
  tafsir: "أي: استبعدوا أن يبعثهم الله ويعيدهم بعدما كانوا <b>عظامًا نخرة</b>، جهلا منهم بقدرة <b>الله</b>، وتجرؤا عليه." 
  },
  { 
  number: 13, 
  text: "فَإِنَّمَا هِیَ زَجۡرَةࣱ وَٰحِدَةࣱ", 
  tafsir: "قال الله في بيان سهولة هذا الأمر عليه: <b>فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ</b>، أي: ينفخ فيها في <b>الصُّور</b>." 
  },
  { 
  number: 14, 
  text: "فَإِذَا هُم بِٱلسَّاهِرَةِ", 
  tafsir: "فإذا الخلائق كلهم <b>بِالسَّاهِرَةِ</b> أي: على وجه الأرض قيام ينظرون، فيجمعهم الله ويقضي بينهم بحكمه العدل ويجازيهم." 
  },
  { 
  number: 15, 
  text: "هَلۡ أَتَىٰكَ حَدِیثُ مُوسَىٰۤ", 
  tafsir: "يقول <b>الله</b> تعالى لنبيه <b>محمد ﷺ</b>: <b>هَلْ أتَاكَ حَدِيثُ مُوسَى</b>، وهذا الاستفهام عن أمر عظيم متحقق وقوعه." 
  },
  { 
  number: 16, 
  text: " إِذۡ نَادَىٰهُ رَبُّهُۥ بِٱلۡوَادِ ٱلۡمُقَدَّسِ طُوًى",
  tafsir: "أي: هل أتاك حديثه <b>إِذْ نَادَاهُ رَبُّهُ بِالْوَادِي الْمُقَدَّسِ طُوًى</b>، وهو المحل الذي كلمه <b>الله</b> فيه، وامتن عليه بالرسالة، واختصه بالوحي والاجتباء." 
  },
  { 
  number: 17, 
  text: "ٱذۡهَبۡ إِلَىٰ فِرۡعَوۡنَ إِنَّهُۥ طَغَىٰ", 
  tafsir: " أي: فانهه عن طغيانه وشركه وعصيانه، بقول لين وخطاب لطيف، لعله <b>يتذكر أو يخشى</b>." 
  },
  { 
  number: 18, 
  text: "فَقُلۡ هَل لَّكَ إِلَىٰۤ أَن تَزَكَّىٰ", 
  tafsir: " أي: هل لك في خصلة حميدة، ومحمدة جميلة، يتنافس فيها أولو الألباب، وهي أن تزكي نفسك وتطهرها من دنس الكفر والطغيان، إلى <b>الإيمان والعمل الصالح</b>؟" 
  },
  { 
  number: 19, 
  text: "وَأَهۡدِیَكَ إِلَىٰ رَبِّكَ فَتَخۡشَىٰ", 
  tafsir: "<b>وَأَهْدِيَكَ إِلَى رَبِّكَ</b> أي: أدلك عليه، وأبين لك مواقع رضاه من مواقع سخطه. <b>فَتَخْشَى</b> الله إذا علمت الصراط المستقيم، فامتنعَ فرعونُ مما دعاه إليه موسى." 
  },
  { 
  number: 20, 
  text: "فَأَرَىٰهُ ٱلۡأٓيَةَ ٱلۡكُبۡرَىٰ", 
  tafsir: "أي:<b> جنس الآية الكبرى</b>، فلا ينافي تعددها: <b>فَأَلْقَى عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُبِينٌ وَنَزَعَ يَدَهُ فَإِذَا هِيَ بَيْضَاءُ لِلنَّاظِرِينَ</b>." 
  },
  { number: 21, text: "فَكَذَّبَ وَعَصَىٰ", tafsir: " <b>فَكَذَّبَ </b> بالحق <b>وَعَصَى</b> الأمر " },
  { number: 22, text: "ثُمَّ أَدۡبَرَ يَسۡعَىٰ", tafsir: " أي: يجتهد في مبارزة الحق ومحاربته" },
  { number: 23, text: "فَحَشَرَ فَنَادَىٰ", tafsir: "  <b>فَحَشَرَ</b> جنوده أي: جمعهم <b>فَنَادَى</b> فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ" },
  { 
  number: 24, 
  text: "فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ", 
  tafsir: "<b>فَقَالَ</b> لهم: <b>أَنَا رَبُّكُمُ الْأَعْلَى</b>، فأذعنوا له وأقروا بباطله حين استخفهم." 
  },
  { number: 25, text: "فَأَخَذَهُ ٱللَّهُ نَكَالَ ٱلۡأٓخِرَةِ وَٱلۡأُولَىٰٓ", tafsir: "أي: صارت <b>عقوبته</b> دليلا وزاجرا، ومبينة لعقوبة <b>الدنيا</b> و<b>الآخرة</b>."  },
  { 
  number: 26, 
  text: "إِنَّ فِي ذَلِكَ لَعِبْرَةً لِمَنْ يَخْشَى", 
  tafsir: "فإن من <b>يخشى الله</b> هو الذي ينتفع بالآيات والعبر. فإذا رأى عقوبة فرعون، عرف أن كل من تكبر وعصى وبارز الملك الأعلى، عاقبه في <b>الدنيا</b> و<b>الآخرة</b>. وأما من ترحلت خشية الله من قلبه، فلو جاءته كل آية لم يؤمن بها." 
  },
  { 
  number: 27, 
  text: "ءَأَنتُمۡ أَشَدُّ خَلۡقًا أَمِ ٱلسَّمَاۤءُۚ بَنَىٰهَا", 
  tafsir: "يقول تعالى مبينا دليلا واضحا لمنكري البعث ومستبعدي إعادة الله للأجساد: <b>أَأَنْتُمْ</b> أيها البشر <b>أَشَدُّ خَلْقًا أَمِ السَّمَاءُ</b> ذات الجرم العظيم، والخلق القوي، والارتفاع الباهر، <b>بَنَاهَا</b> الله." 
  },
  { number: 28, text: "رَفَعَ سَمۡكَهَا فَسَوَّىٰهَا", tafsir: " <b>رَفَعَ سَمْكَهَا</b> أي: جرمها وصورتها، <b>فَسَوَّاهَا</b> بإحكام وإتقان يحير العقول، ويذهل الألباب. " },
  { number: 29, text: "وَأَغۡطَشَ لَيۡلَهَا وَأَخۡرَجَ ضُحَىٰهَا", tafsir: "  <b>وَأَغْطَشَ لَيْلَهَا </b> أي: أظلمه، فعمت الظلمة <b> جميع</b> أرجاء السماء، فأظلم وجه الأرض، <b>وَأَخْرَجَ ضُحَاهَا</b> أي: أظهر فيه النور العظيم، حين أتى بالشمس، فامتد الناس في مصالح دينهم ودنياهم." },
  { number: 30, text: "وَٱلۡأَرۡضَ بَعۡدَ ذَٰلِكَ دَحَىٰهَآ",   tafsir: "أَيْ: بعد خلق السماء <b>﴿دَحَىٰهَا﴾</b> أي: أودع فيها منافعها. <br>وبيَّن / أظهر هذا الدَّحْوَ بقوله: <b>﴿أَخْرَجَ مِنْهَا مَاءَهَا وَمَرْعَاهَاوَالْجِبَالَ أَرْسَاهَا﴾.</b> "},
  { number: 31, text: "أَخۡرَجَ مِنۡهَا مَآءَهَا وَمَرۡعَىٰهَا",   tafsir: "الأرض مخلوقة من قبل السماء، لكنّ <b>دَحْوَهَا</b> وإخراج الماء منها والمرعى كان بعد خلق السماوات. <br>الدليل قول الله تعالى: <b>﴿قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ذَلِكَ رَبُّ الْعَالَمِينَ (٩) وَجَعَلَ فِيهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ (١٠) ثُمَّ اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ اِئْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ (١١) فَقَضَاهُنَّ سَبْعَ سَمَوَاتٍ فِي يَوْمَيْنِ﴾</b> [فصلت ٩-١٢]"},
  { number: 32, text: "وَٱلۡجِبَالَ أَرۡسَىٰهَا", tafsir: "جعلها راسية في الأرض تُمْسِكُ الأرض لئلا تضطرب بالخلق." },
  { number: 33, text: "مَتَٰعٗا لَّكُمۡ وَ لِأَنۡعَٰمِكُمۡ", tafsir: "  جعل الله تعالى ذلك متاعًا<b> لنا </B> نتمتع به فيما نأكل ونشرب،  <B> ولأنعامنا</B>  أي: مواشينا من الإبل والبقر والغنم وغيرها، ولما ذَكَّر الله عز وجل عباده بهذه النعم الدالة على كمال قدرته ذَكَّرَهم بمآلهم أي رجوعهم الحتمي الذي لا بد منه، فقال عز وجل: <b>فَإِذَا جَاءَتِ الطَّامَّةُ الْكُبْرَى</b>" },
  { number: 34, text: "فَإِذَا جَآءَتِ ٱلطَّآمَّةُ ٱلۡكُبۡرَىٰ",  tafsir: "أَيْ: إذا جاءت <b>القيامة الكبرى / يَوْمُ الْقِيَامَةِ</b>، .والشدة العظمى، التي يهون عندها كل شدة، فحينئذ يذهل الوالد عن ولده، والصاحب عن صاحبه وكل محب عن حبيبه. <br>قَالَ <b>ابْنُ عَبَّاسٍ</b>: سُمِّيَتْ بِذَلِكَ لِأَنَّهَا <b>تَطُم</b> عَلَى كُلِّ أَمْرٍ هَائِلٍ مُفْظِعٍ، كَمَا قَالَ تَعَالَى:<b>  ﴿وَالسَّاعَةُ أَدْهَى وَأَمَرُّ﴾</b>  [الْقَمَرِ: ٤٦]."},
  { number: 35, text: "يَوۡمَ يَتَذَكَّرُ ٱلۡإِنسَٰنُ مَا سَعَىٰ", tafsir: " حِينَئِذٍ يتذكرُ ابنُ آدَمَ جَمِيعَ عَمَلِهِ خَيْرِهِ وَشَرِّهِ.كَمَا قَالَ :<b> ﴿يَوْمَئِذٍ يَتَذَكَّرُ الإنْسَانُ وَأَنَّى لَهُ الذِّكْرَى﴾</b> [الْفَجْرِ: ٢٣] ." },
  { number: 36, text: "وَبُرِّزَتِ ٱلۡجَحِيمُ لِمَن يَرَىٰ", tafsir: "أَيْ: أَظْهَرَتْ لِلنَّاظِرِينَ فَرَآهَا النَّاسُ عِيَانًا." },
  { number: 37, text: "فَأَمَّا مَن طَغَىٰ", tafsir: " أَيْ: تَمَرّد وَعَتَا" },
  { number: 38, text: "وَءَاثَرَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا", tafsir: "أَيْ: قَدَّمَهَا عَلَى أَمْرِ دِينِهِ وَأُخْرَاهُ" },
  { number: 39, text: "فَإِنَّ ٱلۡجَحِيمَ هِيَ ٱلۡمَأۡوَىٰ", tafsir: "أَيْ: فَإِنَّ مصيرَه إِلَى الْجَحِيمِ وَإِنَّ مَطْعَمَهُ مِنَ الزَّقُّومِ، وَمَشْرَبَهُ مِنَ الْحَمِيمِ." },
  { number: 40, text: "وَأَمَّا مَنۡ خَافَ مَقَامَ رَبِّهِۦ وَنَهَى ٱلنَّفۡسَ عَنِ ٱلۡهَوَىٰ", tafsir: "أَيْ: خَافَ الْقِيَامَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَجَلَّ، وَخَافَ حُكْمَ اللَّهِ فِيهِ، وَنَهَى نَفْسَهُ عَنْ هَوَاهَا، ورَدها إِلَى طَاعَةِ مَوْلَاهَا." },
  { number: 41, text: "فَإِنَّ ٱلۡجَنَّةَ هِيَ ٱلۡمَأۡوَىٰ", tafsir: "أَيْ: مُنْقَلَبُهُ وَمَصِيرُهُ وَمَرْجِعُهُ إِلَى الْجَنَّةِ الْفَيْحَاءِ." },
  { number: 42, text: "يَسۡـَٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَا", tafsir: " ﴾أي: يسألك المتعنتون المكذبون بالبعث ﴿عَنِ السَّاعَةِ﴾ متى وقوعها و ﴿أَيَّانَ مُرْسَاهَا" },
  { number: 43, text: "فِيمَ أَنتَ مِن ذِكۡرَىٰهَآ", tafser: "فأجابهم الله بقوله: <b>فِيمَ أَنْتَ مِنْ ذِكْرَاهَا</b> أي: ما الفائدة لك ولهم في ذكرها ومعرفة وقت مجيئها؟ فليس تحت ذلك نتيجة، ولهذا لما كان علم العباد للساعة ليس لهم فيه مصلحة دينية ولا دنيوية، بل المصلحة في خفائه عليهم، طوى علم ذلك عن جميع الخلق، واستأثر بعلمه"},
  { number: 44, text: "إِلَىٰ رَبِّكَ مُنتَهَىٰهَآ", tafsir: "لَيْسَ عِلْمُهَا إِلَيْكَ وَلَا إِلَى أَحَدٍ مِنَ الْخَلْقِ، بَلْ مَردها ومَرجعها إِلَى اللَّهِ عَزَّ وَجَلَّ، فَهُوَ الَّذِي يَعْلَمُ وَقْتَهَا عَلَى التَّعْيِينِ." },
  { number: 45, text: "إِنَّمَآ أَنتَ مُنذِرُ مَن يَخۡشَىٰهَا", tafsir: "إِنَّمَا بَعَثْتُكَ لِتُنْذِرَ النَّاسَ وَتُحَذِّرَهُمْ مِنْ بَأْسِ اللَّهِ وَعَذَابِهِ(٣) ، فَمَنْ خَشِيَ اللَّهَ وَخَافَ مَقَامَهُ(٤) وَوَعِيدَهُ، اتَّبَعَكَ فَأَفْلَحَ وَأَنْجَحَ، وَالْخَيْبَةُ وَالْخَسَارُ عَلَى مَنْ كَذَّبَكَ وَخَالَفَكَ." },
  { number: 46, text: "كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَهَا لَمۡ يَلۡبَثُوٓاْ إِلَّا عَشِيَّةً أَوۡ ضُحَىٰهَا",  tafsir: "<b>أَيْ</b>: إِذَا قَامُوا مِنْ قُبُورِهِمْ إِلَى الْمَحْشَرِ يَسْتَقْصِرُونَ مُدّة الْحَيَاةِ الدُّنْيَا، حَتَّى كَأَنَّهَا عِنْدَهُمْ كَانَتْ <b>عَشِيَّةً</b> مِنْ يَوْمٍ أَو <b>ضُحى مِنْ يَوْمٍ</b>.<br> <b>أَمَّا عَشِيَّة</b>: فَمَا بَيْنَ الظَّهْرِ إِلَى غُرُوبِ الشَّمْسِ، <b>﴿أَوْ ضُحَاهَا﴾</b> مَا بَيْنَ طُلُوعِ الشَّمْسِ إِلَى نِصْفِ النَّهَارِ.<br>وَقَالَ <b>قَتَادَةُ</b>: وَقْتُ الدُّنْيَا فِي أَعْيُنِ الْقَوْمِ حِينَ عَايَنُوا الْآخِرَةَ."}
];


  // fråga till quiz-komponenten
  alnabbaQuestions = [
 {
  question: "ما المقصود بالنازعات غرقًا؟",
  answers: [
    { text: "الجبال التي تنزع من أماكنها", isCorrect: false },
    { text: "المياه التي تغرق الأرض", isCorrect: false },
    { text: "الملائكة التي تنزع أرواح الكفار بشدة", isCorrect: true },
    { text: "النجوم التي تغرق في السماء", isCorrect: false }
  ]
},

{
  question: "ما معنى الناشطات نشطًا؟",
  answers: [
    { text: "الملائكة التي تنزع أرواح المؤمنين برفق", isCorrect: true },
    { text: "الخيل السريعة", isCorrect: false },
    { text: "الكواكب المضيئة", isCorrect: false },
    { text: "الرياح السريعة", isCorrect: false }
  ]
},

{
  question: "من المقصود بالسابقات سبقًا؟",
  answers: [
    { text: "الخيل التي تسبق في المعركة", isCorrect: false },
    { text: "الملائكة التي تسبق بأرواح المؤمنين إلى الجنة", isCorrect: true },
    { text: "المطر الذي يسبق الغيوم", isCorrect: false },
    { text: "الكواكب التي تدور في السماء", isCorrect: false }
  ]
},

{
  question: "ما معنى قوله تعالى: (فالمدبرات أمرًا)؟",
  answers: [
    { text: "العلماء الذين يدبرون الأمور", isCorrect: false },
    { text: "الملائكة التي تنفذ أوامر الله", isCorrect: true },
    { text: "النجوم التي تدبر الليل والنهار", isCorrect: false },
    { text: "القادة الذين يدبرون الحروب", isCorrect: false }
  ]
},

{
  question: "ما معنى (يوم ترجف الراجفة)؟",
  answers: [
    { text: "النفخة الأولى في الصور", isCorrect: true },
    { text: "اليوم الماطر", isCorrect: false },
    { text: "انفجار النجوم", isCorrect: false },
    { text: "الزلازل الأرضية", isCorrect: false }
  ]
},

{
  question: "ما المقصود بـ (تتبعها الرادفة)؟",
  answers: [
    { text: "الأعاصير", isCorrect: false },
    { text: "الزلازل", isCorrect: false },
    { text: "أمواج البحر", isCorrect: false },
    { text: "النفخة الثانية في الصور", isCorrect: true }
  ]
},

{
  question: "ما الذي يتذكره الإنسان يوم القيامة؟",
  answers: [
    { text: "الأحلام التي رآها", isCorrect: false },
    { text: "الأموال التي أنفقها", isCorrect: false },
    { text: "كل ما عمل في الدنيا", isCorrect: true },
    { text: "أسماء الناس فقط", isCorrect: false }
  ]
},

{
  question: "ما معنى الطامة الكبرى؟",
  answers: [
    { text: "يوم عاشوراء", isCorrect: false },
    { text: "يوم القيامة", isCorrect: true },
    { text: "يوم بدر", isCorrect: false },
    { text: "يوم الهجرة", isCorrect: false }
  ]
},

{
  question: "كيف يكون حال من طغى وآثر الحياة الدنيا؟",
  answers: [
    { text: "فإن الجحيم هي المأوى", isCorrect: true },
    { text: "يُغفر له مباشرة", isCorrect: false },
    { text: "سيدخل الجنة", isCorrect: false },
    { text: "سيموت بلا حساب", isCorrect: false }
  ]
},

{
  question: "كيف يكون حال من خاف مقام ربه ونهى النفس عن الهوى؟",
  answers: [
    { text: "فإن الجنة هي المأوى", isCorrect: true },
    { text: "لن يُحاسب أبدًا", isCorrect: false },
    { text: "يُعطى مالًا كثيرًا", isCorrect: false },
    { text: "يُكرم في الدنيا فقط", isCorrect: false }
  ]
},

{
  question: "ماذا سأل الكفار عندما سمعوا عن البعث؟",
  answers: [
    { text: "أَئنا لمردودون في الحافرة؟", isCorrect: true },
    { text: "هل تأتي الملائكة إلى الأرض؟", isCorrect: false },
    { text: "من يرزقنا الطعام؟", isCorrect: false },
    { text: "متى يأتي المطر؟", isCorrect: false }
  ]
},

{
  question: "كيف كان رد الله على استبعاد الكفار للبعث؟",
  answers: [
    { text: "أعطاهم فرصة أخرى", isCorrect: false },
    { text: "إنما هي زجرة واحدة فإذا هم بالساهرة", isCorrect: true },
    { text: "سوف يؤخر العذاب عنهم", isCorrect: false },
    { text: "لن تقوم الساعة", isCorrect: false }
  ]
},

{
  question: "ما الرسالة التي جاء بها موسى لفرعون؟",
  answers: [
    { text: "أن يعلمه الزراعة", isCorrect: false },
    { text: "أن يقول له هل لك أن تزكى", isCorrect: true },
    { text: "أن يعطيه مالًا", isCorrect: false },
    { text: "أن يبني له قصرًا", isCorrect: false }
  ]
},

{
  question: "بماذا رد فرعون على دعوة موسى؟",
  answers: [
    { text: "سكت ولم يجب", isCorrect: false },
    { text: "آمن مباشرة", isCorrect: false },
    { text: "كذّب وعصى ثم أدبر يسعى", isCorrect: true },
    { text: "أكرم موسى", isCorrect: false }
  ]
},

{
  question: "لماذا ذكر الله قصة فرعون في السورة؟",
  answers: [
    { text: "لتزيين القصص", isCorrect: false },
    { text: "لتعليم السحر", isCorrect: false },
    { text: "للعبرة من مصير الطغاة", isCorrect: true },
    { text: "لتعليم التجارة", isCorrect: false }
  ]
},

{
  question: "ما معنى قوله تعالى: (أأنتم أشد خلقًا أم السماء)؟",
  answers: [
    { text: "تعليم الزراعة", isCorrect: false },
    { text: "سؤال عن علم الفلك", isCorrect: false },
    { text: "بيان قدرة الله على الخلق", isCorrect: true },
    { text: "تشجيع على السفر", isCorrect: false }
  ]
},

{
  question: "بماذا خُتمت سورة النازعات؟",
  answers: [
    { text: "بذكر الزكاة", isCorrect: false },
    { text: "بأن علم الساعة عند الله وحده", isCorrect: true },
    { text: "بذكر الصيام", isCorrect: false },
    { text: "بذكر الصلاة", isCorrect: false }
  ]
}

  ];

  rubtTassweerySections = [
  {
    title: '❓ أعمال الملائكة ومهامهم',
    description: ' تبدأ السورة بذكر الملائكة وأعمالهم المختلفة وخصوصا كيفيه نزع أو قبض أرواح الناس عند الموت. هذا تمهيد ليوم القيامة. .',
    verses: [
      'وَٱلنَّٰزِعَٰتِ غَرۡقٗا (1)',
      'وَٱلنَّٰشِطَٰتِ نَشۡطٗا (2)',
      'وَٱلسَّٰبِحَٰتِ سَبۡحٗا (3)',
      'فَٱلسَّٰبِقَٰتِ سَبۡقٗا (4)',
      'فَٱلۡمُدَبِّرَٰتِ أَمۡرٗا (5)'
    ]
  },
  {
    title: '🌍 يوم القيامة وخوف الإنسان',
    description: 'الآيات تصف مشهد يوم القيامة: ارتعاش الأرض، قلوب الناس ترتجف وأبصارهم خاشعة، وما يعتريهم من خوف.',
    verses: [
      'يَوۡمَ تَرۡجُفُ ٱلرَّاجِفَةُ (6)',
      'تَتۡبَعُهَا ٱلرَّادِفَةُ (7)',
      'قُلُوبٞ يَوۡمَئِذٖ وَاجِفَةٌ (8)',
      'أَبۡصَٰرُهَا خَٰشِعَةٞ (9)'
    ]
  },
  {
    title: '⚠️ إنكار البعث ومصير الكافرين',
    description: ' تركز هذه الآيات على المشركين الذين أنكرواالبعث بعد الموت، واستغرابهم حين يحدث كل شيء فجأة بزجرة واحدة قوية ليقوم الجميع، فيجدون أنفسهم أمام واقع جديد فوراً ( بِالسَّاهِرَةِ أي: على وجه الأرض قيام ينظرون).',
    verses: [
      'يَقُولُونَ أَءِنَّا لَمَرۡدُودُونَ فِي ٱلۡحَافِرَةِ (10)',
      'أَءِذَا كُنَّا عِظَٰمٗا نَّخِرَةٗ (11)',
      'قَالُواْ تِلۡكَ إِذٗا كَرَّةٌ خَاسِرَةٞ (12)',
      'فَإِنَّمَا هِيَ زَجۡرَةٞ وَٰحِدَةٞ (13)',
      'فَإِذَا هُم بِٱلسَّاهِرَةِ (14)'
    ]
  },

  {
    title: '🕊 قصة موسى وفرعون',
    description: 'بعد وصف الرعب والخشية من يوم القيامة، تأتي السورة لتذكر أمثلة من التاريخ: قصة سيدنا موسى عليه السلام وكيف فرعون طغى و عوقب، فإن من يكذب أو يستهين بالحق يوم القيامة سيكون مصيره مماثلًا.',
    verses: [
      'هَلۡ أَتَىٰكَ حَدِيثُ مُوسَىٰٓ (15)',
      'إِذۡ نَادَىٰهُ رَبُّهُۥ بِٱلۡوَادِ ٱلۡمُقَدَّسِ طُوًى (16)',
      'ٱذۡهَبۡ إِلَىٰ فِرۡعَوۡنَ إِنَّهُۥ طَغَىٰ (17)',
      'فَقُلۡ هَل لَّكَ إِلَىٰٓ أَن تَزَكَّىٰ (18)',
      'وَأَهۡدِيَكَ إِلَىٰ رَبِّكَ فَتَخۡشَىٰ (19)',
      'فَأَرَىٰهُ ٱلۡأٓيَةَ ٱلۡكُبۡرَىٰ (20)',
      'فَكَذَّبَ وَعَصَىٰ (21)',
      'ثُمَّ أَدۡبَرَ يَسۡعَىٰ (22)',
      'فَحَشَرَ فَنَادَىٰ (23)',
      'فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ (24)',
      'فَأَخَذَهُ ٱللَّهُ نَكَالَ ٱلۡأٓخِرَةِ وَٱلأُولَىٰٓ (25)'
    ]
  },
  {
    title: '🌌 آيات الخلق وعظمة الله',
    description: 'بعد سرد الأمثلة التاريخية والعقاب، تأتي دلائل قدرة الله في الخلق لتؤكد أن كل شيء بتدبيره وحكمته. يعزز فهم الإنسان أن الكون كله، والجبال، والأنهار، والليل والنهار، مهيأ بعناية لله. هذا يربط العقاب التاريخي بالقدرة الإلهية، فتتضح عظمة الله ومصداقية رسله.',
    verses: [
      'إِنَّ فِي ذَٰلِكَ لَعِبۡرَةٗ لِّمَن يَخۡشَىٰٓ (26)',
      'ءَأَنتُمۡ أَشَدُّ خَلۡقًا أَمِ ٱلسَّمَآءُۚ بَنَىٰهَا (27)',
      'رَفَعَ سَمۡكَهَا فَسَوَّىٰهَا (28)',
      'وَأَغۡطَشَ لَيۡلَهَا وَأَخۡرَجَ ضُحَىٰهَا (29)',
      'وَٱلأَرۡضَ بَعۡدَ ذَٰلِكَ دَحَىٰهَآ (30)',
      'أَخۡرَجَ مِنۡهَا مَآءَهَا وَمَرۡعَىٰهَا (31)',
      'وَٱلۡجِبَالَ أَرۡسَىٰهَا (32)',
      'مَتَٰعٗا لَّكُمۡ وَلِأَنۡعَٰمِكُمۡ (33)'
    ]
  },
  {
    title: '⏳ يوم الفصل والحساب',
    description: 'كل هذه الآيات عن الخلق تهيئنا لـ يوم الحساب: الكون كله أُعد ليوم الفصل. تبدأ أحداث يوم القيامة مجددًا، وذكر جزاء الكافرين والمتقين ومصير كل منهما.',
    verses: [
      'فَإِذَا جَآءَتِ ٱلطَّآمَّةُ ٱلۡكُبۡرَىٰ (34)',
      'يَوۡمَ يَتَذَكَّرُ ٱلۡإِنسَٰنُ مَا سَعَىٰ (35)',
      'وَبُرِّزَتِ ٱلۡجَحِيمُ لِمَن يَرَىٰ (36)',
      'فَأَمَّا مَن طَغَىٰ (37)',
      'وءَاثَرَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا (38)',
      'فَإِنَّ ٱلۡجَحِيمَ هِيَ ٱلۡمَأۡوَىٰ (39)',
      'وَأَمَّا مَنۡ خَافَ مَقَامَ رَبِّهِۦ وَنَهَى ٱلنَّفۡسَ عَنِ ٱلۡهَوَىٰ (40)',
      'فَإِنَّ ٱلۡجَنَّةَ هِيَ ٱلۡمَأۡوَىٰ (41)'
    ]
  },
  {
  title: '⏳ السؤال عن الساعة',
  description: 'الآيات تركز على عدم معرفة البشر حتى الرسول محمد ﷺ  بموعد الساعة ودور الرسول كمُنذر، وتصف سرعة وقوع الأحداث وكأنها تمر في لحظة قصيرة.',
  verses: [
    'يَسۡـَٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَا (42)',
    'فِيمَ أَنتَ مِن ذِكۡرَىٰهَآ (43)',
    'إِلَىٰ رَبِّكَ مُنتَهَىٰهَآ (44)',
    'إِنَّمَآ أَنتَ مُنذِرُ مَن يَخۡشَىٰهَا (45)',
    'كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَهَا لَمۡ يَلۡبَثُوٓاْ إِلَّا عَشِيَّةً أَوۡ ضُحَىٰهَا (46)'
]
}
];

  expandedSections: { [key: number]: boolean } = {};

  toggleExpanded(index: number) {
    this.expandedSections[index] = !this.expandedSections[index];
  }

  toggleVerse(index: number) {
    this.shown[index] = !this.shown[index];
  }

  // uppdatera vald flik
  onTabChange(tab: 'tadabbur' | 'visual') {
    this.selectedTab = tab;
  }
}
