export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
 // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَبِي بَكْرَةَ ـ نُفَيْعِ بْنِ الْحَارِثِ الثَّقَفِيِّ رضي الله عنه : أَنَّ النَّبِيَّ ﷺ قَالَ:', start: 0, end: 8.6 },
    { text: '«إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا ', start: 8.7, end: 11.2},
    { text: 'فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ». ', start: 11.3, end: 13.3},
    { text: 'قُلْتُ: يَا رَسُولَ اللهِ،', start: 13.4, end: 14.9},
    { text: 'هَذَا الْقَاتِلُ، فَمَا بَالُ الْمَقْتُولِ؟', start: 14.9, end: 17.9},
    { text: 'قَالَ: «إِنَّهُ كَانَ حَرِيصاً عَلَى قَتْلِ صَاحِبِهِ» ', start: 18, end: 21}
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>التقى:</b> <span>  قصده كل واحد منهما الاخر. </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
    audioUrl: 'audio/ryad-bab-1/hadith-9.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> بكره نفيع ابن الحارث الثقفي الطائفي.  ',
  '•١. اسلم في عبيد من اهل الطائف. ',
  '•٢. نزلوا الى رسول الله حينما حاصر ثقيف فاسلم.',
  '•٣. تدلى نفيع من حصن الطائف ببكرة فاشتهر بابي بكرة فانا من اخوانكم.',
  '•٤. مولى رسول الله. ',
  '•٥. من فضلاء الصحابه.',
  ' <b> ٦. كان يقول الحسن البصري:</b> لم ينزل البصرة من الصحابة ممن سكنها أفضل من عمران بن حصين وأبي بكرة.'
 
];

export const hadithFawaedList = [
  '• <b>١. وقوع العقاب على من عزم على المعصيه بقلبه ووطن نفسه عليها وباشر اسبابها سواء ارتكبها ام لم يرتكبها لسبب عارض منعه من ذلك ولولا العارض لفعلها. </b>',
  '• <b> ٢. التحذير من اقتتال المسلمين لان ذلك يؤدي الى ضعفهم وسخط الله عليهم. </b>',
'• <b> ٣. هذا الحديث مثل من قاتل حميه وعصيبه دون مبرر شرعي.</b>',
];
