export const hadithDetails = {
  title: 'الحَدِيثُ السَّادِسَ عَشَرَ',
  name: '[النَّهْيُ عَنِ الغَضَبِ]',
  hintText: 'دع الشك وخذ اليقين، فالحق طمأنينة والباطل ريبة وقلق.',

  phrases: [
    { text:  'الحَدِيثُ السَّادِسَ عَشَرَ: [النَّهْيُ عَنِ الغَضَبِ].', start: 0, end: 5.7},
    { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَوْصِنِي.', start: 5.8, end:  14.6},
    { text: ' قَالَ: «لَا تَغْضَبْ».', start: 14.7, end: 17.4 },
    { text :  'فَرَدَّدَ مِرَارًا، قَالَ: «لَا تَغْضَبْ».' , start : 17.5, end: 22 },
    { text: 'رَوَاهُ البُخَارِيُّ.', start: 22.1, end: 23 }
  ],
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
     <ul class="vocabulary-list">
        <li><b>ان رجلا:</b> <span>قيل هو ابو الدرداء ، وقيل جارية بن قدامة ، وقيل ربما تكررت الحادثه وتعدد السائل.</span></li>
        <li><b>اوصني:</b> <span>دلني على عمل ينفعني ، وفيه دليل على حرص الصحابه على خيري الدنيا والاخره.</span></li>
        <li><b>لا تغضب:</b> <span>الغضب: هو ثوران في النفس يحملها على الرغبه في البطش والانتقام.</span></li>
        <li><b>معنى لا تغضب:</b> <span>اي اجتنب اسباب الغضب ولا تعمل بمقتضى الغضب.</span></li>
        <li><b>ردد مرارا:</b> <span>كرر طلبه للوصيه.</span></li>
      </ul>
    </div>
  `,
  audioUrl: 'audio/hadith/16.mpeg'
};
// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
 '• <b>للناس ثلاثه انواع:</b><br>١. سريع الغطب سريع الفيء.<br>٢. سريع الغضب بطيء الفيء "هذا شر الناس".<br>٣. بطيء الغضب سريع الفيء "وهو افضلهم".',
  '• <b>للغضب ثلاثه انواع:</b><br>١. الاخضر: ان يغضب بما فيه انتهاك لحرمات الله (محمود).<br>٢. الاحمر: ان يغضب على الامور التوافه التي تثير الانسان ولكنه في حدود التمكن. <br>٣. الاسود: يعمي البصر والبصيره (مذموم).'
];

export const hadithFawaedList = [
  '• <b>١. التعوذ من الشيطان</b>',
  '• <b>٢. الوضوء</b>',
  '• <b>٣. تغيير جلسته</b>',
  '• <b>٤. يدرب نفسه على ضبط النفس</b>',
  '• <b>٥. ترك الكلام عند الغضب</b>'
];

export const hadithFawaed1 = [
  '• <b>١. حرص المسلم على ما ينفعه في دينه ودنياه.</b>',
  '• <b>٢. الغضب جماع الشر ، والتحرير منه جماعه الخير.</b>',
  '• <b>٣. ينبغي على المسلم ان يعين نفسه على ترك الغضب (من كظم غيظا وهو قادر على ان ينفذه دعاه الله على رؤوس الخلائق حتى يخيره من الحور العين ما شاء).</b>',
  '• <b>٤. الغضب مذموم في امور الدنيا.</b>',
  '• <b>٥. الغضب ممدوح ما كان لله ولنصرة دينه.</b>'
];