import { Verse, Section, QuizQuestion, QuizAnswer } from '../../../../models/surah.model';

  // verser
export const verses: Verse[] =[
  { number: 1, text: "عَبَسَ وَتَوَلَّىٰٓ", tafsir: " أي:<b>عَبَسَ</b> في وجهه <b>وَتَوَلَّى</b> في بدنه" },
  { number: 2, text: "أَن جَآءَهُ ٱلۡأَعۡمَىٰ", tafsir: " لأجل مجيء الأعمى له، ثم ذكر الفائدة في الإقبال عليه في الأية التالية" },
  { number: 3, text: "وَمَا يُدۡرِيكَ لَعَلَّهُۥ يَزَّكَّىٰٓ", tafsir: " فقال: <b>وَمَا يُدْرِيكَ لَعَلَّهُ</b> أي: الأعمى <b>يَزَّكَّى </b> أي: يتطهر عن الأخلاق الرذيلة، ويتصف بالأخلاق الجميلة؟" },
  { number: 4, text: "أَوۡ يَذَّكَّرُ فَتَنفَعَهُ ٱلذِّكۡرَىٰٓ", tafsir: "أي: يتذكر ما ينفعه، فيعمل  بتلك الذكرى. يَحْصُلُ لَهُ اتِّعَاظٌ وَانْزِجَارٌ عَنِ الْمَحَارِمِ" },
  { number: 5, text: "أَمَّا مَنِ ٱسۡتَغۡنَىٰ", tafsir: " أَيْ: أَمَّا <b>الْغَنِيُّ</b> فَأَنْتَ تَتَعَرَّضُ لَهُ لَعَلَّهُ يَهْتَدِي" },
  { number: 6, text: "فَأَنتَ لَهُۥ تَصَدَّىٰ", tafsir: " أَيْ: أَمَّا الْغَنِيُّ  <b> فَأَنْتَ تَتَعَرَّضُ لَهُ لَعَلَّهُ يَهْتَدِي</b>" },
  { number: 7, text: "وَمَا عَلَيۡكَ أَلَّا يَزَّكَّىٰ", tafsir: "أَيْ: مَا أَنْتَ بِمُطَالَبٍ بِهِ إِذَا لَمْ يَحْصُلْ لَهُ زَكَاةٌ" },
  { number: 8, text: "وَأَمَّا مَن جَآءَكَ يَسۡعَىٰ", tafsir: "أَيْ: <b>الشخص </b>الذي يَقْصِدُكَ وَيَؤُمُّكَ لِيَهْتَدِيَ بِمَا تَقُولُ لَهُ" },
  { number: 9, text: "وَهُوَ يَخۡشَىٰ", tafsir: "أَيْ: الشخص الذي <b> يَقْصِدُكَ وَيَؤُمُّكَ لِيَهْتَدِيَ بِمَا تَقُولُ لَهُ</b>." },
  { number: 10, text: "فَأَنتَ عَنۡهُ تَلَهَّىٰ", tafsir: "أَيْ: تَتَشَاغَلُ." },
  { number: 11, text: "كَلَّآ إِنَّهَا تَذۡكِرَةٞ", tafsir: "أي: حقا إن هذه الموعظة تذكرة من الله، يذكر بها عباده، ويبين لهم في كتابه ما يحتاجون إليه، ويبين الرشد من الغي." },
  { number: 12, text: "فَمَن شَآءَ ذَكَرَهُۥ", tafsir: "فإذا تبين ذلك <b>فَمَنْ شَاءَ ذَكَرَهُ</B> أي: عمل به، كقوله تعالى: <b>وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ  </b>" },
  { number: 13, text: "فِي صُحُفٖ مُّكَرَّمَةٖ", tafsir: "ثم ذكر محل هذه التذكرة وعظمها ورفع قدرها، فقال: <b>فِي صُحُفٍ مُكَرَّمَةٍ</b>." },
  { number: 14, text: "مَّرۡفُوعَةٖ مُّطَهَّرَةِۭ", tafsir: "<b> مَرْفُوعَةٍ</b> القدر والرتبة. <b>مُطَهَّرَةٌ من الآفات </b> عن أن تنالها أيدي الشياطين أو يسترقوها" },
  { number: 15, text: "بِأَيۡدِي سَفَرَةٖ", tafsir: "وهم الملائكة <b>الذين هم</b> السفراء بين الله وبين عباده." },
  { number: 16, text: "كِرَامِۭ بَرَرَةٖ", tafsir: "<b>كِرَامٍ</b> أي: كثيري الخير والبركة، <b>بَرَرَةٍ</b> قلوبهم وأعمالهم. وَقَوْلُهُ: <b>كِرَامٍ بَرَرَةٍ</b> أَيْ: خُلقهم كَرِيمٌ حَسَنٌ شَرِيفٌ، وَأَخْلَاقُهُمْ وَأَفْعَالُهُمْ بَارَّةٌ طَاهِرَةٌ كَامِلَةٌ." },
  { number: 17, text: "قُتِلَ ٱلۡإِنسَٰنُ مَآ أَكۡفَرَهُۥ", tafsir: " لنعمة الله وما أشد معاندته للحق بعدما تبين، الانسان ما هو؟" },
  { number: 18, text: "مِنۡ أَيِّ شَيۡءٍ خَلَقَهُۥ", tafsir: "هو من أضعف الأشياء" },
  { number: 19, text: "مِن نُّطۡفَةٍ خَلَقَهُۥ فَقَدَّرَهُۥ", tafsir: "خلقه الله من ماء مهين، ثم قدر خلقه، وسواه بشرا سويا، وأتقن قواه الظاهرة والباطنة." },
  { number: 20, text: "ثُمَّ ٱلسَّبِيلَ يَسَّرَهُۥ", tafsir: "أي: يسر له الأسباب الدينية والدنيوية، وهداه السبيل، <b>وبينه</b> وامتحنه بالأمر والنهي." },
  { number: 21, text: "ثُمَّ أَمَاتَهُۥ فَأَقۡبَرَهُۥ", tafsir: " أي: أكرمه بالدفن، ولم يجعله كسائر الحيوانات التي تكون جيفها على وجه الأرض" },
  { number: 22, text: "ثُمَّ إِذَا شَآءَ أَنشَرَهُۥ", tafsir: " أي: بعثه بعد موته للجزاء، فالله هو المنفرد بتدبير الإنسان وتصريفه بهذه التصاريف، لم يشاركه فيه مشارك." },
  { number: 23, text: "كَلَّا لَمَّا يَقۡضِ مَآ أَمَرَهُۥ", tafsir: "وهو -مع هذا- لا يقوم بما أمره الله، ولم يقض ما فرضه عليه، بل لا يزال مقصرا تحت الطلب." },
  { number: 24, text: "فَلۡيَنظُرِ ٱلۡإِنسَٰنُ إِلَىٰ طَعَامِهِۦٓ", tafsir: "ثم أرشده تعالى إلى النظر والتفكر في طعامه، وكيف وصل إليه بعدما تكررت عليه طبقات عديدة، ويسره له" },
  { number: 25, text: "أَنَّا صَبَبۡنَا ٱلۡمَآءَ صَبّٗا", tafsir: "أي: أنزلنا المطر على الأرض بكثرة." },
  { number: 26, text: "ثُمَّ شَقَقۡنَا ٱلۡأَرۡضَ شَقّٗا", tafsir: "للنبات" },
  { number: 27, text: "فَأَنۢبَتۡنَا فِيهَا حَبّٗا", tafsir: "<b> فَأَنْبَتْنَا فِيهَا </b> أصنافا مصنفة من أنواع الأطعمة اللذيذة، والأقوات الشهية <b>حبًّا</b> وهذا شامل لسائر الحبوب على اختلاف أصنافها." },
  { number: 28, text: "وَعِنَبٗا وَقَضۡبٗا", tafsir: "الْعِنَبُ مَعْرُوفٌ وَ <b> الْقَضْبُ </b> هُوَ: الْفَصْفَصَةُ الَّتِي تَأْكُلُهَا الدَّوَابُّ رَطْبَةٌ. وَيُقَالُ لَهَا: القَتّ أَيْضًا وَقَالَ الْحَسَنُ الْبَصْرِيُّ: الْقَضْبُ الْعَلَفُ." },
  { number: 29, text: "وَزَيۡتُونٗا وَنَخۡلٗا", tafsir: "وخص هذه الأربعة لكثرة فوائدها ومنافعها." },
  { number: 30, text: "وَحَدَآئِقَ غُلۡبٗا", tafsir: "أي: بساتين فيها الأشجار الكثيرة الملتفة،" },
  { number: 31, text: "وَفَٰكِهَةٗ وَأَبّٗا", tafsir: "<b> الفاكهة</b> : ما يتفكه فيه الإنسان، من تين وعنب وخوخ ورمان، وغير ذلك. و <b> الأب </b> : ما تأكله البهائم والأنعام، ولهذا قال: <b>مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ</b> ." },
  { number: 32, text: "مَّتَٰعٗا لَّكُمۡ وَلِأَنۡعَٰمِكُمۡ", tafsir: "<b>مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ</b> التي خلقها الله وسخرها لكم، فمن نظر في هذه النعم أوجب له ذلك شكر ربه، وبذل الجهد في الإنابة إليه، والإقبال على طاعته، والتصديق بأخباره." },
  { number: 33, text: "فَإِذَا جَآءَتِ ٱلصَّآخَّةُ", tafsir: "أي: إذا جاءت صيحة القيامة، التي تصخ لهولها الأسماع، وتنزعج لها الأفئدة يومئذ، مما يرى الناس من الأهوال وشدة الحاجة لسالف الأعمال." },
  { number: 34, text: "يَوۡمَ يَفِرُّ ٱلۡمَرۡءُ مِنۡ أَخِيهِ", tafsir: "<b>يَفِرُّ الْمَرْءُ</b> من أعز الناس إليه، وأشفقهم لدي." },
  { number: 35, text: "وَأُمِّهِۦ وَأَبِيهِ", tafsir: "وَأُمِّهِ وَأَبِيهِ" },
  { number: 36, text: "وَصَٰحِبَتِهِۦ وَبَنِيهِ", tafsir: "<b>وَصَاحِبَتِهِ</b> أي: زوجته <b>وَبَنِيهِ</b>." },
  { number: 37, text: "لِكُلِّ ٱمۡرِيٕٖ مِّنۡهُمۡ يَوۡمَئِذٖ شَأۡنٞ يُغۡنِيهِ", tafsir: "أي: قد شغلته نفسه، واهتم لفكاكها، ولم يكن له التفات إلى غيرها، فحينئذ ينقسم الخلق إلى فريقين:  <b>سعداء وأشقياء.</b> " },
  { number: 38, text: "وُجُوهٞ يَوۡمَئِذٖ مُّسۡفِرَةٞ", tafsir: "فأما السعداء، فـوجوههم 'يومئذ' <b>مُسْفِرَةٌ</b> أي: قد ظهر فيها السرور والبهجة، من ما عرفوا من نجاتهم، وفوزهم بالنعيم." },
  { number: 39, text: "ضَاحِكَةٞ مُّسۡتَبۡشِرَةٞ", tafsir: "<b>ضَاحِكَةٌ</b> يعني: مُتَبَسِّمَة، وهذا من كمال سرورهم، <b>مُسْتَبْشِرَةٌ</b> أي: قد بُشِّرَت بالخير؛ لأنها تتلقاهم الملائكة بالبشرى، <b>يَقُولُونَ سَلَامٌ عَلَيْكُمُ</b> [النحل ٣٢]. "},
  { number: 40, text: "وَوُجُوهٌ يَوۡمَئِذٍ عَلَيۡهَا غَبَرَةٞ", tafsir: " <b>وَوُجُوهٌ يَوْمَئِذٍ</b> يعني: يوم القيامة، <b>عَلَيْهَا غَبَرَةٌ</b> أي: شيء كالغبار؛ لأنها ذميمة قبيحة. " },
  { number: 41, text: "تَرۡهَقُهَا قَتَرَةٌ", tafsir: "أي: تغشاها <b> قَتَرَةٌ</b> فهي سوداء مظلمة مدلهمة، قد أيست من كل خير، وعرفت شقاءها وهلاكها." },
  { number: 42, text: "أُوْلَٰٓئِكَ هُمُ ٱلۡكَفَرَةُ ٱلۡفَجَرَةُ", tafsir: "<b>أُولَئِكَ</b> الذين بهذا الوصف <b>هُمُ الْكَفَرَةُ الْفَجَرَةُ</b> أي: الذين كفروا بنعمة الله وكذبوا بآيات الله، وتجرأوا على محارمه." }

];


  // fråga till quiz-komponenten
export const abassaQuestions: QuizQuestion[] = [
{
  question: "ماذا تعني كلمة ﴿عَبَسَ﴾ في أول السورة؟",
  answers: [
    { text: "غضب بشدة", isCorrect: false },
    { text: "قطّب وجهه", isCorrect: true },
    { text: "أعرض بلسانه", isCorrect: false },
    { text: "ابتسم", isCorrect: false }
  ]
},
{
  question: "من هو المقصود بقول الله ﴿أَن جَآءَهُ ٱلۡأَعۡمَىٰ﴾؟",
  answers: [
    { text: "الوليد بن المغيرة", isCorrect: false },
    { text: "أبو لهب", isCorrect: false },
    { text: "عبد الله بن أم مكتوم", isCorrect: true },
    { text: "أبو جهل", isCorrect: false }
  ]
},
{
  question: "ما المقصود بقول الله ﴿كَلَّآ إِنَّهَا تَذۡكِرَةٞ﴾؟",
  answers: [
    { text: "أن القرآن قصص تاريخية فقط", isCorrect: false },
    { text: "أن القرآن وعظ وتذكير للناس", isCorrect: true },
    { text: "أن القرآن خاص بزمن النبي فقط", isCorrect: false },
    { text: " أن القرآن له علاقة له بالبعث فقط", isCorrect: false }
  ]
},
{
  question: "من هم ﴿بِأَيۡدِي سَفَرَةٖ﴾ المذكورون في الآية؟",
  answers: [
    { text: "العلماء", isCorrect: false },
    { text: "الشهداء", isCorrect: false },
    { text: "الأنبياء", isCorrect: false },
    { text: "الملائكة", isCorrect: true }
  ]
},
{
  question: "ما الفرق بين ﴿الفاكهة﴾ و﴿الأب﴾ في قوله تعالى: ﴿وَفَٰكِهَةٗ وَأَبّٗا﴾؟",
  answers: [
    { text: "الفاكهة للإنسان والأب للأنعام", isCorrect: true },
    { text: "كلاهما نوع من الفاكهة", isCorrect: false },
    { text: "الأب يعني العنب والفواكه", isCorrect: false },
    { text: "الفاكهة للأنعام والأب للإنسان", isCorrect: false }
  ]
},
{
  question: "ما المقصود بـ﴿ثُمَّ السَّبِيلَ يَسَّرَهُۥ﴾؟",
  answers: [
    { text: "يسر له الأسباب الدينية والدنيوية", isCorrect: true },
    { text: "فتح له أبواب الرزق فقط", isCorrect: false },
    { text: "أعطاه القدرة على المشي", isCorrect: false },
    { text: "جعله قوي البنية", isCorrect: false }
  ]
},
{
  question: "ما معنى ﴿فَأَنتَ عَنۡهُ تَلَهَّىٰ﴾؟",
  answers: [
    { text: "تتسلى معه", isCorrect: false },
    { text: "تتغافل عنه", isCorrect: false },
    { text: "تتشاغل وتعرض عنه", isCorrect: true },
    { text: "تساعده على الخير", isCorrect: false }
  ]
},
{
  question: "من المقصود بـ﴿كِرَامٍ بَرَرَةٖ﴾؟",
  answers: [
    { text: "أهل الجنة من البشر", isCorrect: false },
    { text: "الملائكة أصحاب الأخلاق الكريمة", isCorrect: true },
    { text: "الأنبياء والرسل", isCorrect: false },
    { text: "الصحابة رضوان الله عليهم", isCorrect: false }
  ]
},
{
  question: "ما معنى ﴿قُتِلَ ٱلۡإِنسَٰنُ مَآ أَكۡفَرَهُۥ﴾؟",
  answers: [
    { text: "الإنسان كثير الكفر بنعمة الله", isCorrect: true },
    { text: "الإنسان ما أضعفه", isCorrect: false },
    { text: "الإنسان كثير الشكر", isCorrect: false },
    { text: "الإنسان مخلوق ضعيف", isCorrect: false }
  ]
},
{
  question: "ما المراد بـ﴿الصَّآخَّةُ﴾ في قوله تعالى: ﴿فَإِذَا جَآءَتِ ٱلصَّآخَّةُ﴾؟",
  answers: [
   
    { text: "الزلازل والبراكين", isCorrect: false },
    { text: "النفخ في الصور فقط", isCorrect: false },
    { text: "الطوفان العظيم", isCorrect: false }, 
    { text: "القيامة وصيحتها العظيمة", isCorrect: true }
  ]
}, {
  question: "ما العبرة من التباين بين الأعمى الذي جاء يطلب الهداية، والغني الذي أعرض؟",
  answers: [
    { text: "أن الغني دائمًا أفضل من الفقير", isCorrect: false },
      { text: "أن الاهتمام بالضعفاء وطلاب الحق أولى عند الله", isCorrect: true },
    { text: "أن الأعمى لا يستطيع فهم الدين", isCorrect: false },
    { text: "أن الرسل بُعثوا من أجل الأغنياء و الأقوياء فقط", isCorrect: false }
  ]
},
{
  question: "كيف تذكّر الآيات (24–32) عن الطعام والزرع الناس بقدرة الله ورحمته؟",
  answers: [
    { text: "بإثبات أن الإنسان يخلق قوته بنفسه", isCorrect: false },
    { text: "بأن الطبيعة تعمل بلا خالق", isCorrect: false },
    { text: "بأن الرزق يأتي صدفة دون حكمة", isCorrect: false },
       { text: "بذكر أن الله هو المنعم الذي يسّر لهم أرزاقهم", isCorrect: true }
  ]
},
{
  question: "كيف وصفت السورة انقسام الناس يوم القيامة (الآيات 37–42)؟",
  answers: [
    { text: "أن الناس سيكونون كلهم في نعيم واحد", isCorrect: false },
    { text: "أن الأغنياء فقط يدخلون الجنة", isCorrect: false },
       { text: "أن وجوهًا مسفرة ضاحكة مستبشرة، وأخرى عليها غبرة ترهقها قترة", isCorrect: true },
    { text: "أن الفقراء لن يُعذبون", isCorrect: false }
  ]
},
{
  question: "ما الرابط بين خلق الإنسان من نطفة وتذكيره بالبعث في هذه السورة؟",
  answers: [
    { text: "أن الذي خلقه من العدم قادر على إحيائه بعد الموت", isCorrect: true },
    { text: "أن الإنسان يحيي نفسه بنفسه", isCorrect: false },
    { text: "أن البعث أمر محال عقلاً", isCorrect: false },
    { text: "أن الخلق الأول لا علاقة له بالبعث", isCorrect: false }
    
  ]
}
];

export const rubtTassweerySections: Section[] = [
  {
    title: '💡 موقف النبي ﷺ مع الأعمى   ',
    description: 'الآيات الأولى تصف موقف النبي مع الأعمى الذي جاء يطلب الهداية، مقابل الغني الذي أعرض. العبرة هي الاهتمام بمن يطلب العلم والهداية لا بالمكانة الاجتماعية للانسان ',
    verseNumbers: [1,2,3,4,5,6,7,8,9,10]
  },
  {
    title: '📖 التذكير وحرية الاختيار',
    description: 'إعلان أن القرآن تذكرة؛ للخيار الإيماني («فَمَنْ شَاءَ ذَكَرَهُ») وبيان أنّ الرسالة مرفوعة في صحف كريمة.',
    verseNumbers: [11,12,13,14,15,16]
  },
  {
    title: '🧬 خلق الإنسان والبعث',
    description: 'الآيات التي تذكر خلق الإنسان من نطفة إلى بعثه بعد الموت، لتوضيح قدرة الله المطلقة على الخلق وإحياء الإنسان بعد موته.',
    verseNumbers: [17, 18, 19, 20, 21, 22, 23]
  },
  {
    title: '🌱 نعم الله في الخلق والرزق',
    description: 'الآيات من 24 إلى 32 تذكر الإنسان بنعم الله في خلقه وطعامه وزرعه وأشجاره وثمار الأرض، لتوضيح قدرة الله ورحمته.',
    verseNumbers: [24, 25, 26, 27, 28, 29, 30, 31, 32]
  },
  {
    title: '💥 الصاخة ويوم القيامة',
    description: 'الآية 33 تصف "الصاخة"، وهي النفخة العظيمة التي تصدم القلوب وتعلن بداية القيامة، فتخاف النفوس وترتعد و يفرّ بها الناس من أحبائهم',
     verseNumbers: [33,34,35,36]
  },
  {
    title: '⚖️ انقسام الناس يوم القيامة',
    description: 'الآيات 37–42 تصف تقسيم الناس بين السعداء والأشقياء، وجوههم مضيئة أو مظلمة، ضاحكة أو عليها غبرة وقترة، تبين جزاء كلٍ بحسب أعماله.',
    verseNumbers: [37, 38, 39, 40, 41, 42]
  }
];
