export const hadithDetails = {
  title: 'باب التوبة'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '• <b>التوبه: لغةً:</b>  الرجوع. ',
  '• <b> اصطلاحاً:</b>   هي الرجوع من البعد عن الله الى القرب اليه سبحانه ، هي الرجوع عما نهى الله عنه الى امره ،وعن معصيته الى طاعته ،وعما يكرهه الى ما يرضاه.',
];

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithFawaedList = [
  '• <b>حكم التوبه:</b> واجبه من كل ذنب. <br><br> ' ,
  '• <b> شروط التوبه:</b>  ',
    '١- الاقلاع عن المعصيه ',
    '٢- الندم على فعلها ',
    '٣- العزم على عدم العوده الى المعصيه<br> <br>',
  '• <b> انواع التوبه:</b>  ',
    ' ١- توبه واجبه: هي التوبه من ترك المأمور او فعل المحظور ←من الابرار المقتصدين ',
    '٢- توبه مستحبه: ترك المستحبات وفعل المكروهات ← السابقين المقربين<br><br>',
  '• <b> ثمرات التوبه:</b>  ',
    '١- تكفير السيئات حتى يصير كمن لا ذنب له  ',
    '٢- نيله درجات حتى يصير حبيباً'
 
];

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithFawaed = [
  '١- صدق النيه واخلاص التوبه لله',
  '٢- محاسبه النفس فهي تدفعك الى العباده الى الخيرات ',
  '٣- تذكير النفس بالموت وعذاب القبر',
  '٤- الصحبه الصالحه والبعد عن رفاق السوء ',
  '٥- مخالفه الهوى والتذكير بعواقب الذنوب ',

];







  









