export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بنِ عُمَرَ بنِ الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا،', start: 0, end: 5 },
  { text: 'عَنِ النَّبِيِّ ﷺ قَالَ:', start: 5.1, end: 7.5 },
  { text: '«إِنَّ اللهَ يَقْبَلُ تَوْبَةَ العَبْدِ مَا لَمْ يُغَرْغِرْ»', start: 7.6, end: 0 }

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b> يغرغر:  </b> <span> الغرغره ان يجعل المشروب في الفم ويردده الى اصل الحلق ولا يبتلع،<br> <b> والمراد: </b> وصول الروح الى الحلقوم وهو اسفل الحلق.  </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-18.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>١. على المؤمن اغتنام ما بقي من عمره</b> (كل يوم يعيشه المؤمن غنيمه).',
' <b> ٢. للتوبه الصادقه شروط لابد منها حتى تكون صحيحه ومقبولة ومنها:</b>  <br> <b> ✓ - </b> ان تصدر قبل حضور الاجل،<br>  <b> ✓ - </b>  وقبل طلوع الشمس من مغربها. </b>',
];




export const hadithFawaedList = [
'<b>١- الاخلاص لله. </b>',
'<b>٢- العزم على عدم العوده.  </b>',
'<b> ٣- الندم.  </b> ',
'<b> ٤- الاعتراف بالذنب.',
'<b> ٥- رد المظالم الى اهلها.'
];









