export const hadithDetails = {
  title: 'مقدمة',
  hintText: 'تعريف ب الإمام النووي'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>*الامام النووي*</b>ولد في قريه نوى تابعه لمدينه درعا السوريه. ',
  'اسمه يحيى ابن شرف بن مري بن حسن بن حسين الخزامي وينادى بمحي الدين ابو زكريا.',
  'دمشق وهو لم يتزوج ولم يكن لديه ولد وكني ابو زكريا.',
  'وعرف من صغره بابتعاده عن اللعب.',
  'ويقول <b>*الشيخ ياسين بن يوسف المراكشي*</b> رايت محي الدين وهو بمعشر سنوات واصحابه يكرهونه عن اللعب وهو يهرب منهم ويبكي ويقرا القران على تلك الحال.',
  'رجعنا ابوه في دكان يعمل بها فكان لا يشغله البيع والشراء عن قراءه القران.',
  'فاتيت شيخه واوصيته به واني لارجو ان يكون اعلم اهل زمانه فقال: امنجم انت ... قلت لا ... انما انطقني الله ... واخبرت والده بذلك...',
  'فحرص عليه الى ان ختم ثم انتقل به الى دمشق ليلهم تحصيله العلمي في مدرسه الحديث الرواحية وهي مراسقه لمسجد دمشق وحج مع ابيه.',
  'الكمال اسحاق بن احمد وكان يقرا على استاذه كل يوم 12 درس شرحا وتصحيحا وبقي سنين لم يضع جنبه على الارض.',
  'وبقيه ست سنوات لا يعرف الا تحصيل العلم الشرعي ودراسه الكتب وحفظ القران وتفسيره.',
  '<b>*صفاته*</b> كان يتصف بالورع والتقل وخشونه العيش شديد الورع والزهد يترك جميع ملاذ الدنيا الا ما ياتيه من ابيه من الكعك اليابس والتين المجفف وكان يأمر بالمعروف وينهي عن المنكر للامراء والناس عامه ولا يا يخاف في الله لومة لائم.',
  '<b>*مؤلفاته*</b>',
  'الاربعين النوويه والاذكار ورياض الصالحين',
  'مدرسه الفقه الشافعي من اكثر من 20 شيخ واتقن المذهب حتى صار اهل زمانه في المذهب الشافعي',
  'واكرمه الله بطلبه يحفظون منهم مثل المزي وابن عطار',
  'توفي وعمره 45 سنه واصبح رئيس دار الحديث الاشرفيه بدمشق',
  'وارادوا ان يبنو قبه عند قبره فرأت عمته في المنام انه يخبرها لا يقوموا بذلك لانهم كلما ارادوا ذلك وقع عليهم حوطوا قبره بحجارة'
];