import { Verse, Section, QuizQuestion, QuizAnswer } from '../../../../models/surah.model';

  // verser

export const verses: Verse[] = [
  { "number": 1, "text": "وَيْلٌ لِّلْمُطَفِّفِينَ", "tafsir": "<b>ويل</b>: كلمة عذاب، وواد في جهنم. <b>للمطففين:</b> المنقصين في كيل أو وزن الباخسين فيهما." },
  { "number": 2, "text": "الَّذِينَ إِذَا اكْتَالُواْ عَلَى النَّاسِ يَسْتَوْفُونَ", "tafsir": "<b>إذا اكتالوا على الناس:</b> أي من الناس.<b> يستوفون:</b> الكيل." },
  { "number": 3, "text": "وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ", "tafsir": "<b>وإذا كالوهم</b>: أي كالوا لهم، <b>أو وزنوهم:</b> أي وزنوا لهم؛<b> يخسرون:</b> أي ينقصون الكيل أو الوزن." },
  { "number": 4, "text": "أَلا يَظُنُّ أُوْلَئِكَ أَنَّهُم مَّبْعُوثُونَ", "tafsir": "<b>ألا:</b> استفهام توبيخي إنكاري.<b> يظن: </b>أي يتيقن." },
  { "number": 5, "text": "لِيَوْمٍ عَظِيمٍ", "tafsir": "<b>ليوم عظيم:</b> أي يوم القيامة لما فيه من أهوال وعظائم الأمور." },
  { "number": 6, "text": "يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ", "tafsir": "<b>يوم يقوم الناس: </b>أي من قبورهم.<b> لرب العالمين:</b> خاشعين ذليلين ينتظرون حكم الله فيهم." },
  { "number": 7, "text": "كَلاَّ إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ", "tafsir": "<b>كلا:</b> أي حقا وأن الأمر ليس كما يظن المطففون. <b>لفي سجين:</b> علم على كتاب ديوان الشر دوّن فيه أعمال الشياطين وأعمال الكفرة وهو أيضا موضع في أسفل الأرض السابعة." },
  { "number": 8, "text": "وَمَا أَدْرَاكَ مَا سِجِّينٌ", "tafsir": "<b>موضع في أسفل الأرض السابعة:</b> فيه سجين الذي هو ديوان الكتب وبه أرواح الأشقياء عامة." },
  { "number": 9, "text": "كِتَابٌ مَّرْقُومٌ", "tafsir": "<b>كتاب مرقوم:</b> أي مسطور بيّن الكتابة فيه أعمالهم." },
  { "number": 10, "text": "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ", "tafsir": "<b>ويل ووعيد بالعذاب:</b> يوم القيامة للمكذبين." },
  { "number": 11, "text": "الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ", "tafsir": "<b>يوم الدين:</b> أي يوم القيامة الذي هو يوم الحساب والجزاء." },
  { "number": 12, "text": "وَمَا يُكَذِّبُ بِهِ إِلاَّ كُلُّ مُعْتَدٍ أَثِيمٍ", "tafsir": "<b>كل معتد:</b> أي ظالم مضيع حقوق ربه تعالى وحقوق غيره. <b>أثيم:</b> منغمس في الآثام مكثر منها." },
  { "number": 13, "text": "إِذَا تُتْلَى عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الأَوَّلِينَ", "tafsir": "<b>أساطير الأولين:</b> أي ما سطره الأولون من القصص والأخبار التي لا تصح." },
  { "number": 14, "text": "كَلاَّ بَلْ رَانَ عَلَى قُلُوبِهِم مَّا كَانُوا يَكْسِبُونَ", "tafsir": "<b>ران على قلوبهم: </b>أي غطّى قلوبهم وحجبها عن قبول الحق،<b> ما كانوا يكسبون:</b> أي من الذنوب والآثام." },
  { "number": 15, "text": "كَلاَّ إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ", "tafsir": "<b>لمحجوبون:</b> أي يحال بينهم وبين رؤية الربّ إلى يوم القيامة." },
  { "number": 16, "text": "ثُمَّ إِنَّهُمْ لَصَالُوا الْجَحِيمِ", "tafsir": "<b>لصالو الجحيم:</b> أي لداخلوها ومحرقون معذبون بها." },
  { "number": 17, "text": "ثُمَّ يُقَالُ هَذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ", "tafsir": "<b>هذا الذي كنتم به تكذبون:</b> أي يقال لهم توبيخا وخزيا لهم وهم في العذاب هذا الذي كنتم به تكذبون." },
  { "number": 18, "text": "كَلاَّ إِنَّ كِتَابَ الأَبْرَارِ لَفِي عِلِّيِّينَ", "tafsir": "<b>كتاب الأبرار:</b> أي كتاب أعمالهم والأبرار هم المطيعون لله ولرسوله الصادقون. <b>لفي عليين:</b> أي في موضع يسمى عليين في أعلى الجنة." },
  { "number": 19, "text": "وَمَا أَدْرَاكَ مَا عِلِّيُّونَ", "tafsir": "<b>موضع يسمى عليين في أعلى الجنة:</b> أي في موضع يسمى عليين في أعلى الجنة." },
  { "number": 20, "text": "كِتَابٌ مَّرْقُومٌ", "tafsir": "<b>كتاب مرقوم:</b> أي كتاب مرقوم بأمان من الله من النار يوم القيامة والفوز بالجنة." },
  { "number": 21, "text": "يَشْهَدُهُ الْمُقَرَّبُونَ", "tafsir": "<b>يشهده المقربون:</b> أي يحضره المقربون من أهل كل سماء ويحفظونه لأنه يحمل أماناً لصاحبه من النار." },
  { "number": 22, "text": "إِنَّ الأَبْرَارَ لَفِي نَعِيمٍ", "tafsir": "<b>إن الأبرار لفي نعيم:</b> أي إن الذين بروا ربهم بطاعته بأداء الفرائض واجتناب النواهي لفي نعيم الجنة." },
  { "number": 23, "text": "عَلَى الأَرَائِكِ يَنظُرُونَ", "tafsir": "<b>على الأرائك:</b> أي على الأسرة ذات الحجال.<b> ينظرون: </b>أي ما آتاهم ربهم من صنوف النعيم." },
  { "number": 24, "text": "تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ", "tafsir": "<b>تعرف في وجوههم نضرة النعيم:</b> أي حُسنه وبريقه وتلألؤه." },
  { "number": 25, "text": "يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ", "tafsir": "<b>من رحيق:</b> أي من خمر صرف خالصة لا غش فيها ولا دنس. <b>مختوم:</b> أي مختوم على إنائها لا يفك ختمه إلا هم." },
  { "number": 26, "text": "خِتَامُهُ مِسْكٌ وَفِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ", "tafsir": "<b>ختامه مسك:</b> أي آخر شربها يفوح برائحة المسك. <b>فليتنافس المتنافسون:</b> أي فليطلب بالطاعة والاستقامة الطالبون للنعيم المقيم." },
  { "number": 27, "text": "وَمِزَاجُهُ مِن تَسْنِيمٍ", "tafsir": "<b>ومزاجه من تسنيم:</b> أي ومزاج شرابهم من عين تجري من عال تسمى التسنيم." },
  { "number": 28, "text": "عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ", "tafsir": "<b>عينا هي التسنيم:</b> يشرب منها المقربون صرفا وتمزج لأصحاب اليمين." },
  { "number": 29, "text": "إِنَّ الَّذِينَ أَجْرَمُوا كَانُواْ مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ", "tafsir": "لما ذكر الله تعالى جزاء المجرمين وجزاء المؤمنين  و<b>ذكر</b> ما بينهما من التفاوت العظيم، أخبر أن المجرمين كانوا في الدنيا يسخرون بالمؤمنين، ويستهزئون بهم، ويضحكون منهم،" },
  { "number": 30, "text": "وَإِذَا مَرُّواْ بِهِمْ يَتَغَامَزُونَ", "tafsir": "ويتغامزون بهم عند مرورهم عليهم، احتقارا لهم وازدراء، ومع هذا تراهم مطمئنين، لا يخطر الخوف على بالهم." },
  { "number": 31, "text": "وَإِذَا انقَلَبُواْ إِلَى أَهْلِهِمُ انقَلَبُواْ فَكِهِينَ", "tafsir": "<b>وَإِذَا انْقَلَبُوا إِلَى أَهْلِهِمُ</b> صباحًا أو مساء <b>انْقَلَبُوا فَكِهِينَ</b> أي: مسرورين مغتبطين  " },
  { "number": 32, "text": "وَإِذَا رأَوْهُمْ قَالُوا إِنَّ هَؤُلاء لَضَالُّونَ", "tafsir": "وهذا من أعظم  ما يكون من الاغترار، أنهم جمعوا بين غاية الإساءة والأمن  في الدنيا، حتى كأنهم قد جاءهم كتاب من الله وعهد، أنهم من أهل السعادة، وقد حكموا لأنفسهم أنهم أهل الهدى، وأن المؤمنين ضالون، افتراء على الله، وتجرأوا على القول عليه بلا علم." },
  { "number": 33, "text": "وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ", "tafsir": "<b>وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ</b> أي: وما أرسلوا وكلاء على المؤمنين ملزمين بحفظ أعمالهم، حتى يحرصوا على رميهم بالضلال، وما هذا منهم إلا تعنت وعناد وتلاعب، ليس له مستند ولا برهان،" },
  { "number": 34, "text": "فَالْيَوْمَ الَّذِينَ آمَنُواْ مِنَ الْكُفَّارِ يَضْحَكُونَ", "tafsir": "ولهذا كان جزاؤهم في الآخرة من جنس عملهم، قال تعالى: <bفَالْيَوْمَ</b> أي: يوم القيامة، <b>الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ</b> حين يرونهم في غمرات العذاب يتقلبون، وقد ذهب عنهم ما كانوا يفترون، والمؤمنون في غاية الراحة والطمأنينة" },
  { "number": 35, "text": "عَلَى الأَرَائِكِ يَنظُرُونَ", "tafsir": "<b>عَلَى الْأَرَائِكِ</b> وهي السرر المزينة، <b>يُنْظَرُونَ</b> إلى ما أعد الله لهم من النعيم، وينظرون إلى وجه ربهم الكريم." },
  { "number": 36, "text": "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ", "tafsir": "أي: هل جوزوا من جنس عملهم؟ فكما ضحكوا في الدنيا من المؤمنين ورموهم بالضلال، ضحك المؤمنون منهم في الآخرة، ورأوهم  في العذاب والنكال، الذي هو عقوبة الغي والضلال. <b>نعم</b> ، ثوبوا ما كانوا يفعلون، عدلًا من الله وحكمة، والله عليم حكيم." }
];


  // fråga till quiz-komponenten
export const abassaQuestions: QuizQuestion[] = [

  {
    question: "ما معنى 'التطفيف' الذي توعد الله أصحابه بالويل؟",
    answers: [
      { text: "السرقة العلنية من أموال الناس", isCorrect: false },
      { text: "بخس ونقص المكيال والميزان", isCorrect: true },
      { text: "التجارة في المحرمات", isCorrect: false },
      { text: "الإسراف في صرف الأموال", isCorrect: false }
    ]
  },
  {
    question: "كيف يتصرف المطففون إذا 'اكتالوا على الناس' (أي اشتروا لأنفسهم)؟",
    answers: [
      { text: "يطلبون حقهم كاملاً دون نقصان (يستوفون)", isCorrect: true },
      { text: "يتنازلون عن جزء من حقهم صدقة", isCorrect: false },
      { text: "يطلبون زيادة فوق حقهم بالقوة", isCorrect: false },
      { text: "يغشون في نوعية البضاعة", isCorrect: false }
    ]
  },
  {
    question: "ما هو 'سجين' المذكور في قوله تعالى ﴿كَلاَّ إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ﴾؟",
    answers: [
      { text: "سجن في الدنيا للمجرمين", isCorrect: false },
      { text: "اسم لجبل في وسط النار", isCorrect: false },
      { text: "ديوان الشر وموضع في أسفل الأرض السابعة", isCorrect: true },
      { text: "بئر عميقة في جهنم", isCorrect: false }
    ]
  },
  {
    question: "ماذا يقصد بكلمة 'مرقوم' في قوله ﴿كِتَابٌ مَّرْقُومٌ﴾؟",
    answers: [
      { text: "كتاب مفقود لا يجده صاحبه", isCorrect: false },
      { text: "كتاب مكتوب بلغة غير مفهومة", isCorrect: false },
      { text: "كتاب لا يحتوي على تفاصيل", isCorrect: false },
      { text: "كتاب مسطور بيّن الكتابة لا ينسى منه شيء", isCorrect: true }
    ]
  },
  {
    question: "من هو الشخص الذي يكذب بيوم الدين حسب سياق الآيات؟",
    answers: [
      { text: "كل معتدٍ أثيم غارق في المعاصي", isCorrect: true },
      { text: "كل إنسان فقير", isCorrect: false },
      { text: "الشخص الذي ينسى الصلاة فقط", isCorrect: false },
      { text: "من يشتغل بالتجارة فقط", isCorrect: false }
    ]
  },
  {
    question: "ما هو 'الرّان' الذي ذكر في قوله تعالى ﴿كَلاَّ بَلْ رَانَ عَلَى قُلُوبِهِم﴾؟",
    answers: [
      { text: "مرض جسدي يصيب القلب", isCorrect: false },
      { text: "غطاء وحجاب من الذنوب يمنع قبول الحق", isCorrect: true },
      { text: "الخوف الشديد من الموت", isCorrect: false },
      { text: "الحزن على فراق الدنيا", isCorrect: false }
    ]
  },
  {
    question: "ما هي أشد عقوبة نفسية ينالها الكفار يوم القيامة؟",
    answers: [
      { text: "سماع أصوات المعذبين", isCorrect: false },
      { text: "الحرمان من الطعام والشراب", isCorrect: false },
      { text: "حجبهم عن رؤية الله عز وجل", isCorrect: true },
      { text: "الوقوف لفترات طويلة في الشمس", isCorrect: false }
    ]
  },
  {
    question: "أين يوجد كتاب 'الأبرار' (المطيعين لله)؟",
    answers: [
      { text: "في عليين بـأعلى الجنة", isCorrect: true },
      { text: "في مكان مخفي لا يعلمه أحد", isCorrect: false },
      { text: "بين يدي الملائكة في الأرض", isCorrect: false },
      { text: "في سجين مع الفجار", isCorrect: false }
    ]
  },
  {
    question: "من هم الذين 'يشهده المقربون'؟",
    answers: [
      { text: "الناس الذين كانوا يشهدون الزور", isCorrect: false },
      { text: "أهل الدنيا عند موت المؤمن", isCorrect: false },
      { text: "ملائكة كل سماء يحضرون كتاب الأبرار", isCorrect: true },
      { text: "الشهداء في المعارك", isCorrect: false }
    ]
  },
  {
    question: "ما معنى 'الأرائك' في قوله تعالى ﴿عَلَى الأَرَائِكِ يَنظُرُونَ﴾؟",
    answers: [
      { text: "البيوت الواسعة", isCorrect: false },
      { text: "الأشجار الكبيرة", isCorrect: false },
      { text: "الأسرة المزينة والمريحة", isCorrect: true },
      { text: "الحدائق المعلقة", isCorrect: false }
    ]
  },
  {
    question: "ما صفة الشراب المسمى 'رحيق مختوم'؟",
    answers: [
      { text: "خمر صرف خالصة ختامها رائحة المسك", isCorrect: true },
      { text: "ماء بارد من أنهار الجنة", isCorrect: false },
      { text: "عسل مصفى لا يتغير طعمه", isCorrect: false },
      { text: "لبن لم يتغير طعمه", isCorrect: false }
    ]
  },
  {
    question: "ما هي أعلى عين في الجنة يشرب منها المقربون صرفاً؟",
    answers: [
      { text: "السلسبيل", isCorrect: false },
      { text: "الكوثر", isCorrect: false },
      { text: "زمزم", isCorrect: false },
      { text: "التسنيم", isCorrect: true }
    ]
  },
  {
    question: "كيف كان المجرمون يتعاملون مع المؤمنين في الدنيا؟",
    answers: [
      { text: "كانوا يضحكون منهم ويستهزئون بهم", isCorrect: true },
      { text: "كانوا يتجاهلونهم تماماً", isCorrect: false },
      { text: "كانوا يحاولون مساعدتهم", isCorrect: false },
      { text: "كانوا يخافون منهم", isCorrect: false }
    ]
  },
  {
    question: "ما معنى ﴿وَإِذَا انقَلَبُوا إِلَى أَهْلِهِمُ انقَلَبُوا فَكِهِينَ﴾؟",
    answers: [
      { text: "أنهم يرجعون حزينين من ذنوبهم", isCorrect: false },
      { text: "أنهم يرجعون لبيوتهم فرحين بسخريتهم من المؤمنين", isCorrect: true },
      { text: "أنهم يطعمون أهلهم الفاكهة", isCorrect: false },
      { text: "أنهم يتوبون عند لقاء أهلهم", isCorrect: false }
    ]
  },
  {
    question: "ما هي النتيجة النهائية يوم القيامة حسب أواخر السورة؟",
    answers: [
      { text: "يبقى الكفار يسخرون من المؤمنين", isCorrect: false },
      { text: "يتصالح الجميع ويدخلون الجنة", isCorrect: false },
      { text: "يضحك المؤمنون من الكفار وهم في نعيمهم", isCorrect: true },
      { text: "لا أحد يضحك أو يحزن", isCorrect: false }
    ]
  }
];


export const  rubtTassweerySections : Section[] =[
  {
    title: '⚠️ عقوبة التطفيف والظلم المالي ',
    description: 'تحذير شديد لمن ينقصون المكيال والميزان، وتذكيرهم بيوم البعث والحساب أمام الله.',
    verseNumbers: [1, 2, 3, 4, 5, 6]
  },
  {
    title: ' 💥 سِجّين وحال المكذبين ',
    description: 'توضيح مصير الفجار وكتابهم الموجود في أسفل مكان، وكيف حجب الران (الذنوب) قلوبهم عن الحق.',
    verseNumbers: [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
  },
  {
    title: ' 🕊 عِلِّيّون ونعيم الأبرار  ',
    description: 'وصف مكافأة المطيعين وكتابهم في أعلى مكان، مع تفصيل لأنواع النعيم والشراب في الجنة.',
    verseNumbers: [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28]
  },
  {
    title: ' ⚖️ انقلاب الموازين يوم القيامة',
    description: 'توضيح كيف كان الكفار يسخرون من المؤمنين في الدنيا، وكيف سيكون النصر والضحك للمؤمنين في الآخرة.',
    verseNumbers: [29, 30, 31, 32, 33, 34, 35, 36]
  }
];