export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي نُجَيْدٍ عِمْرَانَ بْنِ الحُصَيْنِ الخُزَاعِيِّ رَضِيَ اللهُ عَنْهُمَا:', start: 0, end: 0 },
  { text: 'أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ رَسُولَ اللهِ ﷺ وَهِيَ حُبْلَى مِنَ الزِّنَى،', start: 0, end: 0 },
  { text: 'فَقَالَتْ: يَا رَسُولَ اللهِ،', start: 0, end: 0 },
  { text: 'أَصَبْتُ حَدّاً فَأَقِمْهُ عَلَيَّ.', start: 0, end: 0 },
  { text: 'فَدَعَا نَبِيُّ اللهِ ﷺ وَلِيَّهَا، فَقَالَ:', start: 0, end: 0 },
  { text: '«أَحْسِنْ إِلَيْهَا، فَإِذَا وَضَعَتْ فَأْتِنِي».', start: 0, end: 0 },
  { text: 'فَفَعَلَ، فَأَمَرَ بِهَا نَبِيُّ اللهِ ﷺ، فَشُدَّتْ عَلَيْهَا ثِيَابُهَا،', start: 0, end: 0 },
  { text: 'ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ،', start: 0, end: 0 },
  { text: 'ثُمَّ صَلَّى عَلَيْهَا،', start: 0, end: 0 },
  { text: 'فَقَالَ لَهُ عُمَرُ:', start: 0, end: 0 },
  { text: 'تُصَلِّي عَلَيْهَا يَا رَسُولَ اللهِ وَقَدْ زَنَتْ؟', start: 0, end: 0 },
  { text: 'قَالَ: «لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ المَدِينَةِ لَوَسِعَتْهُمْ،', start: 0, end: 0 },
  { text: 'وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا للهِ»', start: 0, end: 0 }

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
      <li><b>  اصبت حدّاً: </b> <span> فعلت ما يعاقب عليه بحد.</span></li>
      <li><b> فشدت: </b> <span>  جمعت اطرافها لتستتر.  </span></li>
      <li><b> فقال له عمر:</b> <span>  مستجلياً للحكمة وليس منكراً.  </span></li>
      <li><b> سبعين: </b> <span>   من العصاة.  </span></li>
      <li><b> لوسعتهم: </b> <span>   لكفتهم في رفع اثامهم. </span></li>
      <li><b> جادت بنفسها: </b> <span>    بذلتها لمرضاة الله تعالى. </span></li>
      </ul>
    </div>

  `,
  // رابط صوت متن الحديث السادس
   audioUrl:   'audio/ryad-bab-2/hadith-22.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي: عمران بن الحصين.</b> <br> ١. ابو نجيد الخزاعي.  <br>  ٢. من علماء الصحابة. <br> ٣. اسلم هو وابوه عام خيبر سنة 7 هجري <br> ٤. وكانت معه راية خزاعة يوم فتح مكة. <br> ٥. بعثه عمر الى البصرة ليفقههم. <br>٦. اعتزل الفتنة وقال: (وددت أني رماد تذروني الرياح). <br> ٧. كان مجاب الدعوة. <br>٨. كان في مرضه تسلم عليه الملائكة ، فاكتوي ففقد التسليم ثم عاد اليه ، فأصيب باستسقاء فطال به سنين كثيرة وهو صابر عليه وشق بطنه وثقب له سرير فبقي عليه 30 سنة. <br>٩. ويعرض عليه الكي فيأبى حتى قبل وفاته بستنين اكتوى فما عادت سلمت عليه وكان يقول: (اكتوينا فما افلحن ولا انجحن). '
];




export const hadithFawaedList = [
'<b>١- الجلد ثابت في كتاب الله على البكر ، والرجم ثابت بسنه رسول الله على الثيب.</b> <br> (الشيخ والشيخة إذا زنيا فارجموهما البتة)',
'<b>٢- من خُلُق المؤمن التألم والندم اذا فرط بالذنب وحرصه على تطهير نفسه من لوثة الاثم ولو كان في ذلك هلاكه ليلقي الله وهو عنه راض.</b>',
'<b> ٣- بيان عظمه التوبة وانها تمحو الذنب وتلحق التائب بمن لم يقترف شيئاً من الذنب.</b> ',
'<b> ٤- الحامل من الزنى لا تجلد ولا ترجم حتى تضع حملها لئلا تقتل جنينها. </b>',
'<b>٥- جواز الصلاه على المرجوم. </b>',
'<b>٦- العقوبه الدنيويه تكفر الذنب اذا اقترن بالندم والتوبة. </b>'
];










