export const hadithDetails = {
  title: 'الحديث الثَّامِنُ',
  name: '[حُرْمَةُ الْمُسْلِمِ]',
  hintText: 'حرمة دم المسلم وصيانة أمواله.',
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
   // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  { text: 'عَنْ أَبِي عَبْدِ اللهِ', start: 4.1, end: 6.0 },
    { text: 'جَابِرِ بْنِ عَبْدِ اللهِ الأَنْصَارِيِّ رَضِيَ اللهُ عَنْهُمَا قَالَ:', start: 6.1, end: 12.0 },
    { text: 'كُنَّا مَعَ النَّبِيِّ ﷺ فِي غَزَاةٍ،', start: 12.1, end: 15.5 },
    { text: 'فَقَالَ: «إِنَّ بِالْمَدِينَةِ لَرِجَالاً:', start: 15.6, end: 19.0 },
    { text: 'مَا سِرْتُمْ مَسِيراً وَلَا قَطَعْتُمْ وَادِياً', start: 19.1, end: 23.0 },
    { text: 'إِلَّا كَانُوا مَعَكُمْ،', start: 23.1, end: 25.5 },
    { text: 'حَبَسَهُمُ الْمَرَضُ».', start: 25.6, end: 28.5 },
    { text: 'وَفِي رِوَايَةٍ: «إِلَّا شَرَكُوكُمْ فِي الأَجْرِ»', start: 28.6, end: 32.5 },
    { text: 'رَوَاهُ مُسْلِمٌ.', start: 32.6, end: 35.0 },
    { text: 'وَرَوَاهُ الْبُخَارِيُّ عَنْ أَنَسٍ رضي الله عنه قَالَ:', start: 35.1, end: 39.5 },
    { text: 'رَجَعْنَا مِنْ غَزْوَةِ تَبُوكَ مَعَ النَّبِيِّ ﷺ، فَقَالَ:', start: 39.6, end: 45.0 },
    { text: '«إِنَّ أَقْوَاماً خَلْفَنَا بِالْمَدِينَةِ:', start: 45.1, end: 48.5 },
    { text: 'مَا سَلَكْنَا شِعْباً وَلَا وَادِياً', start: 48.6, end: 52.0 },
    { text: 'إِلَّا وَهُمْ مَعَنَا،', start: 52.1, end: 55.0 },
    { text: 'حَبَسَهُمُ الْعُذْرُ».', start: 55.1, end: 58.5 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>غزاة:</b> <span> السير الى قتال العدو. </span></li>
        <li><b>غزوه تبوك:</b> <span>  في ٩ ه‍ـ.</span></li>
        <li><b>شعباً:</b> <span>طريق في الجبل. </span></li>
         <li><b>وادياً:</b> <span> كل المفرج بين الجبال والتلال.  </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/hadith/08.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> جابر ابن عبد الله الانصاري',
  ' <b> شهد بيعه العقبه الثانيه</b>  وهو صغير فكان اصغر من شهدها.',
  'شهد مع رسول الله ﷺ ١٨ غزوه.',
  'لم يشهد بدر واحد لصغر سنه ولم يتخلف عن رسول الله ﷺ في غزوه غزاها بعد.',
  ' استغفر له رسول الله ﷺ<b> ليله البعير </b>  حين اشترى منه بعيره في <b>غزوة ذات الرقاع</b>.  ',
  'عُمي في اخر عمره.',
  'اخر من مات بالمدينه ممن شهدة العقبه.',
  'توفي وعمره ٩٤ سنه.'
];

export const hadithFawaedList = [
  '• <b>١. فضل النيه في الخير.</b>',
  '• الانسان يبلغ بنيته اجر العامل اذا منعه العذر عن العمل.',
  '• <b>٣. حكمة بليغة من النبي :</b> لمن خرج للجهاد ويرى انه خير منن قعد ولم يخرج بسبب عذره ... إن الفضل والمنه لله الذي اخرجه للجهاد ولله يطلع الى ما في قلوب عباده.'
];