export const hadithDetails = {

 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
   // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  { text: 'عَنْ أَبِي عَبْدِ اللهِ جَابِرِ بْنِ عَبْدِ اللهِ الأَنْصَارِيِّ رَضِيَ اللهُ عَنْهُمَا قَالَ:', start: 0, end: 5.6},
    { text: 'كُنَّا مَعَ النَّبِيِّ ﷺ فِي غَزَاةٍ،', start: 5.7, end: 9.6 },
    { text: 'فَقَالَ: «إِنَّ بِالْمَدِينَةِ لَرِجَالاً: مَا سِرْتُمْ مَسِيراً وَلَا قَطَعْتُمْ وَادِياً إِلَّا كَانُوا مَعَكُمْ،', start: 9.7, end: 17 },
 
    { text: 'حَبَسَهُمُ الْمَرَضُ».', start: 17.1, end: 18.4 },
    { text: 'وَفِي رِوَايَةٍ: «إِلَّا شَرَكُوكُمْ فِي الأَجْرِ»', start: 18.5, end: 22.3 },
    { text: 'رَوَاهُ مُسْلِمٌ.', start: 22.4, end: 23 },
    { text: 'وَرَوَاهُ الْبُخَارِيُّ عَنْ أَنَسٍ رضي الله عنه قَالَ:', start: 23.1, end: 27.2 },
    { text: 'رَجَعْنَا مِنْ غَزْوَةِ تَبُوكَ مَعَ النَّبِيِّ ﷺ، فَقَالَ:', start: 27.3, end: 32.2 },
    { text: '«إِنَّ أَقْوَاماً خَلْفَنَا بِالْمَدِينَةِ: مَا سَلَكْنَا شِعْباً وَلَا وَادِياً إِلَّا وَهُمْ مَعَنَا،', start: 32.3, end: 39 },
    { text: 'حَبَسَهُمُ الْعُذْرُ».', start: 39.1, end: 40 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>غزاة:</b> <span> السير الى قتال العدو. </span></li>
        <li><b>غزوه تبوك:</b> <span>  في ٩ ه‍ـ.</span></li>
        <li><b>شعباً:</b> <span>طريق في الجبل. </span></li>
         <li><b>وادياً:</b> <span> كل المفرج بين الجبال والتلال.  </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
   audioUrl: 'audio/ryad-bab-1/hadith-4.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> جابر ابن عبد الله الانصاري',
  ' <b>شهد بيعه العقبه الثانيه</b>  وهو صغير فكان اصغر من شهدها.',
  'شهد مع رسول الله ﷺ ١٨ غزوه.',
  'لم يشهد بدر واحد لصغر سنه ولم يتخلف عن رسول الله ﷺ في غزوه غزاها بعد.',
  'استغفر له رسول الله ﷺ<b> ليله البعير </b>  حين اشترى منه بعيره في <b>غزوة ذات الرقاع</b>.  ',
  'عُمي في اخر عمره.',
  'اخر من مات بالمدينه ممن شهدة العقبه.',
  'توفي وعمره ٩٤ سنه.'
];

export const hadithFawaedList = [
  '• <b>١. فضل النيه في الخير.</b>',
   '• <b>٢. الانسان يبلغ بنيته اجر العامل اذا منعه العذر عن العمل.</b>',
  '• <b>٣. حكمة بليغة من النبي :</b> لمن خرج للجهاد ويرى انه خير منن قعد ولم يخرج بسبب عذره ... إن الفضل والمنه لله الذي اخرجه للجهاد ولله يطلع الى ما في قلوب عباده.'
];