export const hadithDetails = {

 phrases: [
  { text: 'عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا: أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ:', start: 0, end: 0 },
  { text: '«لَوْ أَنَّ لِابْنِ آدَمَ وَادِياً مِنْ ذَهَبٍ', start: 0, end: 0 },
  { text: 'أَحَبَّ أَنْ يَكُونَ لَهُ وَادِيَانِ،', start: 0, end: 0 },
  { text: 'وَلَنْ يَمْلَأَ فَاهُ إِلَّا التُّرَابُ،', start: 0, end: 0 },
  { text: 'وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ»', start: 0, end: 0 }
],

  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
      <li><b>لا يملأ فاه إلا التراب:</b> <span> كناية عن الموت فكأنه لا يشبع من الدنيا حتى يموت ...<br>  وذكر التراب لأن المرء لا ينقضي طعمه حتى يموت ...<br>  فإذا مات كان من شأنه أن يدفن فإذا دفن صب عليه التراب فملأ جوفه وفاه عيناه.</span></li>
      <li><b> ويتوب الله على من تاب: </b> <span>   الله يقبل التوبه من الحريص على التوبه. </span></li>
     
      </ul>
    </div>

  `,
  // رابط صوت متن الحديث السادس
   audioUrl:   'audio/ryad-bab-2/hadith-23.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>١. حرص بني آدم على جمع المال وغيره من متاع الدنيا وهذا حرص مذموم ، اذا كان فيه تضييع للطاعة وانشغال القلب بالدنيا اكثر من الاخرة. </b>',
'<b>٢. من يسال الله في كل ساعة توسعة الدنيا لينفقها على الخلق فلا حرج ... فحكم من يطلب من الله كثره الدنيا لينفقها حُكم من يطلب من الله كثرة الاعمال الصالحة ← لان كليهما عبادة. </b>',
'<b> ٣. على الانسان ان يتذكر الموت ليقطع طعمه من الدنيا.</b>',
'<b> ٤. باب التوبه مفتوح (إن ربك واسع المغفرة).</b>',
'<b>٥. لا يمكن للانسان ان يتخلص من صفاته المذمومة الا بالرجوع الى الله وطلب المغفرة منه. </b>',
];


