export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
// مقطع المقدمة والقصة وتفاصيل الرجل الأول (بر الوالدين)
    { text: 'عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ:', start: 0, end: 5.9},
    { text: 'سَمِعْتُ رَسُولُ اللهِ ﷺ يَقُولُ:', start: 6, end: 10 },
    { text: '«انْطَلَقَ ثَلَاثَةُ نَفَرٍ مِمَّنْ كَانَ قَبْلَكُمْ', start: 10.1, end: 13.0 },
    { text: 'حَتَّى آوَاهُمُ الْمَبِيتُ إِلَى غَارٍ فَدَخَلُوهُ،', start: 13.1, end: 16.7 },
    { text: 'فَانْحَدَرَتْ صَخْرَةٌ مِنَ الْجَبَلِ', start: 16.8, end: 19 },
    { text: 'فَسَدَّتْ عَلَيْهِمُ الْغَارَ، ', start: 19.1, end: 21 },
    { text: 'فَقَالُوا: إِنَّهُ لَا يُنْجِيكُمْ مِنْ هَذِهِ الصَّخْرَةِ', start: 21.1, end: 25 },
    { text: 'إِلَّا أَنْ تَدْعُوا اللهَ بِصَالِحِ أَعْمَالِكُمْ.', start: 25.1, end: 28.5},

    { text: 'قَالَ رَجُلٌ مِنْهُمْ:', start: 28.6, end: 30.0 },
    { text: 'اللَّهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ،', start: 30.1, end: 32.4 },
    { text: 'وَكُنْتُ لَا أَغْبِقُ قَبْلَهُمَا أَهْلًا وَلَا مَالًا،', start: 32.5, end: 36},
    { text: 'فَنَأَى بِي طَلَبُ الشَّجَرِ يَوْمًا،', start: 36.1, end: 39 },
    { text: 'فَلَمْ أُرِحْ عَلَيْهِمَا حَتَّى نَامَا،', start: 39.1, end: 41.5 },
    { text: 'فَحَلَبْتُ لَهُمَا غَبُوقَهُمَا ', start: 41.6, end: 44 },
    { text: 'فَوَجَدْتُهُمَا نَائِمَيْنِ', start: 44.1, end: 46 },
    { text: '،فَكَرِهْتُ أَنْ أُوقِظَهُمَا', start: 46.1, end: 48.4 },
    { text: 'وَأَنْ أَغْبِقَ قَبْلَهُمَا أَهْلًا أَوْ مَالًا،', start: 48.5, end: 52.5 },
    { text: 'فَلَبِثْتُ ـ وَالْقَدَحُ عَلَى يَدِي ـ أَنْتَظِرُ اسْتِيقَاظَهُمَا حَتَّى بَرَقَ الْفَجْرُ، وَالصِّبْيَةُ يَتَضَاغَوْنَ عِنْدَ قَدَمَيَّ،', start: 52.6, end: 60},
    { text: 'فَاسْتَيْقَظَا فَشَرِبَا غَبُوقَهُمَا،', start: 60.1, end: 62.4 },
    { text: 'اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ هَذا ابْتِغَاءَ وَجْهِكَ فَفَرِّج عَنَّا مَا نَحْنُ فِيهِ مِنْ هَذِهِ الصَّخْرَةِ.', start: 62.5, end: 70 },
    { text: 'فَانْفَرَجَتْ شَيْئاً لَا يَسْتَطِيعُونَ الْخُرُوجَ مِنْهُ.', start: 70.1, end: 73.5 },

    // تفاصيل الرجل الثاني (العفة وخوف الله)
    { text: 'قَالَ الْآخَرُ:', start: 73.6, end: 76 },
    { text: 'اللَّهُمَّ إِنَّهُ كَانَتْ لِيَ ابْنَةُ عَمٍّ', start: 76.1, end: 78.5 },
    { text: 'كَانَتْ أَحَبَّ النَّاسِ إِلَيَّ ـ ', start: 78.6, end: 80.6},
    { text: 'وَفِي رِوَايَةٍ: كُنْتُ أُحِبُّهَا كَأَشَدِّ مَا يُحِبُّ الرِّجَالُ النِّسَاءَ ـ', start: 80.7, end: 86 },
    { text: 'فَأَرَدْتُهَا عَلَى نَفْسِهَا فَامْتَنَعَتْ مِنِّي،', start: 86.1, end: 89},
    { text: 'حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ', start: 89.1, end: 92 },
    { text: 'فَجَاءَتْنِي، فَأَعْطَيْتُهَا عِشْرِينَ وَمِئَةَ دِينَارٍ ', start: 92.1, end: 97 },
    { text: 'عَلَى أَنْ تُخَلِّيَ بَيْنِي وَبَيْنَ نَفْسِهَا، فَفَعَلَتْ، ', start: 97.1, end: 101 },
    { text: 'حَتَّى إِذَا قَدَرْتُ عَلَيْهَا ـ', start: 101.1, end: 103 },
    { text: 'وَفِي رِوَايَةٍ: فَلَمَّا قَعَدْتُ بَيْنَ رِجْلَيْهَا ـ', start: 103.1, end: 106 },
    { text: 'قَالَتْ: اتَّقِ اللهَ وَلَا تَفُضَّ الْخَاتَمَ إِلَّا بِحَقِّهِ.', start: 106.1, end: 110.4 },
    { text: 'فَانْصَرَفْتُ عَنْهَا', start: 110.5, end: 111.5 },
    { text: 'وَهِيَ أَحَبُّ النَّاسِ إِلَيَّ،', start: 111.6, end: 113 },
    { text: 'وَتَرَكْتُ الذَّهَبَ الَّذِي أَعْطَيْتُهَا،', start: 113.1, end: 115.6},
    { text: 'اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ', start: 115.7, end: 119.5},
    { text: 'فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ.', start: 119.6, end: 121 },
    { text: 'فَانْفَرَجَتِ الصَّخْرَةُ، غَيْرَ أَنَّهُمْ لَا يَسْتَطِيعُونَ الْخُرُوجَ مِنْهَا.', start: 121.1, end: 127 },


    // تفاصيل الرجل الثالث (الأمانة وحفظ حقوق الآخرين)
    { text: 'وَقَالَ الثَّالِثُ: ', start: 127.1, end: 129 },
    { text: 'اللَّهُمَّ اسْتَأْجَرْتُ أُجَرَاءَ وَأَعْطَيْتُهُمْ أَجْرَهُمْ، غَيْرَ رَجُلٍ وَاحِدٍ تَرَكَ الَّذِي لَهُ وَذَهَبَ', start: 129.1, end: 136 },
    { text: '، فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الْأَمْوَالُ،', start: 136.1, end: 139.8 },
    { text: 'فَجَاءَنِي بَعْدَ حِينٍ فَقَالَ:', start: 139.9, end: 141 },
    { text: 'يَا عَبْدَ اللهِ أَدِّ إِلَيَّ أَجْرِي.', start: 141.1, end: 144 },
    { text: 'فَقُلْتُ: كُلُّ مَا تَرَى مِنْ أَجْرِكَ:', start: 144.1, end: 146.5 },
    { text: 'مِنَ الْإِبِلِ وَالْبَقَرِ وَالْغَنَمِ وَالرَّقِيقِ.', start: 146.6, end: 149 },
    { text: 'فَقَالَ: يَا عَبْدَ اللهِ لَا تَسْتَهْزِئْ بِي.', start: 149.1, end: 152},
    { text: 'فَقُلْتُ: لَا أَسْتَهْزِئُ بِكَ.', start: 152.1, end: 154.5 },
    { text: 'فَأَخَذَهُ كُلَّهُ فَاسْتَاقَهُ فَلَمْ يَتْرُكْ مِنْهُ شَيْئاً، ', start: 154.6, end: 159.0 },
    { text: 'اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ', start: 159.1, end: 162.1 },
    { text: 'فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ.', start: 162.1, end: 164.0 },
    { text: 'فَانْفَرَجَتِ الصَّخْرَةُ، فَخَرَجُوا يَمْشُونَ»', start: 164.1, end: 167.0 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>نفر:</b> <span>ما دون العشره من الرجال.</span></li>
        <li><b>الغار:</b> <span>الكهف في الجبل.</span></li>
        <li><b>نأى بي:</b> <span>بَعُد.</span></li>
        <li><b>لا اغبق:</b> <span>لا اشرب شراب الغبوق (الغبوق ما امسى عند القوم من اللبن).</span></li>
        <li><b>فلم ارح عليهما:</b> <span>الاراحه رد الابل والغنم عند العشي الى مراحها.</span></li>
        <li><b>يتضاعون:</b> <span>يصيحون من الجوع.</span></li>
        <li><b>برق:</b> <span>ظهر.</span></li>
        <li><b>المت:</b> <span>نزلت بها ملمة شديده من شدائد الدنيا.</span></li>
      </ul>
    </div>
  `,
 
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/ryad-bab-1/hadith-12.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b>ابو عبد الرحمن عبد الله بن عمر بن الخطاب  .  ',
  '•١.اسلم مع ابيه وهاجر مع ابيه .',
  '•٢.لم يشهد بدر واحد لصغر سنه.  ',
  '•٣.فكانت اول غزوة الخندق وعمره 15 سنه .',
  '• ٤.كان من اشد الصحابه اتباعا لرسول الله . ',
  '• ٥.كان شديد الورع والتقى. ',
  '•٦. كان كثير العتق للعبيد حتى وصل عددهم الى 1000 <b> "مَن خدعنا بالله انخدعنا له". </b> ',
  '•٧. شهد له رسول الله بالصلاح. ان عبد الله بطل، صالح. يقول جابر عن ابن عمر:<b> ما مِنَّا أحَدٌ أدْرَكَ الدُّنيا إلَّا مَالتْ به ومَالَ بِهَا، إلا ابن عمر.</b>',
  '•٨.توفي في مكه وعمره 84 سنه.'
];

export const hadithFawaedList = [
'• <b>١.استجابه الدعاء وقت الكرب وغيره والتوسل الى الله بصالح الاعمال.</b>',
'• <b>٢.فضل بر الوالدين وخدمتهما وايثارهما على الزوجه والاولاد.</b>',
'• <b>٣.فضل العفاف والكف عن المحرمات.</b>',
'• <b>٤.فضل الوفاء بالعهد وتاديه الامانه والسماحه في المعامله.</b>',
'• <b>٥.لا عبر بالعمل الا ان كان خالصا لله.</b>',
];