export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ:', start: 0, end: 3.7 },
  { text: 'سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ:', start: 3.8, end: 7.2 },
  { text: '«وَاللهِ إِنِّي لَأَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ فِي اليَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً»', start: 7.3, end: 13 }
],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لاستغفر الله:</b> <span>  اطلب المغفره وهي الصفح عن الذنب واصل المغفره الستر.  </span></li>
        <li><b>اتوب اليه:</b> <span>  الرجوع من الذنب والندم على ما فرّط منه. </span></li>
      </ul>
    </div>
   

  `,
  // رابط صوت متن الحديث السادس
   audioUrl: 'audio/ryad-bab-2/hadith-13.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>١- جواز القسم للتاكيد على اهميه الامر.</b>',
  '<b> ٢- حال النبي وما كان عليه من دوام المراقبه لله.  </b> ',
  '<b> ٣- حاجه الناس للاستغفار. </b> ',
  '<b> ٤- ضروره قرن الاستغفار مع التوبه.  </b> ',
  '<b> ٥- المواظبه يومياً على الاستغفار والتوبه. </b> ',

];



export const hadithFawaedList = [
  '<b>١- الاستغفار سبب النجاه (قال علي رضي الله عنه: العجب ممن يهلك ومعه النجاه قيل: وما هي؟ قال: الاستغفار).</b>',
  '<b>٢- يمحو الذنوب والخطايا (قيل لابن الجوزي؛ أأسبح ام استغفر؟ فقال: الثوب الوسخ احوج الى الصابون من البخور).</b>',
  '<b> ٣- الاستغفار سبب لنزول البركات من السماء والامداد بالاموال والبنين (فقلت استغفروا ربكم انه كان غفارا يرسل السماء عليكم مدرارا).</b> '
];