export const hadithDetails = {
  title: 'الحديث الخامس',
  name: '[إبْطَالُ المُنْكَرَاتِ والبِدَعِ]',
  hintText: 'الاسلام هو اتباع لا ابتداع',

  phrases: [
    // 💡 العنوان
    { text: 'الْحَدِيثُ الخامِسُ: [إبْطَالُ المُنْكَرَاتِ والبِدَعِ]', start: 0, end: 6 },

    // الراوي والسند
    { text: 'عَنْ أُمِّ المُؤْمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ رَضِيَ اللهُ عَنْهَا قَالَتْ:', start: 6.1, end: 12.1 },
    { text: 'قَالَ رَسُولُ اللهِ ﷺ:', start: 12.2, end: 16},

    // الرواية الأولى
    { text: '«مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ».', start: 16.1, end: 21.6 },
    { text: 'رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ.', start: 21.7, end: 24.7},

    // الرواية الثانية
    { text: 'وَفِي رِوَايَةٍ لِمُسْلِمٍ:', start: 24.8, end: 27 },
    { text: '«مَنْ عَمِلَ عَمَلَاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ».', start: 27.1, end: 32 }
  ],

  explanation: `
   <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>من احدث:</b> <span>الحديث: ضد القديم، ومعنى احدث: اخترع وانشأ من قبل نفسه</span></li>
        <li><b>في امرنا:</b> <span>في ديننا وشرعنا، اما امور الدنيا فلا تدخل في هذا النهي</span></li>
        <li><b>ما ليس منه:</b> <span>اي ما ينافيه ويناقضه ولا يشهد له شيء من قواعد الدين وادلته</span></li>
        <li><b>فهو رد:</b> <span>باطل لا يقبل من فاعله ولا يعتد به</span></li>
        <li><b>الحديث يدل على ان:</b> <span>الاسلام هو اتباع لا ابتداع</span></li>
        <li><b>البدعه المحموده:</b> <span>تكون من اصل القرآن والسنه النبويه مثالها عندما امر ابو بكر رضي الله عنه بكتابه القرآن الكريم وعندما جمع عمر بن الخطاب رضي الله عنه الناس على صلاه التراويح</span></li>
        <li><b>من عمل عملا:</b> <span>اي اتبع بدعه لم يحدثها هو وإنما احدثها غيره ثم جاء هو وعملها اتباعا لمحدثها</span></li>
        <li><b>الامام الشافعي يقول:</b> <span>ما احدث وخالف كتابا او سنه او اجتماعا او اثرا فهو البدعه الضلاله، وما احدث من الخير ولم يخالف شيئا من ذلك فهو البدعه المحموده.</span></li>
      </ul>
    </div>
  `,

  audioUrl: 'audio/hadith/05.mpeg' // Kom ihåg att matcha din filstruktur!
};

// 📝 الصندوق الأول: أهمية الحديث الشريف
export const hadithImportanceList = [
  '<b> الاستحداث المذموم في أمور الدين هو مرفوض</b>',
  '<b>الاستحداث المذموم هو ما خالف الكتاب والسنة</b>',
  '<b>لا أتعبد إلا بالأشياء التي أمرني بها من العبادات</b>',
  '<b>كل عمل لا يقبل عند الله إلا بشرطين: </b><br>  ١. خالصاً لله<br> ٢. موافقاً للشرع'
];

// 📝 الصندوق الثاني: من فوائد الحديث الشريف
export const hadithFawaedList = [
'<b>يقول أحمد بن حنبل أصول الإسلام تقوم على ثلاثة أحاديث:</b>',
  '١.إنما الأعمال بالنيات.',
  '٢.من عمل عملاً ليس عليه أمرنا فهو رد .',
  '٣.الحلال بين والحرام بين.'
];
