export const hadithDetails = {

 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
{ text: 'عَنْ أَبِي مُوسَى عَبْدِ اللهِ بْنِ قَيْسٍ الأَشْعَرِيِّ  رضي الله عنه قَالَ: ', start: 0, end: 5.4 },
    { text: 'سُئِلَ رَسُولُ اللهِ ﷺ', start: 5.6, end: 8.3 },
    { text: 'عَنِ الرَّجُلِ يُقَاتِلُ شَجَاعَةً،', start: 8.4, end: 11.3 },
    { text: 'وَيُقَاتِلُ حَمِيَّةً، وَيُقَاتِلُ رِيَاءً. ', start: 11.4, end: 14.3 },
    { text: 'أَيُّ ذَلِكَ فِي سَبِيلِ اللهِ؟', start: 14.4, end: 16 },
    { text: 'فَقَالَ رَسُولُ اللهِ ﷺ:', start: 16.1, end: 18.5},
    { text: '«مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللهِ»', start: 18.7, end: 24}
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>حميه:</b> <span> انفه وغيرة ومحامه عن عشيرته بالحق والباطل.  </span></li>
        <li><b>رياء:</b> <span>  مراءه ليرى الناس مقاتله. </span></li>
         <li><b>كلمه الله:</b> <span> دين الله.</span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
 audioUrl: 'audio/ryad-bab-1/hadith-8.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
  '<b>الراوي:</b> ابي موسى الاشعري عبد الله بن قيس.  ',
  '•قدما من اليمن بعد فتح خيبر صادفتهم سفينه جعفر فقدموا جميعا الى المدينه. ',
  '•قال رسول الله عن اهل اليمن (اتاكم اهل اليمن اضعف قلوبا وارق افئده الفقه يمان والحكمه يمانيه).',
  '•قال عنه رسول الله (سيد الفوارس ابي موسى).',
  '•وقال له (لَقَدْ أُوتِيتَ مِزْمَاراً مِنْ مَزَامِيرِ آلِ دَاوُدَ). ',
  '•قضاة امتي اربعه: ( عمر وعلي وابي موسى وزيد بن ثابت). ',
  '•شهد فتوح الشام.'
 
];

export const hadithFawaedList = [
  '• <b>ارضاء الله.</b>',
  '• <b> اعلاء كلمه الحق.</b>',
'• <b> اباح الجميع المال الحلال.</b>',
'• <b>دحر الاعداء.</b>',
'• حسب النيه فهنالك من يقاتل حميه وشجاعه للاسلام والمسلمين فهو في سبيل الله كلاً على حسب نيته يؤجر.'
];

export const hadithFawaed1 = [
  '• <b>١. الاعمال تعد بها عند الله حسب النيه الصالحه. </b>',
  '• <b> ٢. الفضل الوارد للمجاهدين فقد بمن يقاتل لاعلاء كلمه التوحيد. </b>',
'• <b> ٣. ذم الحرص على الدنيا والقتال لحظ النفس في غير طاعه. </b>',
'• <b>٤. تقدم العلم على العمل حتى يكون عمل الانسان على بينه. </b>',
'• <b> ٥. جواز السؤال عن العله واستحباب البيان عنها.</b>'
];