export const hadithDetails = {
 phrases: [// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
  // متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
// متن الحديث مقسم إلى جمل لتسهيل التظليل المتزامِن مع الصوت بناءً على فواصلكِ الدقيقة
    { text: 'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ:', start: 0, end: 3.8 },
    { text: 'قَالَ رَسُولُ اللهِ ﷺ: ', start: 3.9, end: 6.5 },
    { text: '«صَلَاةُ الرَّجُلِ فِي جَمَاعَةٍ', start: 6.6, end: 8.6},
    { text: 'تَزِيدُ عَلَى صَلَاتِهِ فِي بَيْتِهِ وَصَلَاتِهِ فِي سُوقِهِ بِضْعاً وَعِشْرِينَ دَرَجَةً،', start: 8.7, end: 13.9 },
    { text: 'وَذَلِكَ أَنَّ أَحَدَهُمْ إِذَا تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ،', start: 14, end: 17.9},
    { text: 'ثُمَّ أَتَى الْمَسْجِدَ،', start: 18, end: 19.2 },
    { text: 'لَا يَنْهَزُهُ إِلَّا الصَّلَاةُ،', start: 19.3, end: 21.3 },
    { text: 'لَا يُرِيدُ إِلَّا الصَّلَاةَ،', start: 21.4, end: 22.8 },
    { text: 'لَمْ يَخْطُ خَطْوَةً إِلَّا رُفِعَ لَهُ بِهَا دَرَجَةً،', start: 22.8, end: 26.7 },
    { text: 'وَحُطَّ عَنْهُ بِهَا خَطِيئَةً،', start: 26.8, end: 29 },
    { text: 'حَتَّى يَدْخُلَ الْمَسْجِدَ،', start: 29.1, end: 31.3 },
    { text: 'فَإِذَا دَخَلَ الْمَسْجِدَ كَانَ فِي الصَّلَاةِ مَا كَانَتِ الصَّلَاةُ هِيَ تَحْبِسُهُ،', start: 31.4, end: 37.2 },
    { text: 'وَالْمَلَائِكَةُ يُصَلُّونَ عَلَى أَحَدِكُمْ مَا دَامَ فِي مَجْلِسِهِ الَّذِي صَلَّى فِيهِ،', start: 37.3, end: 43},
    { text: 'يَقُولُونَ: اللَّهُمَّ ارْحَمْهُ،', start: 43.1, end: 46.6 },
    { text: 'اللَّهُمَّ اغْفِرْ لَهُ، ', start: 46.7, end: 47.5 },
    { text: 'اللَّهُمَّ تُبْ عَلَيْهِ،', start: 47.6, end: 48.7},
    { text: 'مَا لَمْ يُؤْذِ فِيهِ،', start: 48.9, end: 50 },
    { text: 'مَا لَمْ يُحْدِثْ فِيهِ»', start: 50.1, end: 52 }
  ],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>البضعه:</b> <span> وهي القطعه من ٣ الى ١٠.</span></li>
        <li><b>ينهزه:</b> <span> لا يدفعه.  </span></li>
         <li><b>خطوه:</b> <span>  ما بين القدمين. </span></li>
          <li><b>احسن الوضوء:</b> <span>  اسبغه واتى بسننه وادابه.</span></li>
           <li><b>درجه:</b> <span> مرتبه. </span></li>
            <li><b>كان في الصلاه:</b> <span> في ثوابها. </span></li>
      </ul>
    </div>
  `,
  // رابط صوت متن الحديث السادس
  audioUrl: 'audio/ryad-bab-1/hadith-10.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b> ١. افضلية الصلاه على سائر العبادات.</b> ',
'<b> ٢. صلاة الجماعة سنة ليست فريضة.</b> ',
'<b> ٣. الحدث في المسجد خطيئة يحرم به المحدث استغفار الملائكة.</b> ',
'<b> ٤. فضيله انتظار الصلاه. </b> ',
'<b> اضاءه</b>  يقول ابن بطال: من أراد حط الذنوب بغير تعب؛ فليلزم مصلاه بعد الصلاة ليستكثر من دعاء الملائكة واستغفارهم له. ',

 
];

