export const hadithDetails = {

 phrases: [
 { text: 'عَنْ زِرِّ بْنِ حُبَيْشٍ قَالَ:', start: 0, end: 0 },
  { text: 'أَتَيْتُ صَفْوَانَ بْنَ عَسَّالٍ رَضِيَ اللهُ عَنْهُ أَسْأَلُهُ عَنِ المَسْحِ عَلَى الخُفَّيْنِ، فَقَالَ:', start: 0, end: 0 },
  { text: 'مَا جَاءَ بِكَ يَا زِرُّ؟', start: 0, end: 0 },
  { text: 'فَقُلْتُ: ابْتِغَاءَ العِلْمِ،', start: 0, end: 0 },
  { text: 'فَقَالَ:', start: 0, end: 0 },
  { text: 'إِنَّ المَلَائِكَةَ تَضَعُ أَجْنِحَتَهَا لِطَالِبِ العِلْمِ رِضاً بِمَا يَطْلُبُ.', start: 0, end: 0 },
  { text: 'فَقُلْتُ:', start: 0, end: 0 },
  { text: 'إِنَّه قَدْ حَكَّ فِي صَدْرِي المَسْحُ عَلَى الخُفَّيْنِ بَعْدَ الغَائِطِ وَالبَوْلِ،', start: 0, end: 0 },
  { text: 'وَكُنْتَ امْرَأً مِنْ أَصْحَابِ النَّبِيِّ ﷺ،', start: 0, end: 0 },
  { text: 'فَجِئْتُ أَسْأَلُكَ:', start: 0, end: 0 },
  { text: 'هَلْ سَمِعْتَهُ يَذْكُرُ فِي ذَلِكَ شَيْئاً؟', start: 0, end: 0 },
  { text: 'قَالَ: نَعَمْ،', start: 0, end: 0 },
  { text: 'كَانَ يَأْمُرُنَا إِذَا كُنَّا سَفْراً - أَوْ: مُسَافِرِينَ - أَنْ لَا نَنْزِعَ خِفَافَنَا ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ إِلَّا مِنْ جَنَابَةٍ،', start: 0, end: 0 },
  { text: 'لَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ.', start: 0, end: 0 },
  { text: 'فَقُلْتُ: هَلْ سَمِعْتَهُ يَذْكُرُ فِي الهَوَى شَيْئاً؟', start: 0, end: 0 },
  { text: 'قَالَ: نَعَمْ،', start: 0, end: 0 },
  { text: 'كُنَّا مَعَ رَسُولِ اللهِ فِي سَفَرٍ،', start: 0, end: 0 },
  { text: 'فَبَيْنَمَا نَحْنُ عِنْدَهُ إِذْ نَادَاهُ أَعْرَابِيٌّ بِصَوْتٍ لَهُ جَهْوِرِيٍّ:', start: 0, end: 0 },
  { text: 'يَا مُحَمَّدُ، فَأَجَابَهُ رَسُولُ اللهِ ﷺ نَحْواً مِنْ صَوْتِهِ:', start: 0, end: 0 },
  { text: '«هَاؤُمُ»', start: 0, end: 0 },
  { text: '(٤). فَقُلْتُ لَهُ: وَيْحَكَ، اغْضُضْ مِنْ صَوْتِكَ، فَإِنَّكَ عِنْدَ النَّبِيِّ ﷺ، وَقَدْ نُهِيتَ عَنْ هَذَا.', start: 0, end: 0 },
  { text: 'فَقَالَ: وَاللهِ لَا أَغْضُضُ.', start: 0, end: 0 },
  { text: 'قَالَ الأَعْرَابِيُّ: المَرْءُ يُحِبُّ القَوْم... وَلَمَّا يَلْحَقْ بِهِمْ؟', start: 0, end: 0 },
  { text: 'قَالَ النَّبِيُّ ﷺ:', start: 0, end: 0 },
  { text: '«المَرْءُ مَعَ مَنْ أَحَبَّ يَوْمَ القِيَامَةِ».', start: 0, end: 0 },
  { text: 'فَمَا زَالَ يُحَدِّثُنَا حَتَّى ذَكَرَ بَاباً مِنَ المَغْرِبِ مَسِيرَةُ عَرْضِهِ، أَوْ: يَسِيرُ الرَّاكِبُ فِي عَرْضِهِ أَرْبَعِينَ أَوْ: سَبْعِينَ عَاماً.', start: 0, end: 0 },
  { text: 'قَالَ سُفْيَانُ أَحَدُ الرُّوَاةِ:', start: 0, end: 0 },
  { text: '«قِبَلَ الشَّامِ، خَلَقَهُ اللهُ تَعَالَى يَوْمَ خَلَقَ السَّمَاوَاتِ وَالأَرْضَ،', start: 0, end: 0 },
  { text: 'مَفْتُوحاً لِلتَّوْبَةِ، لَا يُغْلَقُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْهُ» .', start: 0, end: 0 }

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b> ابتغاء العلم: </b> <span>    من اجل طلب العلم.   </span></li>
         <li><b> تضع اجنحتها: </b> <span>   مجاز عن معاونته وتيسير سعيه. </span></li>
          <li><b> حك في صدري: </b> <span>  وقع فيك شك.  </span></li>
           <li><b> سفْراً: </b> <span>  وهي جمع مسافر ، <b>وسمي السفر سفراً: </b> لانه يسفر عن وجوه المسافرين واخلاقهم ويظهر ما كان خافياً منها.  </span></li>
            <li><b> يأمرنا: </b> <span>   الامر بالاباحه والجواز. </span></li>
             <li><b> الجنابه: </b> <span>   هي ما يوجب الغسل. </span></li>
              <li><b> الهوى: </b> <span>  الحب.  </span></li>
               <li><b> جهوري:</b> <span> شديد عال.   </span></li>
                <li><b> هاؤم: </b> <span>  تعال. </span></li>
                 <li><b>  اغضض:</b> <span> انقص من صوتك.  </span></li>
                  <li><b> ويحك: </b> <span> كلمه ترحّم وتوجع لمن وقع فيه سوء لا يستحقه.   </span></li>
                   <li><b> يحب القوم:</b> <span>  الاخيار من احياء واموات.   </span></li>
                    <li><b> لما يلحق بهم: </b> <span>   لم يعمل عمل مثل اعمالهم الصالحة من حيث الكمال. </span></li>
      </ul>
    </div>

  `,
  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-15.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي: زر بن حبيش.</b> <br> ١. اسدي كوفي.<br> ٢. ابو مريم. <br>  ٣. من كبار التابعين.   <br> ٤. ادرك ايام الجاهليه ثقه كبيره بالحديث.  <br> ٥. حدث عن عمر وعثمان وعلي.  <br> ٦. كان مقرئ الكوفه وعالمها. <br>  ٧. وفد الى المدينه في خلافه عثمان لرؤية ولقاء اصحاب رسول الله. <br> ٨. لازم عبد الرحمن بن عوف وأبي بن كعب. <br> ٩. مات وعمره 120 سنه.',
  '<b>صفوان بن عسال</b><br>  ١. بني الربض بن زاهر. <br> ٢. من سكان الكوفه.  <br> ٣. غزا مع النبي 12 غزوه.   <br> ٤. روى عنه ابن مسعود.'
];




export const hadithFawaedList = [
'<b>١- ندب الرحله في طلب العلم. </b>',
'<b>٢- فضل طالب العلم وتواضع الملائكه له</b> (اذا كان هذا الطالب لعلم فكيف لاحباره).',
'<b> ٣- الحث على محبه الصالحين رجاء اللحاق بهم والخلاص من النار. </b> ',
'<b> ٤- فضل حب الله ورسوله واهل الخير الاحياء والاموات.',
'<b>٥- جواز المسح على الخفين.',
'<b>٦- التادب مع العلماء والصالحين وخفض الصوت في مجالس العلم. </b>',
'<b>٧- التسليم والايمان بالمغيبات مما اخبر به النبي. </b>',
'<b> ٨- يقول الصحابه ما فرحنا بعد الاسلام فرحا اشد مما فرحنا من قول النبي</b> (المرء مع من احب يوم القيامه).'
];














