export const RYAD_BAB4_HADITHS: Record<string, any> = {
'1': {
    title: 'باب الصدق', 
    name: '', 
    hintText: '',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: 'باب الصدق ',
    box1Items: [
  '• <b>الصدق: لغةً:</b>  القوة في الشيء سواء كان قولاً أو غيره. ',
  '• <b> اصطلاحاً:</b>  مطابقة القول الظاهر للضمير والشيء المخبر عنه معاً. ',
  '• <b> الصدق أصل المحمودات ، ركن النبوات ، ونتيجة التقوى</b>',
  '• <b>   وهو استواء السر و العلانية والظاهر والباطن ... بأن لا تكذب أحوال العباد أعماله ولا أعماله أحواله ...</b>'
    ],
    box2Title: ' وللصدق ٦ معان:', 
    box2Items: [
    '• <b> في القول: صدق اللسان فيه الاخبار بالأشياء على حقيقتها دور زيادة أو نقصان. </b>', 
    '• <b> في النية والارادة وهي الاخلاص بكل شيء الله. </b>', 
    '• <b> صدق العزم: وهو العزم على العمل (ان رزقني الله مالاً سأتصدق ببعضه جارماً غير متردد في ذلك).</b>', 
    '• <b> صدق في الوفاء بالعزم اذا حصل على المال نسي العزم بالتصدق به. </b>', 
    '• <b> في الاعمال: أن تطابق أعماله وأقواله الباطنة فيجتهد على القيام بأعماله الظاهرة كما في الباطن.</b>', 
    '• <b> في مقامات الدين: أعلى الدرجات كالصدق بالتوكل والحب والخوف والرجاء.</b>'
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '2': {
    title: ' الحديث الأول ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-54.m4a',
    imageUrls: [ '/images/ryad/bab4/hadith1-bab4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>  يهدي:</b><span>  من الهداية  </span></li>
        <li><b> البر: </b><span> اسم جامع للخير كله من اكتساب حسنات واجتناب سئيات </span></li>
        <li><b> صديقاً: </b><span>من تكرر منه حتى يصير سجية له وخلقاً الفجور: الأعمال السيئة (الميل عن الصدق وأعمال الخير)   </span></li>
        <li><b> كذاباً </b><span> من تكرر فيه الكذب حتى يصير سجية له وخلقاً. </span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث',
    box1Items: [
    '<b> الصدق مفتاح كل خير والكذب مفتاح لكل شر  </b>',
    '<b>  الحث مع تحري الصدق والاعتناء به والتحذير من الكذب والتساهل فيه</b>',
    '<b>  الترغيب في الصدق لانه سبب كل خير والتحذير من الكذب لانه سبب كل شر.</b>',
    '<b> عاقبة الصدق الجنه وعاقبة الكذب النار </b>',
    '<b> الاعمال الصادقة بينها توافق وتلازم وكذلك الأعمال السيئة ... إن من ثواب الحسنة الحسنة بعدها وان من عقوبة السيئة السيئة بعدها. </b>'
    ],
    box2Title: '', 
    box2Items: [

    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '3': {
    title: ' الحديث الثاني ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-55.m4a',
    imageUrls: [ '/images/ryad/bab4/hadith2-bab4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> دع: </b><span> اترك </span></li>
        <li><b> يربيك </b><span> اترك ما تشك في حله إلى مالا تشك به  </span></li>
      </ul>
    </div>
  `,
    box1Title: 'نبذة عن الراوي',
    box1Items: [
    '<b class="nawawi-slut highlight-color"> الحسن هو سبط رسول الله من فاطمة وريحانته  </b>',
    '<b>  يكنى بأبي محمد </b>',
    '<b>  ولد في رمضان السنة ٣ هـ </b>',
    '<b> أشبه أهل رسول الله به وأحبهم له </b>',
    '<b>  حليماً ورعاً فاضلاً </b>',
    '<b>  ترك الملك رعيه فيما عند الله </b>',
    '<b> لما قتل علي بايعه أكثر من اربعين رجل بقي أربعة  </b>',
    '<b>  أشرف العراق ثم تنازل لمعاوية حقناً لدماء</b>',
    '<b>  أشتر في العراق ثم تنازل لمعاوية حقناً لدماء المسلمين وسمي هذا العام بعام الجماعة</b>',
    '<b> توفي عام ٥٠هـ </b>',
    '<b> دفن فى بقيع الغرقد </b>',
    ],
    box2Title: 'فوائد الحديث', 
    box2Items: [
   '<b> استحباب التنزه عن الشبهات والاقدام على ما هو حلال بين </b>',
   '<b> الاسلام حق واضح لا يقبل الشك والريبة فهو منسجم مع الفطرة  </b>',
   '<b> الصديق يبعث في نفس صاحبه الطمانينة في القلب وثقه الناس به، والكذب يبعث في نفسى صاحبه الشك والذل والصغار وعدم الثقة بين الناس </b>'
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '4': {
    title: ' الحديث الثالث ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-56.m4a',
    imageUrls: [ '/images/ryad/bab4/hadith3-bab4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> هرقل: </b><span> اسم لأحد ملوك الروم كان شجاعاً جباراً مقدماً في الحروب.   </span></li>
        <li><b> العفاف: </b><span> الكف عن المحارم وخوارم المروءة  </span></li>
        <li><b> صلة: </b><span>  صلة الارحام وكل ما أمر الله به.  </span></li>
      </ul>
    </div>
  `,
    box1Title: 'نبذة عن الراوي',
    box1Items: [
    '<b class="nawawi-slut highlight-color">  أبو سفيان صخر بن حرب</b>',
    '<b> أمه صفية بنت حزن عمة ميمونه زوج النبي  </b>',
    '<b>  أكبر من النبي بـ ١٠ س</b>',
    '<b>  أسلم عام الفتح </b>',
    '<b>  شهد حنين و الطائف</b>',
    '<b>  فقئت عينه يومئذ فلم يزل أعور حتى فقئت عينه الأخرى يوم اليرموك </b>',
    '<b> كان رأس المشركين يوم أحد ويوم الأحزاب  </b>',
    '<b> تزوج النبي من ابنته أم حبيبة قبل أن يسلم  </b>',
    '<b> هي كانت قد أسلمت وهاجرت مع زوجها إلى الحبشة وتوفي هناك بعد أن ارتد عن الاسلام  </b>',
    '<b>  من المؤلفة قلوبهم  </b>',
    '<b> أعطاه من غنائم حنين ١٠٠ بعير ٤٠ أوقية وأعطى ابنه يزيد ومعاوية. </b>',
    '<b>  فقال له رسول الله والله انك لكريم فداك أبي وأمي والله لقد حاربتك فلنعم المحارب كنت. ولقد سالمتك فلنعم المسالم أنت جزاك الله خيرا.</b>',
    '<b> لما رأى أبو سفيان الناس يطؤون عقب رسول الله حده فقال في نفسه : لو عاودت الجمع لهذا الرجل فضرب رسول الله في صدره فقال: اذن يخزيك الله، فقال أستغفر الله وأتوب إليه والله ما هو الا شيء حدثت به نفسي وما ايقنت انك رسول الله حتى الساعة </b>',
    '<b> ويقول سعيد بن المسيب يوم اليرموك اختفت الاصوات فلم أسمع الوصوت با نصر الله اقترب ... فنظرت فإذا هو ابو سفيان تحت رايه ابنه يزيد  </b>',
    '<b>  مات في خلافة عثمان</b>',
    '<b>   عاش ٩٣س. </b>'
    ],
    box2Title: 'فوائد الحديث', 
    box2Items: [
    '<b> التوحيد جوهر الدينه وخلاصة العقائد </b>',
    '<b> ملازمة رسول الله للصدق وشهادة الاعداء له بذلك </b>',
    '<b> التنفير من التقليد الأعمى وخاصة في أمور الدين  </b>',
    '<b>  الاسلام دين الفضائل ومجمع الخيرات والمحاسن وفي اقامته إصلاح الفرد. </b>',
    '<b> الاسلام ثورة على الجاهلية بكل مافيها سر مظاهر الشرك والوثنية </b>',

    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '5': {
    title: ' الحديث الرابع   ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-57.m4a',
    imageUrls: [ '/images/ryad/bab4/hadith4-bab4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> بدري: </b><span> حضر غزوة بدر </span></li>
        <li><b> الشهادة: </b><span>   في أصلها هي الموت في قتال الاعداء ابتغاء مرضاة اللهم وسميت شهادة لأن صاحبها من شهد له الله وملائكته بالجنة. <br>  وقيل لانه حيٌّ لم يمت كأنه شاهد حاضر ،<br>  وقيل لأن ملائكة الرحمة تشهد له ، <br>   وقيل لقيامه بشهادة الحق في أمر الله حتى قتل </span></li>
        <li><b>  منازل الشهداء:</b><span>  درجاتهم عند الله. </span></li>

      </ul>
    </div>
  `,
    box1Title: 'نبذة عن الراوي',
    box1Items: [
    '<b  class="nawawi-slut highlight-color">  سهل بن حنف </b>',
    '<b>  أنصاري أوسي  </b>',
    '<b> من السابقين  </b>',
    '<b> شهد بدراً م وثبت يوم أحد حين انكشف الناس  </b>',
    '<b>  بايع على الموت  </b>',
    '<b> كان ينفخ عن رسول الله بالنبل فقال: (نبلوا سهلاً فإنه سهل)  </b>',
    '<b> وشهد الحقوق والمشاهد كلها   </b>',
    '<b> استخلفه على البصرة بعد موقعة الجمل ثم شهد معه صفين   </b>',
    '<b>  آخى النبي بينه وبين علي </b>',
    '<b>  مات في الكوفه صلى عليه على</b>'
    ],
    box2Title: 'فوائد الحديث', 
    box2Items: [
    '<b>  ان صدق القلب سبب لبلوغ الأرب ومن نوى شيئاً من عمل البر أثيب عليه وان لم يتحقيق له عمله .</b>',
    '<b>  استحباب طلب الشهادة والاخلاص في ذلك</b>',
    '<b>  الشهادة بصدق هي أن تكون لإعلاء كلمة الله ونيل مرضاته. </b>',
    '<b>  النية أصل العمل وعليها يدور ولا يفيد مجرد العمل من دون نية بينما يفيد الله مجرد النية بدون عمل.</b>',
    '<b>  استحباب سؤال الشهادة والموت في سبيل الله.</b>',
    '<b> فضيلة الشهادة أنما تحصل حقيقتها لمن يتمناها من قلبه وإن لم يصيبه القتل </b>',
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '6': {
    title: ' الحديث الخامس  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-58.m4a',
    imageUrls: [ '/images/ryad/bab4/hadith5-bab4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> بني: </b><span>يوشع بن نون  </span></li>
        <li><b> بُضع: </b><span> فرج المرآة تستخدم في عقد النكاح والجماع   </span></li>
        <li><b>   يبني بها:</b><span> يدخل بها </span></li>
        <li><b> من القرية: </b><span> في أريحاء (الفلسطين)  </span></li>
        <li><b> لم تطعمها:  </b><span>   لم تأكلها  </span></li>
        <li><b>  غلولاً</b><span> الخيانة في المغنم والسرقة من الغنيمة قبل القسمة  </span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث',
    box1Items: [
    '<b>  اختصاص الأمه الاسلامية بأن الله أحل لها الغنائم وقد كانت حراماً في الأمم السابقة.</b>',
    '<b> شواغل الدنيا تدعو النفس إلى محبة البقاء لتعلق القلب بها فيجد الشيطان السبيل ليشغل القلب عسر عن طاعة الله. </b>',
    '<b>  أكثر ما يتعلق به القلب من أمور الدنيا النساء و المال والسكن</b>',
    '<b>  ثبوت معجزات الانبياء بأن دعى الله الا تغرب الشمس فاستجاب له.</b>',
    '<b> مكانه النبي وشرفه عند ربه از رحم الله أمته فأحل لها الغنائم وستر عليهم الغلول وجعلها خصوصية بين العبد وربه فالحمد على نعمة الاسلام  </b>',
    '<b>  الحكمة من أكل النار غنائم الامم السابقة هي ألا يكون قتالهم من أجل الغنيمة لقصورهم في الاخلاص وأما تحليلها في هذه الأمة لكون الاخلاص غالباً عليهم </b>',
    '<b> السرقة من الغنائم تستوجب غضب الله وعقابه في حقنا كما في حقوق الأمم السابقة </b>'
    ],
    box2Title: '', 
    box2Items: [

    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '7': {
    title: ' الحديث السادس  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-59.m4a',
    imageUrls: [ '/images/ryad/bab4/hadith6-bab4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> البيعان: </b><span>  البائع والمشتري </span></li>
        <li><b> الخيار: </b><span> طلب خير لامر يين  الفسخ والاجازة  </span></li>
        <li><b> صدقاً: </b><span>  فيما يخبران به </span></li>
        <li><b> بيّنا: </b><span> أظهر البائع والمشترى مافي المبيع والثمن من عيب أو نحوه  </span></li>
        <li><b> بورك لهما: </b><span>  فى البيع والشراء البركة والزيادة والنماء  </span></li>
        <li><b> كتما: </b><span> أخفيا ما في السلعة ان وجد عيباً  </span></li>
        <li><b>  محقت:</b><span> ذهب فلم يحصلا الا التعب  </span></li>
      </ul>
    </div>
  `,
    box1Title: 'نبذة عن الراوي',
    box1Items: [
    '<b class="nawawi-slut highlight-color">  حكيم بن حزام أبو خالد  ابد أخ خديجة بنت خويلد</b>',
    '<b>  ولد قبل الفيل بـ ١٣ س </b>',
    '<b>  ولدت حكيما في جوف الكعبة دخلت هي ونساء فأصابها المخاض فولدته هناك </b>',
    '<b>  وكان من سادات قريش والعلماء بأنسابها و أخبارها </b>',
    '<b> وكان يعمل المعروف ويصل الرحم. </b>',
    '<b> وكان صديق النبي قبل البعث ويوده ويجبه بعد البعثة  </b>',
    '<b>  لكن تأخر اسلامه حتى عام الفتح</b>',
    '<b> وشهد حنيناً  </b>',
    '<b> وكان من المؤلفة قلوبهم وأعطاه رسول الله من الغنائم ١٠٠ بعير ثم حسن إسلامه </b>',
    '<b> شهد بدرا مع المشركين ونجا مع من نجا  </b>'
    ],
    box2Title: 'فوائد الحديث', 
    box2Items: [
    '<b>   الصدق والامانة والحرص ع تحري الكسب الحلال والابتعاد عن الغش والكذب في البيع . </b>',
    '<b>   الترغيب في الصدق لكونه مفتاح البركة والخير. </b>',
    '<b>  الأمة الاسلامية أمة متناصحة لا يخدع فيها المسلم أخاه ولا يغشه  </b>',
    '<b>  التاجر اذا صدق في سلعته ولم يغش بورك له في معاملته  </b>',
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }
}