export const RYAD_BAB1_HADITHS: Record<string, any> = {
  '1': {
    title: 'مقدمة ', 
    name: '', 
    hintText: 'باب الاخلاص واحضار النيه في جميع الاعمال والاحوال',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: 'باب الاخلاص واحضار النيه في جميع الاعمال والاحوال  ',
    box1Items: [
   '• <b>الاخلاص:</b> افراد الحق سبحانه وتعالى بالقصد في الطاعات ويزيد بحركته ويكون في سره وعلى نيته التقرب الى الله لا يمازجه نفس او دينا او هوى.',
  '• <b>الاخلاص شريكين الله وبين العبد:</b> لا يعلمه ملك فيكتبه ولا شيطان فيفسده ولا هوى فيميله.',
  '• <b>ابن عطاء يقول:</b> ان الله لا يحب العمل المشترك والقلب المشترك فالعمل المشترك هو لا يقبله والقلب المشترك هو لا يقبل عليه.'
    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '2': {
    title: 'الحديث الأول', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-1.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith1.png'],
explanation: `
    <div class="explanation-content">
         <ul class="vocabulary-list">
        <li><b>النية:</b> <span> هي القصد وعزيمه القلب</span></li>
        <li><b>هجرته:</b> <span>ترك الشيء والاعتراض عنه</span></li>
        <li><b>والهجره:</b> <span> الخروج من ارض الى ارض والمهاجرون هم الذين ذهبوا مع النبي.</span></li>
        <li><b>لدنيا:</b> <span>سميت بذلك لدنوها قبل الاخره, لدنوها الى النزول</span></li>
        <li><b>امرئ:</b> <span>انسان </span></li>
        <li><b>لدنيا يصيبها:</b> <span>لغرض دنيوي</span></li>
        <li><b>فهجرته الى الله ورسوله:</b> <span><b>قبولا وجزاء</b></span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث ',
    box1Items: [
    '<b>الراوي:</b> امير المؤمنين عمر بن الخطاب.',
  '<b>الفاروق:</b> لقبه بذلك رسول الله.',
  'ثاني الخلفاء الراشدين.',
  'اسلم قبل الهجره بخمس سنوات.',
  '<b>دعاء النبي :</b> اللهم اعز الاسلام باحد العمرين عمر بن الخطاب و عمرو بن هشام.',
  ' لم يزل الاسلام في اختفاء حتى اسلم عمر.',
  ' صاحب فتوحات الشام والعراق.',
  ' اول من وضع للعرب التاريخ الهجري.',
  'اول من دون الدواوين.',
  'اول من لقب بامير المؤمنين.',
  'انتصب في خلافته 12,000 منبر.',
  'ما كنا نصلي عند الكعبه حتى اسلم عمر.',
  ' دامت خلافته 10 سنوات.',
  'نزل في القران الكريم خمس مواضع تاييد لرأيه.',
  'طعنه ابو لؤلؤه الفارسي وهو في صلاه الصبح سنه 23 هجري وعمره 63 سنه.'
    ],
    box2Title: ' فوائد و سبب النزول', 
    box2Items: [
       '• <b>سبب ورود الحديث:</b> قصه مهاجر ام قيس التي رفضت الزواج منه حتى يهاجر.',
  '• <b>اهميه الحديث:</b> هو ثلث الاسلام لان كسب العبد يقع بقلبه ولسانه وجوارحه فالنيه احد اقسام العباده الثلاثه لكنها تقع في القلب.'
    ],
    box3Title: ' فوائد الحديث ',
    box3Items: [
  '<b>١. الحرص على النيه في الاعمال والعبادات:</b> في الاعمال سعي اركان ، والنيه سائق القلوب.', 
  '<b>٢. اساس اخلاص العمل النيه:</b> فنيه تؤثر بالعمل تاره تجعله حراما وتاره تجعله حلالا. مثل (الذبح اذا كان لله يحل ولغير الله يصبح حراما).',
  'من ينوي شيئا يحتسب له وان لم يعمل به لمانع شرعي.',
  'كل فعل مباح شرعا ينقلب قربا لله بنيه فاعله (كتناول الطعام بنيه التقوي على طاعه الله).',
  'النيه خاصه بصاحب العمل.',
  'ينبغي للمرء ان يكون عالي الهمه والنيه ولا يضع حظ النفس فيهاجر من الاكوان الى رب الاكوان.',
  'الحديث فيه دعوه لكسب المزيد من الحسنات (اذ يتضاعف جزاء العمل الواحد بتعبد نيته) مثل {الاضحيه لصلاه الارحام واطعام الفقراء وادخال السرور الى اهل بيته اضافه الى اجر الاضحيه}.'
    ],
    box4Title: ' تعقيبات ',
    box4Items: [
  '<b>الاخلاص الله تعالى في العمل شرط من شروط قبول العمل.</b>',
  '<b> لا يجوز الاقدام على العمل قبل معرفه حكمه.</b>'
    ],
    metaDescription:'شرح وتدبر الحديث الأول عن أمير المؤمنين عمر بن الخطاب الفاروق (إنما الأعمال بالنيات)، وبيان أن النية ثلث الإسلام، وقصة مهاجر أم قيس، وأثر النية في تحويل العادات إلى عبادات.',
    metaKeywords: 'الحديث الأول, إنما الأعمال بالنيات, عمر بن الخطاب, الفاروق, النية والإخلاص, مهاجر أم قيس, ثلث الإسلام, تحويل المباحات إلى قربات, شروح الأربعين النووية',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '3': {
    title: 'الحديث الثاني', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-2.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith2.png'],
explanation: `
    <div class="explanation-content">
    <ul class="vocabulary-list">
        <li><b>البيداء:</b> <span>ارض الفقر التي لا شيء فيها./span></li>
        <li><b>يخسف:</b> <span>خسف بالرجل اذا اخذته الارض وغاب.</span></li>
        <li><b>اسواقهم:</b> <span>الرعية من دون الملك ومن لم يكن ذا سلطان.</span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث',
    box1Items: [
 '<b>الراوي:</b> ام المؤمنين ام عبد الله عائشه. ',
  '١. افقه نساء المسلمين واعلمهم بالحلال والحرام. ',
  '٢. امها ام رومان. ',
  '٣. بنت الصديق. ',
  '٤. هي الزوجه البكر الوحيده. ',
  '٥. تزوجها وعمرها تسع سنوات. ',
  '٦. ما رايت احدا اعلم بفقه ولا بطب ولا بشعر من عائشه. ',
  '٧. فضل عائشه على النساء كفضل الثريد على سائر الطعام.',
  '٨. ربع الاحكام الشرعيه اخذت من عائشه.',
'٩. مات النبي وعمرها 18 سنه. ', 
'١٠. فضلت على نساء النبي العشره.',
'١١. لم ينكح بكر قط غيري. ',
'١٢. لما ينكح امراه ابوها مهاجرين غيري. ',
'١٣. انزل الله براءتي من السماء. ',
'١٤. جاء جبريل بصورتي من السماء فيه حريره. ',
'١٥. كنت اغتسل انا وهو في اناء واحد. ',
'١٦. كنت اصلي وانا معترضه بين يديه ',
'١٧. كان ينزل عليه الوحي وهو معي ',
'١٨. قبضه الله وهو بين سحري ونحري ',
'١٩. مات في ليلتي ',
'٢٠. دفن في بيتي',
'٢١. قال لها رسول الله تكني بابن اختك (ام عبد الله) ',
'٢٢. توفيت في المدينه في زمن معاويه '
    ],
    box2Title: '  تعقيبات', 
    box2Items: [
  '• <b>الانسان يعامل بقصد من الخير او الشر </b> ',
  '• <b> التحذير من مصاحبه اهل الظلم والفجور والحث على مصاحبه الاخيار </b> ',
  '• <b> اخبار رسول الله عن المغيبات وهي يجب الايمان بها والايمان انها استقى لان رسول الله لا ينطق عن الهوى.</b> '
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '4': {
    title: 'الحديث الثالث:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-3.m4a',
    imageUrls:  [ '/images/ryad/bab1/ryad-bab1-hadith3.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>الهجره:</b> <span>الخروج من ارض الى ارض هجر الشيء يعني تركه.</span></li>
        <li><b>الجهاد:</b> <span> محاربه الكفار استفراغ ما في الوسع والطاقه من قول او فعل.</span></li>
        <li><b>استنفرتم:</b> <span>طلب منكم الخروج للجهاد , استنصرتم.</span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
   '<b>الراوي:</b> عن ام المؤمنين عن عائشه.',
   '<b>بشاره الى ان مكه تبقى دار الاسلام ابدا. </b>',
   '<b>يجب قصد الجهاد والاستعداد له وان يلبي داعي الجهاد اذا دعاه.</b> ',
   '<b>الاعمال تعتبر بالنيات. </B> ',
   '<b>الخير الذي انقطع من قطاع الهجره يمكن تحصيله بالجهاد والنية الصالحه.</b>',
 
    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '5': {
    title: 'الحديث الرابع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-4.m4a',
    imageUrls:  [ '/images/ryad/bab1/ryad-bab1-hadith4.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>غزاة:</b> <span> السير الى قتال العدو. </span></li>
        <li><b>غزوه تبوك:</b> <span>  في ٩ ه‍ـ.</span></li>
        <li><b>شعباً:</b> <span>طريق في الجبل. </span></li>
         <li><b>وادياً:</b> <span> كل المفرج بين الجبال والتلال.  </span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
    '<b>الراوي:</b> جابر ابن عبد الله الانصاري',
  ' <b>شهد بيعه العقبه الثانيه</b>  وهو صغير فكان اصغر من شهدها.',
  'شهد مع رسول الله ﷺ ١٨ غزوه.',
  'لم يشهد بدر واحد لصغر سنه ولم يتخلف عن رسول الله ﷺ في غزوه غزاها بعد.',
  'استغفر له رسول الله ﷺ<b> ليله البعير </b>  حين اشترى منه بعيره في <b>غزوة ذات الرقاع</b>.  ',
  'عُمي في اخر عمره.',
  'اخر من مات بالمدينه ممن شهدة العقبه.',
  'توفي وعمره ٩٤ سنه.'
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
   '• <b>١. فضل النيه في الخير.</b>',
   '• <b>٢. الانسان يبلغ بنيته اجر العامل اذا منعه العذر عن العمل.</b>',
   '• <b>٣. حكمة بليغة من النبي :</b> لمن خرج للجهاد ويرى انه خير منن قعد ولم يخرج بسبب عذره ... إن الفضل والمنه لله الذي اخرجه للجهاد ولله يطلع الى ما في قلوب عباده.'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '6': {
    title: 'الحديث الخامس:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-5.m4a',
    imageUrls:  [ '/images/ryad/bab1/ryad-bab1-hadith5-1.png','/images/ryad/bab1/ryad-bab1-hadith5-2.png' ],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
          <li><b>خاصمته:</b> <span>جادلته. </span></li>
        <li><b>لك ما نويت:</b> <span>ثوابه.</span></li>
         <li><b>لك ما اخذت:</b> <span> لك ملك ذلك.  </span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
    '<b>الراوي:</b> معن بن يزيد ويكنى ابا يزيد.',
  '• <b>١. شهد بدراً هو وابيه وجده ولا يعرف احد شهد بدراً هو وابوه وجده غيره.</b>',
  '• <b>٢. بايع رسول الله ﷺ هو وابوه وجده.</b>',
  '• <b>٣. كان له مكانة عند عمر. </b>',
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
  '• <b>صدقه التطوع يجوز دفعها للفروع اما الصدقه الواجبه (الزكاه) فلا يجوز دفعها لا للفروع ولا للاصول. </b>',
  '• <b>  للمتصدق اجر ما نوى سواء من اخذها كان يستحقها ام لا. </b>',
  '• <b>جواز التوكيل في توزيع الصدقه. </b>',
'• <b> جواز التحاكم بين الاب وابنه الا ان يكون عقوقاً.</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '7': {
    title: 'الحديث السادس:', 
    name: '', 
    hintText: '',
    audioUrl:  'audio/ryad-bab-1/hadith-6.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith6.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>يعودني:</b> <span> يزورني </span></li>
        <li><b>وجع:</b> <span> اسم جامع لكل مرض. </span></li>
         <li><b>الشطر:</b> <span>النصف.</span></li>
         <li><b>تذر:</b> <span>تدع.</span></li>
         <li><b>العالة:</b> <span>الفقراء.</span></li>
         <li><b>يرثي له:</b> <span>يرحمه.</span></li>
         <li><b>يتكففون الناس:</b> <span>يتساءلون ما في ايديهم.</span></li>
         <li><b>لعلك:</b> <span>للترجي ومن الله امر واقع. .</span></li>
         <li><b>البائس:</b> <span>من اشتدت حاجته واشتد حزنه.</span></li>
         <li><b>امضِ:</b> <span>اتمم.</span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
      '<b>الراوي:</b> سعد بن ابي وقاص. ',
  '• اول من اسلم وكان عمره ١٧ سنه.',
  '•(هذا خالي فليرني امرؤ خاله) ابن عم ام رسول الله ﷺ واقارب الام اخوال.',
  '• (ارمِ سعدُ فداكَ أبي وأمي) في يوم احد. ',
  '•  اول من رمى بسهم في الاسلام. ',
  '•  اول من اراق دمًا في سبيل الله.',
  '• احد العشره المبشرين بالجنه.',
  '•  فتح العراق. ',
  '•  مجاب الدعوه.',
  '•  اخر المهاجرين موتاً.'
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
        '• <b> استحباب عياده المريض للامام.</b>',
  '• <b> الدعاء للمريض بالشفاء والدعاء عنده بخير رجاء الاستجابه.</b>',
'• <b> اباح الجميع المال الحلال.</b>',
'• <b>الحث على صله الارحام والاحسان الى الاقارب والشفق على الورثه.</b>',
'• <b>استحباب الانفاق في وجوه الخير.</b>',
'• <b> فضيله طول العمر للازدياد من الاعمال الصالحه.</b>',
'• <b>من ترك شيئا لله لا ينبغي الرجوع فيه.</b>',
'• <b>هذا الحديث من جمله الاخبار عن المغيبات عند رسول الله ﷺ.</b>',
'• <b>الصدقه والوصيه لا يجوز اكثر من الثلث.</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '8': {
    title: 'الحديث السابع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-7.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith7.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
  
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
     '<b>الراوي:</b> ابو هريره. ',
  '• اسمه عبد شمس فاسماه رسول الله عبد الرحمن وكناه اباه هريره نسبا لهره معه.',
  '•اسلم في السنه السادسه للهجره. ',
  '•كان من اهل الصفه.',
  '•اكثر رواه للاحاديث عند رسول الله. ',
  '•من يبسط رداءه حتى اقضي مقالتي ثم يقبضه اليه فلن ينسى شيئا سمعه مني فكان ابوه هريره من بسط رداءه (فلم ينسى بعدها شيء). ',
  '•دعا له النبي ان يحببه الله الى المؤمنين. ',
  '•كان يقسم الليل هو وزوجته وخادمه في قيام الليل كله. ',
  '• كان يسبح كل اليوم ١٢ الف تسبيحه',

 
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
      '• <b>  القلب موضع نظر الرب فعلى المسلم ان يهتم بقلبه فيطهره ويزينه لئلا يرى الله الا المحمود والصالح في قلبه.</b>',
'• <b>  الاعمال الظاهره لا تحصل بالتقوى انما التقوى تقع في القلب ونحصل عليها من خشيه الله والشعور بمراقبته. </b>',
'• <b> مجازات العبد ومحاسبته فيما يقع في قلبه من نيه. </b>',
'• <b> على المسلم ان لا يحكم على الناس لمجرد الظاهر بصلاح المظهر والصوره فليحكم على ما ظهر منه من عمل صالح. </b>',
'• <b>الاعتناء بصلاح القلب مقدم على عمل الجوارح لان عمل القلب يصحح الاعمال الظاهره.</b>',
'• <b> نعامل الناس بظاهر اعمالهم ونترك سرائرهم لله.</b>'
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '9': {
    title: 'الحديث الثامن:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-8.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith8.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>حميه:</b> <span> انفه وغيرة ومحامه عن عشيرته بالحق والباطل.  </span></li>
        <li><b>رياء:</b> <span>  مراءه ليرى الناس مقاتله. </span></li>
         <li><b>كلمه الله:</b> <span> دين الله.</span></li>
      </ul>
    </div>
  `,
    box1Title: '  راوي الحديث  ',
    box1Items: [
    '<b>الراوي:</b> ابي موسى الاشعري عبد الله بن قيس.  ',
  '•قدما من اليمن بعد فتح خيبر صادفتهم سفينه جعفر فقدموا جميعا الى المدينه. ',
  '•قال رسول الله عن اهل اليمن (اتاكم اهل اليمن اضعف قلوبا وارق افئده الفقه يمان والحكمه يمانيه).',
  '•قال عنه رسول الله (سيد الفوارس ابي موسى).',
  '•وقال له (لَقَدْ أُوتِيتَ مِزْمَاراً مِنْ مَزَامِيرِ آلِ دَاوُدَ). ',
  '•قضاة امتي اربعه: ( عمر وعلي وابي موسى وزيد بن ثابت). ',
  '•شهد فتوح الشام.'
    ],
    box2Title: ' هدف الحديث', 
    box2Items: [
        '• <b>ارضاء الله.</b>',
  '• <b> اعلاء كلمه الحق.</b>',
'• <b> اباح الجميع المال الحلال.</b>',
'• <b>دحر الاعداء.</b>',
'• حسب النيه فهنالك من يقاتل حميه وشجاعه للاسلام والمسلمين فهو في سبيل الله كلاً على حسب نيته يؤجر.'
    ],
    box3Title: ' فوائد الحديث ',
    box3Items: [
  '• <b>١. الاعمال تعد بها عند الله حسب النيه الصالحه. </b>',
  '• <b> ٢. الفضل الوارد للمجاهدين فقد بمن يقاتل لاعلاء كلمه التوحيد. </b>',
'• <b> ٣. ذم الحرص على الدنيا والقتال لحظ النفس في غير طاعه. </b>',
'• <b>٤. تقدم العلم على العمل حتى يكون عمل الانسان على بينه. </b>',
'• <b> ٥. جواز السؤال عن العله واستحباب البيان عنها.</b>'
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '10': {
    title: 'الحديث التاسع:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-9.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith9.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>التقى:</b> <span>  قصده كل واحد منهما الاخر. </span></li>
   
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
      '<b>الراوي:</b> بكره نفيع ابن الحارث الثقفي الطائفي.  ',
  '•١. اسلم في عبيد من اهل الطائف. ',
  '•٢. نزلوا الى رسول الله حينما حاصر ثقيف فاسلم.',
  '•٣. تدلى نفيع من حصن الطائف ببكرة فاشتهر بابي بكرة فانا من اخوانكم.',
  '•٤. مولى رسول الله. ',
  '•٥. من فضلاء الصحابه.',
  ' <b> ٦. كان يقول الحسن البصري:</b> لم ينزل البصرة من الصحابة ممن سكنها أفضل من عمران بن حصين وأبي بكرة.'
 
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
        '• <b>١. وقوع العقاب على من عزم على المعصيه بقلبه ووطن نفسه عليها وباشر اسبابها سواء ارتكبها ام لم يرتكبها لسبب عارض منعه من ذلك ولولا العارض لفعلها. </b>',
  '• <b> ٢. التحذير من اقتتال المسلمين لان ذلك يؤدي الى ضعفهم وسخط الله عليهم. </b>',
'• <b> ٣. هذا الحديث مثل من قاتل حميه وعصيبه دون مبرر شرعي.</b>',
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '11': {
    title: 'الحديث العاشر:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-10.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith10.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b>البضعه:</b> <span> وهي القطعه من ٣ الى ١٠.</span></li>
        <li><b>ينهزه:</b> <span> لا يدفعه.  </span></li>
         <li><b>خطوه:</b> <span>  ما بين القدمين. </span></li>
          <li><b>احسن الوضوء:</b> <span>  اسبغه واتى بسننه وادابه.</span></li>
           <li><b>درجه:</b> <span> مرتبه. </span></li>
            <li><b>كان في الصلاه:</b> <span> في ثوابها. </span></li>
      </ul>
    </div>
  `,
    box1Title: ' فوائد الحديث ',
    box1Items: [
   '<b> ١. افضلية الصلاه على سائر العبادات.</b> ',
'<b> ٢. صلاة الجماعة سنة ليست فريضة.</b> ',
'<b> ٣. الحدث في المسجد خطيئة يحرم به المحدث استغفار الملائكة.</b> ',
'<b> ٤. فضيله انتظار الصلاه. </b> ',
'<b> اضاءه</b>  يقول ابن بطال: من أراد حط الذنوب بغير تعب؛ فليلزم مصلاه بعد الصلاة ليستكثر من دعاء الملائكة واستغفارهم له. ',

    ],
    box2Title: '', 
    box2Items: [],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '12': {
    title: 'الحديث الحادي عشر:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-11.m4a',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith11-1.png', '/images/ryad/bab1/ryad-bab1-hadith11-2.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
            <li><b>تبارك:</b> <span>تكاثر خيره.</span></li>
         <li><b>تعالى:</b> <span>تنزه عما لا يليق به.</span></li>
        <li><b>بين ذلك:</b> <span>فصل.</span></li>
         <li><b>هم:</b> <span>نواه واراده.</span></li>
         <li><b>ضعف:</b> <span>زاد على اصل الشيء.</span></li>
      </ul>
    </div>
  `,
    box1Title: ' راوي الحديث  ',
    box1Items: [
     '<b>الراوي:</b>ابو العباس.',
  '• ١. عبد الله بن عباس ابن عم الرسول امه لبابه بنت الحارث ابنه خالة خالد وابن اخت السيده ميمونه.',
  '• ٢. ولد قبل الهجره بثلاث سنوات في شعب ابي طالب.  ',
  '• ٣. حنكه رسول الله برقيه ودعا له.',
  '•  ٤. سمي بترجمان القران. ',
  '•  ٥. وسمي البحر لسعه علمه. ',
  '• ٦. وسماه جرجير بالحبر.  ',
  '• ٧. ضمه رسول الله ودعا له (اللهم علمه الحكمه).',
  '•  ٨. كان عمر اذا اعضلته قضيه رجع الى ابن عباس وقال له فانت لها ولامثالها.',
  '•  ٩. اذا رايت ابن عباس قلت اجمل الناس واذا نطق افصح الناس واذا تحدث اعلم الناس.  ',
  '•  ١٠. قيل عندما توفي ودفن بطل في كفنه طائره ابيض لم يخرج. ',
 
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
      '• <b>  ١. بيان فضل الله على هذه الامه فلولا فضله لما دخل احد الجنه لان عمل العباد سيئات اكثر من الحسنات.</b>',
'• <b>  ٢. الاثابه على الهم بالحسنه وعدم المؤاخذه على الهم بالسيئه. </b>',
'• <b> ٣. على العبد ان يترك لذاته وشهواته من اجل الله ورغبة في الثواب ورهبة من العقاب. </b>',
'• <b> ٤. ان الله بكرمه جعل العدل بالسيئه والفضل في الحسنه فيضاعف الحسنه ولا يضاعف السيئه. </b>',
'• <b>٥.الحفظة على علم بما في قلوب بني ادم منخير او شر فيكتبونه اذا حدث به نفسه اوعزم عليه.</b>',
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
   '13': {
    title: 'الحديث الثاني عشر:', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-1/hadith-12.mpeg',
    imageUrls: [ '/images/ryad/bab1/ryad-bab1-hadith12-1.png', '/images/ryad/bab1/ryad-bab1-hadith12-2.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b>نفر:</b> <span>ما دون العشره من الرجال.</span></li>
        <li><b>الغار:</b> <span>الكهف في الجبل.</span></li>
        <li><b>نأى بي:</b> <span>بَعُد.</span></li>
        <li><b>لا اغبق:</b> <span>لا اشرب شراب الغبوق (الغبوق ما امسى عند القوم من اللبن).</span></li>
        <li><b>فلم ارح عليهما:</b> <span>الاراحه رد الابل والغنم عند العشي الى مراحها.</span></li>
        <li><b>يتضاغون:</b> <span>يصيحون من الجوع.</span></li>
        <li><b>برق:</b> <span>ظهر.</span></li>
        <li><b>المت:</b> <span>نزلت بها ملمة شديده من شدائد الدنيا.</span></li>
   
      </ul>
    </div>
  `,
    box1Title: '  راوي الحديث  ',
    box1Items: [
     '<b>الراوي:</b>ابو عبد الرحمن عبد الله بن عمر بن الخطاب  .  ',
  '•١.اسلم مع ابيه وهاجر مع ابيه .',
  '•٢.لم يشهد بدر واحد لصغر سنه.  ',
  '•٣.فكانت اول غزوة الخندق وعمره 15 سنه .',
  '• ٤.كان من اشد الصحابه اتباعا لرسول الله . ',
  '• ٥.كان شديد الورع والتقى. ',
  '•٦. كان كثير العتق للعبيد حتى وصل عددهم الى 1000 <b> "مَن خدعنا بالله انخدعنا له". </b> ',
  '•٧. شهد له رسول الله بالصلاح. ان عبد الله بطل، صالح. يقول جابر عن ابن عمر:<b> ما مِنَّا أحَدٌ أدْرَكَ الدُّنيا إلَّا مَالتْ به ومَالَ بِهَا، إلا ابن عمر.</b>',
  '•٨.توفي في مكه وعمره 84 سنه.'
    ],
    box2Title: ' فوائد الحديث', 
    box2Items: [
      '• <b>١.استجابه الدعاء وقت الكرب وغيره والتوسل الى الله بصالح الاعمال.</b>',
'• <b>٢.فضل بر الوالدين وخدمتهما وايثارهما على الزوجه والاولاد.</b>',
'• <b>٣.فضل العفاف والكف عن المحرمات.</b>',
'• <b>٤.فضل الوفاء بالعهد وتاديه الامانه والسماحه في المعامله.</b>',
'• <b>٥.لا عبرة بالعمل الا ان كان خالصا لله.</b>',
    ],
    box3Title: '',
    box3Items: [],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }
};