export const RYAD_BAB5_HADITHS: Record<string, any> = {
'1': {
    title: 'باب المراقبة', 
    name: '', 
    hintText: '',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: 'باب المراقبة ',
    box1Items: [
  ' <b> المراقبة:</b> دوام علم العبد باطلاع الحق سبحانه وتعالى عليه ظاهرا وباطناً .وتنبع من أعماق القلب، وترتبط بالباطن أكثر ما ترتبط بالظاهر ',
  ' <b> تنمو المراقبة وتعلو:</b> <br> ١. بطول المجاهدة <br> ٢. تكرار المحاولة  <br> ٣. قوة العزيمة في حمل النفس على ما ينبغي لها ويليق بها من تطهير وتصفية ',
  ' <b>لذلك كان من راقب الله في خواطره عصمه الله في حركات جوارحه </b> ',
  ' <b> للمراقبة ثلاثة صورة : <br>  </b>١. مراقبة الله في طاعته بالعمل <br>  ٢. مراقبة الله في معصيته بالترك  <br> ٣. مراقبة الله بالهم في العمل ',
  ' <b> * مراقبة الله أشد إتعاباً للبدن من مقيام الليل وصيام النهار وانفاق المال في سبيل الله <br> (بمعنى دوام استشعار طاعة الله ومراقبته في كل لحظة وجهاد النفس لترك العاصي في السر والعلن أشد على النفس والبدن وأعظم جهاداً من مجرد قيام الليل )  <br> -قال عمر لـ أبو عثمان ( اذا جلست للناس فكن واعظاً لنفسك و لقلبك ولا يغرنك اجتماعهم عليك، فإنهم يراقبون ظاهرك والله يراقب باطنك)  <br> -قال حميد الطويل لـ سليمان بن علي: عظني فقال: لئن كنت اذا عصيت الله خالياً ظننت أنه يراك فقد أجترأت على أمر عظيم ولئن كنت تظن أنهلا يراك فقد كفرت -وقال محمد بن علي الترمذي : اجعل مراقبتك لمن لا تغيب عن نظره إليك، واجعل شكرك  لمن لا تتقطع نعمته عنك، واجعل طاعتك لمن لا تستغني عنه، واجعل خضوعك لمن لاتخرج عن ملكه وسلطانه. </b>', 
 
   ],
    box2Title: '', 
    box2Items: [
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '2': {
    title: ' الحديث الأول ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-5/hadith-60.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith1-1-bab5.png','/images/ryad/bab5/hadith1-2-bab5.png' ],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>  تلد الأمة ربتها :</b><span> سيدتها  </span></li>
        <li><b> العالة :</b><span> الفقراء</span></li>
        <li><b> ملياً :</b><span> زمناً طويلاً </span></li>
        <li><b> تشهد :</b><span>تقر وتبين  </span></li>
        <li><b> تقيم الصلاة :</b><span> تأتي بها تامة الشروط والاركان </span></li>
        <li><b>  الصلاة:</b><span> أقوال وأفعال مخصوصة مفتتحة بالتكبير مختتمة بالتسليم </span></li>
        <li><b> تؤتي :</b><span>تؤدي </span></li>
        <li><b> الزكاة :</b><span>  إسم لقدر معلوم من المال</span></li>
        <li><b> الصيام :</b><span> الامساك عن المفطرات من طلوع الفجر حتى غروب الشمس  </span></li>
        <li><b>  سمي رمضان:</b><span> لانه يرمض الذنوب أي يحرمها </span></li>
        <li><b> الحج :</b><span> قصد بيت الله الحرام لأداء النسك </span></li>
        <li><b> تؤمن بالله: :</b><span> اسم الله الاعظم (التسليم له )  </span></li>
        <li><b>  الملائكة:</b><span> عباد مكرمون لا يعصيون الله ما أمرهم ويفعلون ما يؤمرون </span></li>
        <li><b>  اليوم الآخر:</b><span>يوم القيامة وسمي الآخر لأنه لا يوم بعده </span></li>
        <li><b>  القضاء:</b><span> إرادة الله الازلية المتعلقة بالأشياء على ما هي عليه </span></li>
        <li><b>  القدر:</b><span>ايجاد الأشياء على وفق قضاء الله  </span></li>
        <li><b>  الاحسان:</b><span>العبادة وأداؤها على أكمل وجها المشروع. </span></li>
        <li><b>  أن تعبد:</b><span>  العبادة أقصى درجات الخضوع لله من الرضا كأنك تراه ويراك </span></li>
        <li><b> فان لم تكن تراه :</b><span>  لا تفعل ما لا يرضيه فإنه يراك</span></li>
        <li><b> الساعة :</b><span> يوم القيامة  </span></li>
         <li><b> أماراتها :</b><span> علاقاتها الدالة ع اقترابها الأمة: المملوكة</span></li>
          <li><b> يتطاولون بالبنيان: :</b><span>  يتفاخرون بارتفاع المباني (اسناد الأمر الى غير أهله ) <br> "أسند التعليم الإجريل مجازاً و لكن المعلم الحقيقي محمد"</span></li>
    

      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث',
    box1Items: [
    '<b>  جمع هذا الحديث أنواع المعارف والعلوم والآداب ينبغي لهذا الحديث أن يكون أم السنه كما أن الفاتحة أم الكتاب. </b>',
    '<b>  تحسين الثياب والهيئة والنظافة عند الدخول إلى العلماء و الملوك </b>',
    '<b>   ينبغي للعالم أن يرفق بالسائل ويدنيه منه ليتمكن من السؤال من غير خوف. وعلى السائل أن يظهر التأدب في سؤاله والتواضع بين يدي معلمه.</b>',
    '<b>  الحث على الاخلاص بالعبادة ومراقبه العبد ربه في اتمام الخشوع  </b>',
    '<b>  ان الله مكّن الملك أن يتمثل في صورة البشر </b>',
    '<b>  على العالم والمفتي إن سئل في شيئ لا يعلمه أن يصرح بذلك  </b>',
    '<b>  وجوب الايمان بالقدر </b>',
    '<b>  قيام الساعة من الغيب الذي استأثر الله به لنفسه. </b>',


    ],
    box2Title: '', 
    box2Items: [

    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '3': {
    title: ' الحديث الثاني ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-5/hadith-61.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith2-bab5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b>  اتق الله: </b><span>  اجعل بينك وبين عقاب الله وقاية بفعل أوامره وترك نواهيه   </span></li>
        <li><b> كنت: </b><span>   في أي مكان </span></li>
        <li><b> أتبع: </b><span>  اذا فعلت السيئة الحقها بالحسنة.</span></li>
        <li><b> خلق حسن: </b><span>  عامل الناس بلطف ولين الجانب وطلاقة الوجه </span></li>

      </ul>
    </div>
  `,
    box1Title: 'نبذة عن الراوي 1',
    box1Items: [
    '<b class="nawawi-slut highlight-color">     أبو ذر جندب بن جنادة </b>',
    '<b> من كبار الصحابة ومن أوائل من أسلم وانصرف إلى قومه يدعوهم للاسلام </b>',
    '<b> لم يهاجر إلى رسول الله الا بعد بدر وأحد</b>',
    '<b> أول من حيا بتحية الإسلام. </b>',
    '<b> وقال عنه رسول الله: ما أظلت الخضراء ولا أقلت الغبراء من ذي لهجة أصدق ولا أوفى. من أبي ذر </b>',
    '<b> شبه عيسى ابن مريم فقال عمر كالحاسد: أفتعرف ذلك له قال نعم فاعرفوه</b>',
    '<b> هاجر الى البادية بعد وفاة رسول الله وبقي حتى ولاية عثمان </b>',
    '<b> هاجر إلى دمشق وكان زاهد ونتقد الاغنياء في حرصهم على المال فاضطربوا منه حتى شكا معاوية لعثمان حال أبي ذر فأمره إلى الذهاب إلى الربدة وهي أحد قرى المدينة فبقى هناك حتى مات. </b>',
    '<b> كان كريماً، لا يخزن مالاً لا قليلاً ولا كثيراً  حتى أنه توفي وليس في بيته مايكفن به</b>',
   
    ],
    box2Title: 'نبذة عن الراوي 2 ',
    box2Items: [
    '<b class="nawawi-slut highlight-color">   معاذ بن جبل </b>',
    '<b> أنصاري خزرجي </b>',
    '<b> أبي عبدالرحمن </b>',
    '<b> الأمام المقدم في الحلال والحرام الذين شهدوا بيعة العقبة الثانية</b>',
    '<b> آخى رسول الله بينه وبين ابن مسعود </b>',
    '<b> شهد كل المواقع مع رسول الله حتى بدر </b>',
    '<b> بعثه رسول الله قاضياً عام الفتح إلى الجند من اليمن لتعليم الناس القرآن وشرائع الاسلام وقبض الصدقات </b>',
    '<b> وتوفى رسول الله وهوة باليمن</b>',
    '<b> واستعمله عمر على الشام حين مات أبو عبيدة فمات من عامه بناحية الاردن في الطاعون </b>',
    '<b> وقيل له ولد سماه عبد الرحمن قاتل معه في اليرموك فاستشهد فيها</b>',

    ],
    box3Title: 'فوائد الحديث:',
    box3Items: [
         '<b>  الأمر ملازمة التقوى في كل الأحوال.</b>',
         '<b>  الاخلاق الحميدة هي رافد من روافد التقوى .</b>',
         '<b>  المتقي قد تعتريه الغفلة فيقع في المعصية ولكنه سرعان ما يعود للتوبة والاستغفار </b>',
         '<b> وجوب التوبة من جميع الذنوب ومحو آثارها بالأعمال الصالحة. </b>',
         '<b> امكانية اكتساب حسن الخلق في التعامل مع الناس </b>',
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '4': {
    title: ' الحديث الثالث ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-5/hadith-62.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith3-1-bab5.png', '/images/ryad/bab5/hadith3-2-bab5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> يوماً: </b><span> ساعة من يوم  </span></li>
        <li><b> غلام: </b><span> الصبي من حين يفطم الى البلوغ  </span></li>
        <li><b> كلمات: </b><span>جمعت للقلة ولتسهيل حفظها ونونت تنبيهاً لعظيم خطرها    </span></li>
        <li><b> احفظ الله: </b><span> التزم أوامره واجتنب نواهيه  </span></li>
        <li><b> تجاهك: </b><span> معك </span></li>
        <li><b> استعنت: </b><span> طلبت الاعانة على أمر من أمور الدين  </span></li>
        <li><b> الأمة: </b><span> الجماعة جميع المخلوقين  </span></li>
        <li><b> جفت: </b><span> يبست </span></li>
        <li><b> رفعت الأقلام: </b><span> تركت الكتابة الفراغ الامر   </span></li>
        <li><b> الصحف: </b><span> التي فيها تقادير الكائنات الحية كاللوح المحفوظ </span></li>
        <li><b> الرضاء: </b><span> النعمة </span></li>
        <li><b> الفرج: </b><span> الخروج من الغم  </span></li>
        <li><b> الكرب: </b><span> الحزن والغم </span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث',
    box1Items: [
    '<b> يدل الحديث على مراقبة الله مراعاة الحقوق وتفويض الأمر لله والتوكل عليه. </b>',
    '<b>  تحريم سؤال غير الله مما لا يقدر عليه إلا هو كالرزق والمغفرة والشفاء أما مما جرت عليه العادة من التعامل مع الناس فلا بأس</b>',
    '<b>  العبد محتاج إلى الاستعانة بالله في فعل المأمورات وترك المحظورات والصبر على مقدرات الدنيا كلها وعند الموت من الأهوال يوم القيامة</b>',
    '<b>  ما يصيب العبد من ضر أو نفع فهو كله مقدر عند الله ومكتوب له </b>',
    '<b> من عامل الله بالتقوى والطاعة في حال رخائه عامله الله باللطف والاعانة في حال شدته ،وأعظم الشدائد التي تقع في المؤمن الموت </b>',
    '<b> ينبغى لمن نزل عليه البلاء أن يكون صابراً محتسباً راجياً سرعة الفرج </b>',
    '<b>  مافي علم الله أو ما أثبته في أم الكتاب ثابت لا يتغير ولا تتبدل ولا ينسخ</b>',
    ],
    box2Title:  'إضاءة', 
    box2Items: [
        '<b class="nawawi-slut">قال رسول الله: من سره أن يستجيب الله له عند الشدائد والكرب فليكثر من الدعاء في الرخاء </b>'
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '5': {
    title: ' الحديث الرابع   ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-55/hadith-63.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith4-bab5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> الشعر: </b><span> بفتح العين أو تسكنينها ويضرب فيها مثال للدقة والقلة  </span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث', 
    box1Items: [
    '<b> الاستخفاف بالذنب يدل على قلة خشية الله تعالى على العكس من استعظام الذنب يدل على شدة الخوف من جلال الله وخشيته </b>', 
    '<b>  ينبغي ع الانسان أن يحذر من صغائر فلعلها تكون مهلكة له في دينيه</b>', 
    '<b> محقرات الذنوب اذا كثرت قد تصبح من الكبائر من كثرة وشدة الاصرار.  </b>', 
    '<b> أعلم الناس بالله تعالى بعد الانبياء وأكملهم ورعاً وأشدهم خشية لله هم أصحاب رسول الله </b>', 
    ],
    box2Title: 'إضاءة',
    box2Items: [
    '<b class="nawawi-slut"> إن المؤمن يرى ذنوبه كأنه قاعد تحت جبل يخاف أن يقع عليه. <br> وأما الفاجر يرى ذنوبه كذباب مر على أنفه فقال به هكذا قال أبو شهاب : أشار بيده فوق أنقه يحركها .</b>',
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '6': {
    title: ' الحديث الخامس  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-5/hadith-64.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith5-bab5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> الغيرة: </b><span>الانفة، والغيرة في حق الناس تغير حالهم وانزعاجهم وهذا مستحيل في حق الله ومعنى غيرة الله منع الناس من الفواحش والمحرمات وأنه تعالى لا يرضى لهم ارتكابها</span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث',
    box1Items: [
    '<b> التحذير من اقتحام المعاصي والآثام لأنها تسبب غضب الله وتؤدي إلى الهلاك والطرد من دار السلام </b>',
    '<b> الله سبحانه أحب عباده واصطفاهم لنفسه وفتخ لهم باب التقرب والوصال، ولم يرض أن تجعل بينهم وبينه وسيلة. </b>',
    '<b>  أشد المؤمنين غيرة هو رسول الله لذلك كانت شديداً بالأمر بالمعروف والنهي عن المنكر وانتقامه لله</b>',
   ], 
    box2Title: '',
    box2Items: [
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '7': {
    title: ' الحديث السادس  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-60.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith6-1-bab5.png','/images/ryad/bab5/hadith6-2-bab5.png', ],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> أبرص: </b><span>  فيه برص  : وهو مرض جلد يصيب بياض في الجسد ويقال له البهاق</span></li>
        <li><b> أقرع: </b><span> ذهب شعر رأسه  </span></li>
        <li><b> يختبرهم: </b><span>يبتليهم </span></li>
        <li><b> قذرني: </b><span>  كرهني الناس واجتنبوني </span></li>
        <li><b> فلا بلاغ: </b><span> البلاغ: وهو ما يتوصل به الى الشيء المطلوب </span></li>
        <li><b> كابر عن كابر: </b><span> أباً عن جد</span></li>
        <li><b> ناقة عشراء: </b><span> أتى ع حملها عشرة أشهر  </span></li>
        <li><b> أتبلغ: </b><span>   أتوصل به الى الشيء المطلوب.</span></li>
      </ul>
    </div>
  `,
    box1Title: ' فوائد الحديث ',
    box1Items: [
      '<b> فضل الصدقة والحث على الرفق بالضعفاء و إكرامهم وتبليغهم مايطلبون.  </b>',
      '<b>  جواز ذكر أحوال من مضى من الناس لتتعظ به من سمعه ولا يكون في ذلك غيبة ولذلك لم يذكر أسماءهم</b>',
      '<b> الجزاء عند الله تعالى على ما يظهر من عمل الانسان بحسب نيته. </b>',
      '<b> التحدث بنعم الله والاعتراف به وشكر الله وحمده عليها   </b>',
      '<b> الزجر عن البخل لأنه تحمل صاحبه ع الكذب وجحد نعمة الله  </b>',
      '<b> الشكر الخالص لله يتجلى في اعتراف العبد بفضل الله عليه بقلبه ولسانه والمبادرة إلى الانفاق في سبيل الله </b>',
      '<b> للمال حلاوة قد تغير النفوس وأحوال القلوب فهي من فتن الدنيا فالسعيد هو الذي يعلم أن هذا المال هو مال الله فيقوم به في أوجه الخير بما يرضي الله. </b>'

    ],
    box2Title: ' ', 
    box2Items: [

    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '8': {
    title: ' الحديث السابع  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-61.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith7-bab5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b> الكيّس: </b><span> العاقل</span></li>
        <li><b>العاجز : </b><span> الضعيف التارك لما يجب فعله</span></li>
        <li><b> دان نفسه: </b><span> حاسبها ، أذلها</span></li>
        <li><b> دان الناس: </b><span> قهرهم على الطاعة ومنه اسم الله الدّيّان. </span></li>
      </ul>
    </div>
  `,
    box1Title: ' نبذة عن الراوي ',
    box1Items: [
    '<b class="nawawi-slut highlight-color">    صحابي جليل نزل الشام هو وابن اخيه حسان بن ثابت   </b>',
    '<b>  فصيحاً حكيماً كثير الورع والعبادة </b>',
    '<b>  اذا دخل فراشه يتقلب عليه لا يأتيه النوم فيقول: اللهم إن النار أذهبت مني النوم فيقوم فيصلي حتى يصبح </b>',
    '<b>  وكانت من خطبه ان الدنيا أجل حاضر يأكل منه البر والفاجر والآخرة أجل مستأخر يحكمها ملك قادر ألا وان الخير كله بحذافيره في الجنة  والشر كله بحذافيره في النار</b>',
    '<b> وتقول أبو الدرداء  لكل أمة .فقيه.. وفقيه هذا الأمة شداد  </b>',
    '<b> ويقول عبادة: فُضِل شداد بخصلتين ببيان اذ نطق وبكظم اذا غضب .. وهو محمد أوتو العلم والحلم </b>',
    '<b> له ٥٠ حديث </b>',
    '<b>  توفي في القدس.</b>'

    ],
    box2Title: 'فوائد الحديث ', 
    box2Items: [
    '<b> وجوب الأخذ بالحزم مع النفس ومحاسبتها و الايتان بواجب العبودية. </b>',
    '<b>  الناس قسمان: كيس وعاجز - الكس اللبيب العاقل الذي ينظر في عواقب الأمور، فهو يقهر نفسه ويستعملها فيما ينفعها بعد الموت.<br>  وأما العاجز الاحمق الجاهل لا يفكر بالعواقب بل يدع نفسه ع٦ هواه ولا يضره ما بعد الموت ..</b>',
    '<b> من حاسب نفسه ولم يتبع هواها ← عجل الجزاء ف الدينا ببركة العلم والرزق .. ومن تابع هوى نفسه تعجّل العار والفضيحة في الدينا ... حُرِم خيري الدنيام الآخرة   </b>',
    '<b>  التمني ← مذموم .... الرجاء ← محمود ... فالتمني يقضي بصاحبه إلى الكسل أو الرجاء يجعل قلبه معلق بالمحبوب</b>',

    ],
    box3Title: 'إضاءة',
    box3Items: [
      '<b class="nawawi-slut highlight-color">  يقول الحسن البصري: قوم يقولون نرجو الله ويضيعون العمل ؟  <br> فقال هيهات هيهات تلك أمانيهم يترجون فيها من رجا شيء طلبه ومن خاف شيء هرب منه  </b>',
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '9': {
    title: ' الحديث الثامن  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-62.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith8-bab5.png'],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b> من حسن : </b><span>  من علامات كماله واستقامته</span></li>
       <li><b> يعنيه: </b><span> يشغله ويهمه.</span></li>
       <li><b> تركه مالا يعنيه: </b><span>ما لا يحتاجه ولا ضرورة إليه. </span></li>
      </ul>
    </div>
  `,
    box1Title: ' فوائد الحديث ',
    box1Items: [
     '<b>  على الانسان أن يشتغل بمافيه صلاحه معاداً و معاشاً</b>',
     '<b>  رأس مال العبد أوقاته ... فإن صرفها فيما لا يعنيه لم يدخر ثواباً في الآخرة ... بل أضاع رأس ماله</b>',
     '<b>  يُفهم من هذا الحديث أن يأخذ العبد ما لايهمه من العلوم ويترك الأهم كمن ترك تعلم العلم الذي يصلح به نفيه واشتغل بتعلم ما يصلح غيره كعلم الجدل</b>',

    ],
    box2Title: ' إضاءة', 
    box2Items: [
       '<b class="nawawi-slut highlight-color"> يقول الغزالي: حد مالا يعنيك في الكلام أن تتكلم لورط سكت لم تأثم ولا تضرر فإن شغلت بمالا يعنيك فإنك مضيع زمانك ومحاسب على عمل لسانك اذ تستبدل الذي هو أدنى بالذى هو خير ... <br> ولو شغلت لسانك بذكر الله لنفتح لك من نفحات الله</b>'
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '10': {
    title: ' الحديث التاسع  ', 
    name: '', 
    hintText: '',
    audioUrl: 'audio/ryad-bab-4/hadith-63.m4a',
    imageUrls: [ '/images/ryad/bab5/hadith9-bab5.png'],
explanation: `
  `,
    box1Title: ' فوائد الحديث ',
    box1Items: [
      '<b>  ينبغي المحافظة على الاسرار بين الزوجين</b>',
      '<b> يحل ضرب الزوجة ضرب غير مبرح اذا اقتضت الحاجة  </b>',
      '<b>  لا يحتكم الزوج إلى حاكم في الدين الا عند الضرورة لأن الحياة الزوجية مبنية على الستر و حفظ الاسرار</b>',
      '<b> أعطي للرجل حق القوامة على المرآة ليكون الراعي لحقوقها والقائم على أمرها.. فبقوامته وضبطه تستقيم الحياة بينها </b>'

    ],
    box2Title: ' ', 
    box2Items: [

    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }
}