export const RYAD_BAB4_HADITHS: Record<string, any> = {
'1': {
    title: 'باب التوبة', 
    name: '', 
    hintText: '',
    audioUrl: '',
    imageUrls: [ ''],
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list"> 
        <li><b> </b><span> </span></li>
   
      </ul>
    </div>
  `,
    box1Title: 'باب التوبة ',
    box1Items: [
  '• <b>التوبه: لغةً:</b>  الرجوع. ',
  '• <b> اصطلاحاً:</b>   هي الرجوع من البعد عن الله الى القرب اليه سبحانه ، هي الرجوع عما نهى الله عنه الى امره ،وعن معصيته الى طاعته ،وعما يكرهه الى ما يرضاه.',
    ],
    box2Title: ' حكم ،  شروط ،  انواع ،  وثمرات التوبة', 
    box2Items: [
  '• <b>حكم التوبه:</b> واجبه من كل ذنب. <br><br> ' ,
  '• <b> شروط التوبه:</b>  ',
    '١- الاقلاع عن المعصيه ',
    '٢- الندم على فعلها ',
    '٣- العزم على عدم العوده الى المعصيه<br> <br>',
  '• <b> انواع التوبه:</b>  ',
    ' ١- توبه واجبه: هي التوبه من ترك المأمور او فعل المحظور ←من الابرار المقتصدين ',
    '٢- توبه مستحبه: ترك المستحبات وفعل المكروهات ← السابقين المقربين<br><br>',
  '• <b> ثمرات التوبه:</b>  ',
    '١- تكفير السيئات حتى يصير كمن لا ذنب له  ',
    '٢- نيله درجات حتى يصير حبيباً'
    ],
    box3Title: ' أمور تساعدني على التوبة',
    box3Items: [
  '١- صدق النيه واخلاص التوبه لله',
  '٢- محاسبه النفس فهي تدفعك الى العباده الى الخيرات ',
  '٣- تذكير النفس بالموت وعذاب القبر',
  '٤- الصحبه الصالحه والبعد عن رفاق السوء ',
  '٥- مخالفه الهوى والتذكير بعواقب الذنوب ',

    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
}