export const RYAD_BAB131_HADITHS: Record<string, any> = {
  '1': {
    title: 'كتاب السلام',
    name: 'كتاب السلام',
    hintText:' مقدمة كتاب السلام ',
    audioUrl:'',
    imageUrls: [''],
    explantion: ``,
    box1Title: 'السلام',
    box1Items:[
    '<b> السلام:</b> هو اسم أسماء الله الحسنى ... هو السلامة من كل آفة ونقص <br> ومعناه الله معك وحافظك .' ,
    '<b> قال قتادة: </b> كانت تحية من كان قبلكم السجود فأعطى الله هذه الأمة السلام وهي تحية أهل الجنة',
    '<b> وقال أبو بكر</b>  السلام أمان الله في الأرض  <br>  وأصل السلام ثابت بالكتاب والسنة والإجماع <br> ابتداء السلام ← سنة <br>  ورد السلام ← واجب  <br>  وقيل ابتداء السلام ← سنة ع الكفاية <br>  ورد السلام ← فرض كفاية  <br> عليه أن يرفع صوته فى السلام أما إذا مكان فيه ينام يستحب خفض الصوت ',
    '<b>قال رسول الله: </b>  تمام تحيتكم المصافحة ',
    '<b>وقال الحسن:  </b> المصافحة تزيد في المودة ',
    '<b>وقال مجاهد: </b> بلغني إذا تراءى المتحابان فضحك أحدهما إلى الآخر وتصافحا تحاتت خطاياهما كما يتحاتّ الورق من الشجر'
    ],
    box2Title: '',
    box2Items:'',
    box3Title: '',
    box3Items:'',
    box4Title: '',
    box4Items:'',
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] 
  }
  },
  '2': {
    title: 'باب فضل السلام والأمر بإفشائه',
    name:'باب فضل السلام والأمر بإفشائه',
    hintText:'المقدمة',
    audioUrl:'',
    imageUrls: [''],
    explantion: ``,
    box1Title: 'باب فضل السلام والأمر بإفشائه',
    box1Items:[
    '<b> قال تعالى: ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّى تَسْتَأْنِسُوا وَتُسَلِّمُوا عَلَى أَهْلِهَا﴾ </b> <br> يا أيها المؤمنون لا تدخلوا بيوت الآخرين حتى تستأذنوا أهلها وتلقوا عليهم السلام  ',
    '<b>  ﴿فَإِذَا دَخَلْتُمْ بُيُوتًا فَسَلِّمُوا عَلَى أَنْفُسِكُمْ تَحِيَّةً مِنْ عِنْدِ اللهِ مُبَارَكَةً طَيِّبَةً﴾</b> <br>  إذا دخلتم البيوت فالقوا السلام على أهلها وقولوا: السلام عليكم ... فهذا اسلام طيب مبارك',
    '<b> {وَإِذَا حُيِّيتُمْ بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا..}</b> <br>إذا سلم عليكم أحد فردوا عليه بسلام أفضل أو تجبل سلامه  ',
    '<b>﴿هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ الْمُكْرَمِينَ (24) إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا ۖ قَالَ سَلَامٌ قَوْمٌ مُّنكَرُونَ (25)﴾ </b> <br> هل بلغك يامحمد خبر ضيوف ابراهيم عليه السلام الذين أكرمهم . ',
    ],
    box2Title: '',
    box2Items:'',
    box3Title: '',
    box3Items:'',
    box4Title: '',
    box4Items:'',
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] 
  }
},
  '3': {
    title: ' الحديث الأول ', 
    name:  'باب فضل السلام والأمر بإفشائه ', 
    hintText: ' الحديث الأول ', 
    audioUrl: '',
    //imageUrls: [ '/images/ryad/bab128/hadith4-bab128.png'],
    imageUrls: [ '/images/ryad/bab131/hadith1-bab131.png'],
explanation: `
<div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b>  أي الإسلام: </b><span>  أي أعماله  </span></li>
       <li><b> خير: </b><span> أكثر ثواباً  </span></li>
       <li><b> تقرأ السلام: </b><span>  أي تسلم</span></li>
      </ul>
    </div>`,
    box1Title:  'نبذة عن الراوي ', 
    box1Items: [
      '<b class="nawawi-slut">  أبو محمد عبد الله بن عمرو بن العاص   </b>', 
      '<b>   أمه ريطة بنت منبه بن الحجاح  </b> ', 
      '<b>   كان أصغر من أبيه بـ / ١٢ س /  </b> ', 
      '<b>  أسلم قبل أبيه   </b> ', 
      '<b>  كان حافظاً وفاضلاً  </b> ', 
      '<b>  قرأ الكتب المسابقة   </b> ', 
      '<b>  فاستأذن النبي أن يكتب حديثه فأذن له.. قال يا رسول الله أكتب كل ما أسمع منك في الرضا و العضب فقال : نعم فإني لا أقول إلا حقاً.   </b> ', 
      '<b>  وكان كثير الصيام والقيام.. وقد كان يواصل الصيام ... فنهاه رسول الله عند ذلك  </b> ', 
      '<b>   ودار ( حديث ) بينهم ثم أقره رسول الله على صيام يوم وليلة وقال عندما كبرت سنة لتني قبلت رخصة رسول الله  </b> ', 
      '<b>   كان يختم القرآن كل ثلاث </b> ', 
      '<b>   وقال: رأيت فيما يرى النائم في إحدى يدي عسلاً وفى الأخرى سمناً وأنا ألعقهما فذكرت ذلك لرسول الله فقال (تقرأ الكتابيين التوراة والقرآن) فكان يقرؤهما  </b> ', 
      '<b>  توفي في عهد يزيد بن معاوية  </b> ', 

    ],
    box2Title: 'فوائد الحديث', 
    box2Items: [
      '<b>  شمولية الإسلام لجميع الآداب والمكارم ولا يقتصر فقط على العبادات   </b>', 
      '<b>   استحباب الإطعام لأنه يؤلف القلوب ويزيد المحبة ويدل على كرم النفس  </b>', 
      '<b>  الترغيب على إفشاء السلام لأنه يزيد الألفه والمحبة بين الناس   </b>', 
      '<b>  لا يقوم مقام السلام غيره من صيغ التحية مثل صباح الخير ← لا تقوم مقام السلام عليكم   </b>', 
      '<b>   السلام أفضل من الرد ← وخصه بالذكر مع الاπطعام لأنه وسيله المحبة بين الناس </b>', 

    ],
    box3Title: ' ',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '4': {
    title: '  الحديث الثاني ', 
    name:  'باب فضل السلام والأمر بإفشائه ', 
    hintText:  '  الحديث الثاني ', 
    audioUrl: '',
    imageUrls: [ '/images/ryad/bab131/hadith2-bab131.png'],
explanation: ``,
    box1Title: 'فوائد الحديث', 
    box1Items: [
    '<b> فضيله آدم حين تولى الله تأديبه </b>',
    '<b> تأكيد السلام في حق هذه الأمه فقالت عائشه: عن رسول الله صلى الله عليه وسلم (ما حسدتكم اليهود على شيء ما حسدوكم على السلام والتأمين)</b>',
    '<b> اتفق العلماء على وجوب الرد لأن معنى السلام الأمان فإذا ابتدأ به المسلم ولم يجب أوهم الشر </b>',
    '<b> يستحب في رد السلام الزياده على الابتداء (فحيوا بأحسن منها أو ردوها)</b>',
    '<b> يشترط في صحه الرد أن يقع بعد السلام ... لا أن يقع معا </b>',
    '<b> السلام عليكم هي الصيغة المشروعة لابتداء السلام</b>',
    ],
    box2Title: '',
    box2Items: [
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '5': {
    title: '  الحديث الثالث ', 
    name:  'باب فضل السلام والأمر بإفشائه ', 
    hintText: '  الحديث الثالث ', 
    audioUrl: '',
    imageUrls: [ '/images/ryad/bab131/hadith3-bab131.png'],
explanation: `
<div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b>  عيادة المريض: </b><span> زيارته   </span></li>
       <li><b>اتباع الجنائز : </b><span> تشييعها</span></li>
       <li><b> تشميت العاطس: </b><span> الدعاء له   </span></li>
       <li><b> إفشاء السلام: </b><span>  الإكثار منه ونشره  </span></li>
       <li><b>إبرار المقسم : </b><span> أجابه إلى ما أقسم عليه   </span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث', 
    box1Items: [
    '<b> أمر النبي المسلمين بمكارم الأخلاق من أجل وحدتهم ومودتهم وصفاء قلوبهم </b>',
    '<b> نصرة المظلوم فرض على من قدر عليه سواء كان مسلماً او ذمياً (أهل الكتاب) ويكون نصره برد الحق إليه </b>',
    '<b> ابرار المقسم بما يخص المباحات فقط ومكارم الأخلاق أما إن كان من المحرمات لا يفعله</b>'
    ],
    box2Title: '',
    box2Items: [
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '6': {
    title: '  الحديث الرابع ', 
    name:  'باب فضل السلام والأمر بإفشائه ', 
    hintText: '  الحديث الرابع ', 
    audioUrl: '',
    imageUrls: [ '/images/ryad/bab131/hadith4-bab131.png'],
explanation: `
  <div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b> أفشوا: </b><span> من فشا ... إذا ظهر وانتشر وذاع  </span></li>
      </ul>
    </div>
  `,
    box1Title: 'فوائد الحديث' ,
    box1Items: [
    '<b>  لا يدخل الجنة إلا المؤمنون ومحبة المؤمنين من الإيمان  </b>',
    '<b>  الحث على افشاء السلام وبذله للمسلم  </b>',
    '<b> يكره إذا التقى الجماعة أن يخص بعضهم بالسلام دون الآخرين </b>',
    ],
    box2Title:'',
    box2Items: [
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '7': {
    title: '  الحديث الخامس ', 
    name:  'باب فضل السلام والأمر بإفشائه ', 
    hintText: '  الحديث الخامس ', 
    audioUrl: '',
    imageUrls: [ '/images/ryad/bab131/hadith5-bab131.png'],
explanation: ``,
    box1Title: 'نبذة عن الراوي', 
    box1Items: [
    '<b class= "nawawi-slut"> أبو يوسف </b>', 
    '<b> عبد الله بن سلام الاسرائيلي ثم الانصاري </b>',
    '<b> يكنى بأبي يوسف لانه من ولد يعقوب عليه السلام </b>',
    '<b> من بني قينقاع </b>',
    '<b> وهو أحد الأحبار </b>',
    '<b> كان حليفاً للأنصار </b>',
    '<b> أسلم أول ما قدم رسول الله المدينة وكان اسمه الحصين لما أسلم سماه رسول الله عبد الله ولما أسلم هو ومن معه من الهيود قالوا أحبار اليهود وأهل الكفر منهم: ما أمن بمحمد ولا تبعه إلا أشرارنا ولو كانوا من خيارنا ماتركوا دين أبائهم <br>   فأنزل الله: لَيْسُوا سَوَاءً ۗ مِّنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ إلى قوله: ﴿وَأُولَئِكَ مِنَ الصَّالِحِينَ﴾</b>',
    '<b> قال عبد الله: لما قدم رسول الله المدينة ذهبت لأنظر إليه فلما رأيته عرفت أن وجهه ليس بوجه كذاب وكان أول كلمة قالها: يا أيها الناس أفشوا السلام وأطعموا الطعام </b>',
    '<b> ويقول عبد الله: رأيت كأني في روضة، وسط الروضة عمود، في أعلى العمود عروة فقيل لي: إرقه قلت: لا استطيع .. فجاء وصيف فرفع ثيابي فرفعت ما ستمسكت بالعروة فانتبهت وأنا مستمسك فأخبرت رسول الله بذلك فقال: تلك الروضة روضة الإسلام وذلك العمود عمود الإسلام وتلك العروة عروة الوثقى ولا تزال مستمكاً بها حتى تموت</b>',
    '<b> وقال سعد: ماسمعت النبي يقول لأحد يمشي على الأرض (إنه من أهل الجنة) إلا لعبد الله بن سلام </b>',
    '<b> وعن معاذ بن جبل: التمسوا العلم عند أربعة وهم : عويمر أبي الدرداء - سلمان الفارسي - ابن مسعود - عبد الله بن سلام الذي كان يهودي وأسلم وسمعت رسول الله يقول: إنه عاشر عشرة في الجنة وكان أحد الذين حاولوا الدفاع عن عثمان يوم مقتله.</b>',
    '<b> توفي في المدينة بخلافة معاوية ٤٣هـ .</b>',
    ],
    box2Title: 'فوائد الحديث',
    box2Items: [
    '<b> الحث على افشاء السلام </b>',
    '<b> الإطعام يكون ندباً نحو الضيافة وفرض كفاية لسد حاجة المجتمع </b>',
    '<b> قيام الليل فضيلةً لا فريضة</b>',
    '<b> فعل الأمور السابقة سبباً لدخول الجنة بفضل من الله مع الناجين</b>',
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  },
  '8': {
    title: '  الحديث السادس ', 
    name:  'باب فضل السلام والأمر بإفشائه ', 
    hintText: '  الحديث السادس ', 
    audioUrl: '',
    imageUrls: [ '/images/ryad/bab131/hadith6-bab131.png'],
explanation: `
<div class="explanation-content">
      <ul class="vocabulary-list"> 
       <li><b> يغدو : </b><span>   الذهاب ما بين صلاة الفجر وطلوع الشمس ثم توسع به فاستعمل في الذهاب بكل الاوقات   </span></li>
       <li><b>  عمدنا: </b><span> قصدنا   </span></li>
       <li><b> السوق : </b><span>   موضع البياعات   </span></li>
       <li><b>  سقّاط: </b><span>  بيع سقط المتاع (رديئة وحقيرة)  </span></li>
       <li><b> بيعة : </b><span>   المراد الواحدة من المبيع وقيل البيعة النفيسة   </span></li>
       <li><b> مسكين : </b><span>  ذي حاجة  </span></li>
       <li><b>  فاستتبعني: </b><span>  طلب مني أن أتبعه   </span></li>
       <li><b> السوم : </b><span>  المساومة المجاذبة بين البائع والمشتري على السلعة وفصل ثمنها  </span></li>
       <li><b> السلع : </b><span>  جمع سلعة وهي ما يعرض للبيع  </span></li>
      </ul>
    </div>
 `,
    box1Title: 'نبذة عن الراوي',
    box1Items: [
    '<b class="nawawi-slut">  الطفيل </b>', 
    '<b>  أم الطفيل بنت الطفيل بن عمرو الدوسي  </b>',
    '<b>  لقب أبا بطن وكان صديق لعبد الله بن عمر </b>',
    '<b>  روى عن عمر وعن أبيه وعن ابن عمر </b>',
    '<b>  وهو رجل ثقة صالح. </b>',
    '<b>   ويقال ولد على عهد النبي وهو مشهور من الثقات التابعين</b>',
    ],
    box2Title:'فوائد الحديث',  
    box2Items: [
    '<b> على المسلم استحضار السنة الشريفة وآدابها في جميع أحواله  </b>', 
    '<b>  الحفاظ على أخوه المسلمين وتعاهد بعضهم مع بعض </b>', 
    '<b>  جواز ذكر بعض خلق الإنسان على وجه الملاطفة</b>', 
    '<b>  يمكن للمرء المسلم أن يعمر الأماكن بإحياء سنة أو فضيلة في أي مكان يكون فيه</b>', 
    ],
    box3Title: '',
    box3Items: [
    ],
    box4Title: '',
    box4Items: [],
    metaDescription:'',
    metaKeywords:'',
    quizQuestions: { 
    hadith_title_prov: '', // العنوان الذي تطلبه الـ Interface
    questions: [ // مصفوفة الأسئلة داخل خاصية questions
    {
      id: 1,
      text: '',
      options: [''],
      correctAnswer: '  ',
    
     }] } 
  }, 
 }