export const hadithDetails = {
  title: 'الْحَدِيثُ الرَّابِعَ عَشَرَ',
  name: '[ حُرْمَةُ دَمِ الْمُسْلِمِ ]',
  hintText: 'حرمه دم المسلم على المسلم.',
   phrases: [
    { text: 'الْحَدِيثُ الرَّابِعَ عَشَرَ: [ حُرْمَةُ دَمِ الْمُسْلِمِ ].', start: 0, end: 5.5},
    { text: 'عَنِ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ :', start: 5.6, end: 10.4},
    { text: 'قَالَ رَسُولُ اللهِ ﷺ :', start: 10.5, end: 13.7 },
    { text: '« لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ [ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنِّي رَسُولُ اللهِ ] إِلَّا بِإِحْدَى ثَلَاثٍ :', start: 13.8, end: 23 },
    { text: 'الثَّيِّبُ الزَّانِي ،', start: 23.1, end: 26.2 },
    { text: 'وَالنَّفْسُ بِالنَّفْسِ ،' , start: 26.3, end: 27.4}, 
    { text: 'وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ ».', start: 27.5, end: 31.9},
    { text: '  رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ. ', start: 32, end: 34 }
  ],
  
  // الشرح والمفردات
  explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b>لا يحل دم:</b> <span>اي لا تحل اراقته والمراد: القتل.</span></li>
        <li><b>امرئ:</b> <span>ذكر او انثى.</span></li>
        <li><b>مسلم:</b> <span>من حقق اركان الاسلام.</span></li>
        <li><b>يشهد:</b> <span>يقر ويعترف ان لا معبود بحق الا الله عز وجل.</span></li>
        <li><b>باحدى ثلاث:</b> <span>اي يحل قتله اذا فعل احدى هذه الثلاث.</span></li>
        <li><b>الثيب الزاني:</b> <span>المتزوج او المحصن ، كلمه الثيب تطلق على الذكر والانثى ، وقد اجمع الفقهاء على ان عقوبه الزاني المحصن الرجم حتى الموت.</span></li>
        <li><b>الزنا:</b> <span>ان يطأ رجل امراه حية في قبلها من غير عقد شرعي.</span></li>
        <li><b>النفس بالنفس:</b> <span>من قتل نفسا عمدا وبغير حق ، ويعني به النفوس المتكافئه في الاسلام والحريه ، لقوله ﷺ "لا يقتل مسلم بكافر".</span></li>
        <li><b>التارك لدينه:</b> <span>المراد بالدين: الإسلام ،والمقصود به: المرتد.</span></li>
        <li><b>المفارق للجماعه:</b> <span>تارك لجماعه المسلمين بالردة.</span></li>
      </ul>
    </div>
  `,
  audioUrl: 'audio/hadith/14.mpeg'
};

export const hadithImportanceList = [
'• <b>١. حرمه دم المسلم على المسلم.</b>',
  '• <b>٢. تحريم فعل احدى هذه الخصال وعظم وزرها حتى استحق فاعلها عقوبه القتل.</b>',
  '• <b>٣. وجوب حفظ الاعراض ونقائها لذلك شرع النكاح .</b>',
  '• <b>٤. الحث على التزام جماعه المسلمين وعدم مفارقتهم.</b>',
  '• <b>٥. الترهيب من قتل النفس التي حرم الله.</b>'
];
// 📝 الصندوق الثاني: من فوائد الحديث الشريف
export const hadithFawaedList = [
'• <b>استدل هذا الحديث ان تارك الصلاه لا يقتل بينما حديث (حرمه المسلم) تارك الصلاه يقتل.</b>',
  '• <b>فقال ابن الجوزيه ان الذي يترك الصلاه جحودا وكفرا ← كافر لتركه الصلاة.... قالصلاة ركن من اركان الدين (فمن تركها ترك دينه بالكليه).</b>'

];
