export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي نُجَيْدٍ عِمْرَانَ بْنِ الحُصَيْنِ الخُزَاعِيِّ رَضِيَ اللهُ عَنْهُمَا:', start: 0, end: 0 },
  { text: 'أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ رَسُولَ اللهِ ﷺ وَهِيَ حُبْلَى مِنَ الزِّنَى،', start: 0, end: 0 },
  { text: 'فَقَالَتْ: يَا رَسُولَ اللهِ،', start: 0, end: 0 },
  { text: 'أَصَبْتُ حَدّاً فَأَقِمْهُ عَلَيَّ.', start: 0, end: 0 },
  { text: 'فَدَعَا نَبِيُّ اللهِ ﷺ وَلِيَّهَا، فَقَالَ:', start: 0, end: 0 },
  { text: '«أَحْسِنْ إِلَيْهَا، فَإِذَا وَضَعَتْ فَأْتِنِي».', start: 0, end: 0 },
  { text: 'فَفَعَلَ، فَأَمَرَ بِهَا نَبِيُّ اللهِ ﷺ، فَشُدَّتْ عَلَيْهَا ثِيَابُهَا،', start: 0, end: 0 },
  { text: 'ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ،', start: 0, end: 0 },
  { text: 'ثُمَّ صَلَّى عَلَيْهَا،', start: 0, end: 0 },
  { text: 'فَقَالَ لَهُ عُمَرُ:', start: 0, end: 0 },
  { text: 'تُصَلِّي عَلَيْهَا يَا رَسُولَ اللهِ وَقَدْ زَنَتْ؟', start: 0, end: 0 },
  { text: 'قَالَ: «لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ المَدِينَةِ لَوَسِعَتْهُمْ،', start: 0, end: 0 },
  { text: 'وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا للهِ»', start: 0, end: 0 }

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
      <li><b>  اصبت حدّاً: </b> <span> فعلت ما يعاقب عليه بحد.</span></li>
      <li><b> فشدت: </b> <span>  جمعت اطرافها لتستتر.  </span></li>
      <li><b> فقال له عمر:</b> <span>  مستجلياً للحكمة وليس منكراً.  </span></li>
      <li><b> سبعين: </b> <span>   من العصاة.  </span></li>
      <li><b> لوسعتهم: </b> <span>   لكفتهم في رفع اثامهم. </span></li>
      <li><b> جادت بنفسها: </b> <span>    بذلتها لمرضاة الله تعالى. </span></li>
      </ul>
    </div>

  `,
  // رابط صوت متن الحديث السادس
   audioUrl:   'audio/ryad-bab-2/hadith-22.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:عبد الله بن كعب الانصاري السلمي.</b> <br> ١. ابو فضالة.<br> ٢. من كبار التابعين.  <br> ٣. ثقة جليل. <br> ٤. روى عن عمر وعثمان وعلي وجابر بن عبد الله وابن عباس. <br> ٥. كعب ابوه كان يكنى ابا البشير فكناه رسول الله ابو عبد الله بولده هذا فهو اكبر اولاده. <br> ٦. كان وصي أبيه. <br>  ٧. توفي في خلافة سليمان بن عبد الملك. <br>    ٨. كعب بن مالك: ابو عبد الله الانصاري الخزرجي السلمي ... شاعر رسول الله ... وأحد الثلاثة الذين خلفوا فتاب الله عليهم.  <br> ٩. شهد بيعة العقبة. <br>  ١٠. آخى النبي بينه وبين طلحة بن عبد الله.<br>  ١١. ذهب بصره في خلافة معاوية ... ولم يتخلف عن رسول الله الا في غزوة بدر وتبوك. <br> ١٢. يقول كعب: لما انكشفنا يوم أحد ، كنت أول من عرف رسول الله وبشرت به المسلمين انه حيّاً سوياً وانا في الشِّعب ... فدعا رسول الله كعباً بلأمته وكانت صفراء فلبسها كعب ولبس النبي مرة لأمة كعب ... وقاتل قتالاً شديداً حتى جرح 17 جرح. <br>  ١٣. كان من شعراء النبي: حسان بن ثابت ، وكعب بن مالك ، وعبد الله بن رواحة. <br> ١٤. كعب كان يخوف المشركين الحرب ، اما حسان فكان يذكر عيوبهم وأيامهم ، وابن رواحة كان يعيرهم بكفرهم.    '
];





export const hadithFawaedList = [
'<b> ١- عِظم امر المعصية.</b>',
'<b> ٢- صراحة المسلم وصدقه واعترافه بتقصيره وعدم تلفيق الاعذار.</b>',
'<b> ٣- رد غيبة المسلم غير المتهم بالباطل وجواز مدح المرء بما فيه من الخير اذا أمِن الفتنة.</b>',
'<b>٤- التاسف والبكاء على ما فات من الخير وأنَّ المرء اذ لاحت له فرصة في الطاعة فحقه ان يبادر اليها ولا يسوّف حتى لا يحرم منها. </b>',
'<b> ٥- فضيلة الصدق وملازمته وان كان فيه مشقة.</b>',
'<b>٦- التنبيه على اجتناب المعاصي.  </b>',
'<b> ٧- الورع و الاحتياط بمجانبة ما يخاف منه الوقوع في منهي عنه.</b>',
'<b>٨- تبريد حرّ المعصية بالتأسّي بالنظير. </b>',
'<b> ٩- استحباب صلاة ركعتين في المسجد للقادم من السفر.</b>',
'<b> ١٠- يعامل الانسان على الظاهر ويترك الباطن لله. </b>',
'<b>١١- وجوب إيثار طاعة الله ورسوله على مودة الصديق والقريب. </b>',
'<b>١٢- جواز إحراق ورقة فيها ذكر الله تعالى لمصلحة. </b>',
'<b>١٣- استحباب هجران اهل المعاصي والبدع الظاهرة وترك السلام عليهم ومقاطعتهم تحقيراً لمعصيتهم  وزجراً لهم. </b>',
'<b>١٤- استحباب القيام للقادم إكراماً له إن كان من أهل الفضل. </b>',
'<b> ١٥- استحباب التبشير بالخير وإكرام المبشر واستحباب تهنئة من رزقه الله خيراً ظاهراً.</b>',
'<b>١٦- استحباب سجود شكر عند تجدد نعمة ظاهرة او اندفاع بلية ظاهرة. </b>',
'<b> ١٧- استحباب التصديق بشيء صالح من ماله شكراً لله على احسانه.</b>',
'<b> ١٨- كراهية التصديق بجميع المال خشية إلا يصبر على الضائقة.</b>'

];

















