export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي نُجَيْدٍ عِمْرَانَ بْنِ الحُصَيْنِ الخُزَاعِيِّ رَضِيَ اللهُ عَنْهُمَا:', start: 0, end: 0 },
  { text: 'أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ رَسُولَ اللهِ ﷺ وَهِيَ حُبْلَى مِنَ الزِّنَى،', start: 0, end: 0 },
  { text: 'فَقَالَتْ: يَا رَسُولَ اللهِ،', start: 0, end: 0 },
  { text: 'أَصَبْتُ حَدّاً فَأَقِمْهُ عَلَيَّ.', start: 0, end: 0 },
  { text: 'فَدَعَا نَبِيُّ اللهِ ﷺ وَلِيَّهَا، فَقَالَ:', start: 0, end: 0 },
  { text: '«أَحْسِنْ إِلَيْهَا، فَإِذَا وَضَعَتْ فَأْتِنِي».', start: 0, end: 0 },
  { text: 'فَفَعَلَ، فَأَمَرَ بِهَا نَبِيُّ اللهِ ﷺ، فَشُدَّتْ عَلَيْهَا ثِيَابُهَا،', start: 0, end: 0 },
  { text: 'ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ،', start: 0, end: 0 },
  { text: 'ثُمَّ صَلَّى عَلَيْهَا،', start: 0, end: 0 },
  { text: 'فَقَالَ لَهُ عُمَرُ:', start: 0, end: 0 },
  { text: 'تُصَلِّي عَلَيْهَا يَا رَسُولَ اللهِ وَقَدْ زَنَتْ؟', start: 0, end: 0 },
  { text: 'قَالَ: «لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ المَدِينَةِ لَوَسِعَتْهُمْ،', start: 0, end: 0 },
  { text: 'وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا للهِ»', start: 0, end: 0 }

],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
      <li><b> عير قريش: </b> <span>   الإبل بأحمالها.</span></li>
      <li><b> ورّى بغيرها: </b> <span>  سترها وكنى عنها وأوهم يريد غيرها. </span></li>
      <li><b>ورّى: </b> <span> اخف مقصده واظهر غيره.   </span></li>
      <li><b> تبوك:</b> <span>  اسم موضع.  </span></li>
      <li><b> تخلّف: </b> <span>  لم يخرج معه الى الجهاد. </span></li>
      <li><b> ليلة العقبة:</b> <span>   هي الليلة التي بايع فيها الانصار النبي على الاسلام وان يؤيدوه وينصروه. </span></li>
       <li><b>  تواثقنا:</b> <span>  تبايعنا وتعاهدنا. </span></li>
      <li><b> مفازاً:</b> <span>   في الفلاة التي لا ماء فيها. </span></li>
       <li><b> فجلّى: </b> <span>  كشف وأوضح المقصد الذي يريده من غير تورية. </span></li>
      <li><b> ليتأهبوا:</b> <span>  ليستعدوا بما يحتاجون اليه في سفرهم.  </span></li>
       <li><b>  الأهبة:</b> <span> العدة.  </span></li>
      <li><b> طابت:</b> <span>   أينعت ونضجت. </span></li>
       <li><b> اصعر: </b> <span>  اميل. </span></li>
      <li><b>جهازي: </b> <span>  حاجيات سفري.  </span></li>
        <li><b> ممغوصاً: </b> <span>  مطعوناً في دينه. </span></li>
      <li><b>برداه: </b> <span>  الازار او الرداء.  </span></li>
        <li><b> لمزه: </b> <span>  طعنه.  </span></li>
      <li><b> عطفيه:</b> <span>  جانبيه (كناية على العجب والكِبر).  </span></li>
        <li><b> بثي: </b> <span>  اشد من الحزن.  </span></li>
      <li><b>ظهرك: </b> <span>  الظهر هي الابل التي تركب.  </span></li>
        <li><b> تنكرت: </b> <span>  تغيرت. </span></li>
      <li><b> اجلدهم:</b> <span>  اقواهم.  </span></li>
        <li><b> جفوة: </b> <span>  إعراض. </span></li>
      <li><b>حائط: </b> <span>  بستان.  </span></li>
        <li><b> نبطي: </b> <span>  فلاح وسمي بذلك لانه يستنبط الماء.  </span></li>
      <li><b> اوفى:</b> <span>   صعد وارتفع.  </span></li>
        <li><b> سلع: </b> <span> جبل في المدينة.  </span></li>
      <li><b> انخلع:</b> <span>  اتصدق.   </span></li>
        <li><b> ابلاه الله: </b> <span>  انعم عليه.  </span></li>
      <li><b>ساعة العسرة: </b> <span>  وقت الشدة.  </span></li>
       <li><b> أرجأ: </b> <span>  أخّر. </span></li>
      <li><b> الديوان:</b> <span>  الدفتر الذي يكتب فيه اسماء الجيش واهل العطاء.   </span></li>
       <li><b>  تفارط الغزو:</b> <span>  فات وقته وتقدم.  </span></li>
      <li><b>مبيضاً: </b> <span>  لابس البياض.  </span></li>
       <li><b> فأجمعت صدقه: </b> <span>  عزمت عليه. </span></li>
      <li><b> جدلاً:</b> <span>   مقابلة الحجة بالحجة. </span></li>
       <li><b> يؤنبوني: </b> <span>  المبالغة في التوبيخ والتعنيف. </span></li>
      <li><b>اسارقه النظر: </b> <span>   اختلس النظر اليه.  </span></li>
       <li><b> هوان: </b> <span>  الخزي. </span></li>
      <li><b> مضيعة:</b> <span>   الموضع الذي يضيع فيه الانسان ولا يعرف قدره.  </span></li>
       <li><b> فسجرتها: </b> <span>  الايقاد في التنور. </span></li>
      <li><b> فآذن الناس:</b> <span>   اعلمهم. </span></li>
      </ul>
    </div>

  `,


  // رابط صوت متن الحديث السادس
   audioUrl:   'audio/ryad-bab-2/hadith-22.m4a'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>الراوي:عبد الله بن كعب الانصاري السلمي.</b> <br> ١. ابو فضالة.<br> ٢. من كبار التابعين.  <br> ٣. ثقة جليل. <br> ٤. روى عن عمر وعثمان وعلي وجابر بن عبد الله وابن عباس. <br> ٥. كعب ابوه كان يكنى ابا البشير فكناه رسول الله ابو عبد الله بولده هذا فهو اكبر اولاده. <br> ٦. كان وصي أبيه. <br>  ٧. توفي في خلافة سليمان بن عبد الملك. <br>    ٨. كعب بن مالك: ابو عبد الله الانصاري الخزرجي السلمي ... شاعر رسول الله ... وأحد الثلاثة الذين خلفوا فتاب الله عليهم.  <br> ٩. شهد بيعة العقبة. <br>  ١٠. آخى النبي بينه وبين طلحة بن عبد الله.<br>  ١١. ذهب بصره في خلافة معاوية ... ولم يتخلف عن رسول الله الا في غزوة بدر وتبوك. <br> ١٢. يقول كعب: لما انكشفنا يوم أحد ، كنت أول من عرف رسول الله وبشرت به المسلمين انه حيّاً سوياً وانا في الشِّعب ... فدعا رسول الله كعباً بلأمته وكانت صفراء فلبسها كعب ولبس النبي مرة لأمة كعب ... وقاتل قتالاً شديداً حتى جرح 17 جرح. <br>  ١٣. كان من شعراء النبي: حسان بن ثابت ، وكعب بن مالك ، وعبد الله بن رواحة. <br> ١٤. كعب كان يخوف المشركين الحرب ، اما حسان فكان يذكر عيوبهم وأيامهم ، وابن رواحة كان يعيرهم بكفرهم.    '
];





export const hadithFawaedList = [
'<b> ١- عِظم امر المعصية.</b>',
'<b> ٢- صراحة المسلم وصدقه واعترافه بتقصيره وعدم تلفيق الاعذار.</b>',
'<b> ٣- رد غيبة المسلم غير المتهم بالباطل وجواز مدح المرء بما فيه من الخير اذا أمِن الفتنة.</b>',
'<b>٤- التاسف والبكاء على ما فات من الخير وأنَّ المرء اذ لاحت له فرصة في الطاعة فحقه ان يبادر اليها ولا يسوّف حتى لا يحرم منها. </b>',
'<b> ٥- فضيلة الصدق وملازمته وان كان فيه مشقة.</b>',
'<b>٦- التنبيه على اجتناب المعاصي.  </b>',
'<b> ٧- الورع و الاحتياط بمجانبة ما يخاف منه الوقوع في منهي عنه.</b>',
'<b>٨- تبريد حرّ المعصية بالتأسّي بالنظير. </b>',
'<b> ٩- استحباب صلاة ركعتين في المسجد للقادم من السفر.</b>',
'<b> ١٠- يعامل الانسان على الظاهر ويترك الباطن لله. </b>',
'<b>١١- وجوب إيثار طاعة الله ورسوله على مودة الصديق والقريب. </b>',
'<b>١٢- جواز إحراق ورقة فيها ذكر الله تعالى لمصلحة. </b>',
'<b>١٣- استحباب هجران اهل المعاصي والبدع الظاهرة وترك السلام عليهم ومقاطعتهم تحقيراً لمعصيتهم  وزجراً لهم. </b>',
'<b>١٤- استحباب القيام للقادم إكراماً له إن كان من أهل الفضل. </b>',
'<b> ١٥- استحباب التبشير بالخير وإكرام المبشر واستحباب تهنئة من رزقه الله خيراً ظاهراً.</b>',
'<b>١٦- استحباب سجود شكر عند تجدد نعمة ظاهرة او اندفاع بلية ظاهرة. </b>',
'<b> ١٧- استحباب التصديق بشيء صالح من ماله شكراً لله على احسانه.</b>',
'<b> ١٨- كراهية التصديق بجميع المال خشية إلا يصبر على الضائقة.</b>'

];

















