export const hadithDetails = {

 phrases: [
  { text: 'عَنْ أَبِي مُوسَى عَبْدِ اللهِ بنِ قَيْسٍ الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ ﷺ قَالَ:', start: 0, end: 8.7 },
  { text: '«إِنَّ اللهَ تَعَالَى يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ،', start: 8.8, end: 13.6 },
  { text: 'وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ اللَّيْلِ،', start: 13.7, end: 17 },
  { text: 'حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا»', start: 17.1, end: 20}
],
  // الشرح والمفردات التي تظهر عند الضغط على زر الشرح
/*explanation: `
    <div class="explanation-content">
      <ul class="vocabulary-list">
        <li><b> افرح:  </b> <span>  اشد فرحا. </span></li>
        <li><b>فلاة: </b> <span>  الارض الفقر التي لا ماء فيها. </span></li>
        <li><b>روحلته: </b> <span> الراحله من الابل وهي البعير القوي. </span></li>
        <li><b>اضله: </b> <span> ضيعه. </span></li>
        <li><b>الخطام: </b> <span> حبل ليف او شعر فيجعل في احدى طرفه حلقه ثم يشد فيه الطرف الاخر حتى يصير كالحلقه.   </span></li>
        <li><b>المعنى: </b> <span> الله يفرح بتوبه عبده اعظم واشد من فرحه هذا العبد براحلته التي ظن سبب هلاكه. </span></li>
      </ul>
    </div>
  `,*/
  // رابط صوت متن الحديث السادس
   audioUrl:  'audio/ryad-bab-2/hadith-16.mpeg'
};

// 📌 باکس 2: فوائد الحديث (تُعرض كمصفوفة عبر آلية *ngFor في صندوق الفوائد)
export const hadithImportanceList = [
'<b>١- سعه رحمه الله وكثرة تجاوزه عن المذنبين. </b>',
'<b>٢- تطيب نفوس العباد وتنشيطهم للتوبه وردعهم عن اليأس والقنوط من رحمه الله. </b>',
'<b>٣- قبول التوبه مستمر ما دام بابها مفتوح ، فيغلق بابها من طلوع الشمس من المغرب ، وهي علامه الساعه من علامات الكبرى. </b> ',

];




